/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const _Z_FLAG_T_HELLO_L: u32 = 32;
pub const _Z_FLAG_T_JOIN_T: u32 = 32;
pub const _Z_FLAG_T_JOIN_S: u32 = 64;
pub const _Z_FLAG_T_INIT_A: u32 = 32;
pub const _Z_FLAG_T_INIT_S: u32 = 64;
pub const _Z_FLAG_T_OPEN_A: u32 = 32;
pub const _Z_FLAG_T_OPEN_T: u32 = 64;
pub const _Z_FLAG_T_FRAME_R: u32 = 32;
pub const _Z_FLAG_T_FRAGMENT_R: u32 = 32;
pub const _Z_FLAG_T_FRAGMENT_M: u32 = 64;
pub const _Z_FLAG_T_CLOSE_S: u32 = 32;
pub const _Z_NO_PATCH: u32 = 0;
pub const _Z_CURRENT_PATCH: u32 = 1;
pub const _Z_CLOSE_GENERIC: u32 = 0;
pub const _Z_CLOSE_UNSUPPORTED: u32 = 1;
pub const _Z_CLOSE_INVALID: u32 = 2;
pub const _Z_CLOSE_MAX_TRANSPORTS: u32 = 3;
pub const _Z_CLOSE_MAX_LINKS: u32 = 4;
pub const _Z_CLOSE_EXPIRED: u32 = 5;
pub const _Z_RES_POOL_INIT_SIZE: u32 = 8;
pub const _Z_MATCHING_LISTENER_CTX_NULL_ID: u32 = 4294967295;
pub const _Z_QUERYABLE_COMPLETE_DEFAULT: u32 = 0;
pub const _Z_QUERYABLE_DISTANCE_DEFAULT: u32 = 0;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = ::std::os::raw::c_schar;
pub type __uint_least8_t = ::std::os::raw::c_uchar;
pub type __int_least16_t = ::std::os::raw::c_short;
pub type __uint_least16_t = ::std::os::raw::c_ushort;
pub type __int_least32_t = ::std::os::raw::c_int;
pub type __uint_least32_t = ::std::os::raw::c_uint;
pub type __int_least64_t = ::std::os::raw::c_long;
pub type __uint_least64_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __uintptr_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type int_fast16_t = ::std::os::raw::c_short;
pub type uint_fast16_t = ::std::os::raw::c_ushort;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align_ld: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__max_align_ll"]
        [::std::mem::offset_of!(max_align_t, __max_align_ll) - 0usize];
    ["Offset of field: max_align_t::__max_align_ld"]
        [::std::mem::offset_of!(max_align_t, __max_align_ld) - 16usize];
};
unsafe extern "C" {
    pub fn __assert(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn __assert_func(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
    ) -> !;
}
pub type wint_t = ::std::os::raw::c_uint;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __dev_t = ::std::os::raw::c_short;
pub type __uid_t = ::std::os::raw::c_ushort;
pub type __gid_t = ::std::os::raw::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = ::std::os::raw::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = ::std::os::raw::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = ::std::os::raw::c_long;
pub type _fpos_t = ::std::os::raw::c_long;
pub type __size_t = ::std::os::raw::c_ulong;
pub type _ssize_t = ::std::os::raw::c_long;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [::std::os::raw::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t"][::std::mem::size_of::<_mbstate_t>() - 8usize];
    ["Alignment of _mbstate_t"][::std::mem::align_of::<_mbstate_t>() - 4usize];
    ["Offset of field: _mbstate_t::__count"][::std::mem::offset_of!(_mbstate_t, __count) - 0usize];
    ["Offset of field: _mbstate_t::__value"][::std::mem::offset_of!(_mbstate_t, __value) - 4usize];
};
pub type _iconv_t = *mut ::std::os::raw::c_void;
pub type __clock_t = ::std::os::raw::c_ulong;
pub type __time_t = ::std::os::raw::c_long;
pub type __clockid_t = ::std::os::raw::c_ulong;
pub type __daddr_t = ::std::os::raw::c_long;
pub type __timer_t = ::std::os::raw::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = ::std::os::raw::c_int;
pub type __nlink_t = ::std::os::raw::c_ushort;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_ulong;
pub type __va_list = __builtin_va_list;
pub type __ULong = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock {
    _unused: [u8; 0],
}
pub type _LOCK_T = *mut __lock;
unsafe extern "C" {
    pub fn __retarget_lock_init(lock: *mut _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_init_recursive(lock: *mut _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_close(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_close_recursive(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_acquire(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_acquire_recursive(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_try_acquire(lock: _LOCK_T) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __retarget_lock_try_acquire_recursive(lock: _LOCK_T) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __retarget_lock_release(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_release_recursive(lock: _LOCK_T);
}
pub type _flock_t = _LOCK_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: ::std::os::raw::c_int,
    pub _maxwds: ::std::os::raw::c_int,
    pub _sign: ::std::os::raw::c_int,
    pub _wds: ::std::os::raw::c_int,
    pub _x: [__ULong; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Bigint"][::std::mem::size_of::<_Bigint>() - 32usize];
    ["Alignment of _Bigint"][::std::mem::align_of::<_Bigint>() - 8usize];
    ["Offset of field: _Bigint::_next"][::std::mem::offset_of!(_Bigint, _next) - 0usize];
    ["Offset of field: _Bigint::_k"][::std::mem::offset_of!(_Bigint, _k) - 8usize];
    ["Offset of field: _Bigint::_maxwds"][::std::mem::offset_of!(_Bigint, _maxwds) - 12usize];
    ["Offset of field: _Bigint::_sign"][::std::mem::offset_of!(_Bigint, _sign) - 16usize];
    ["Offset of field: _Bigint::_wds"][::std::mem::offset_of!(_Bigint, _wds) - 20usize];
    ["Offset of field: _Bigint::_x"][::std::mem::offset_of!(_Bigint, _x) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: ::std::os::raw::c_int,
    pub __tm_min: ::std::os::raw::c_int,
    pub __tm_hour: ::std::os::raw::c_int,
    pub __tm_mday: ::std::os::raw::c_int,
    pub __tm_mon: ::std::os::raw::c_int,
    pub __tm_year: ::std::os::raw::c_int,
    pub __tm_wday: ::std::os::raw::c_int,
    pub __tm_yday: ::std::os::raw::c_int,
    pub __tm_isdst: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __tm"][::std::mem::size_of::<__tm>() - 36usize];
    ["Alignment of __tm"][::std::mem::align_of::<__tm>() - 4usize];
    ["Offset of field: __tm::__tm_sec"][::std::mem::offset_of!(__tm, __tm_sec) - 0usize];
    ["Offset of field: __tm::__tm_min"][::std::mem::offset_of!(__tm, __tm_min) - 4usize];
    ["Offset of field: __tm::__tm_hour"][::std::mem::offset_of!(__tm, __tm_hour) - 8usize];
    ["Offset of field: __tm::__tm_mday"][::std::mem::offset_of!(__tm, __tm_mday) - 12usize];
    ["Offset of field: __tm::__tm_mon"][::std::mem::offset_of!(__tm, __tm_mon) - 16usize];
    ["Offset of field: __tm::__tm_year"][::std::mem::offset_of!(__tm, __tm_year) - 20usize];
    ["Offset of field: __tm::__tm_wday"][::std::mem::offset_of!(__tm, __tm_wday) - 24usize];
    ["Offset of field: __tm::__tm_yday"][::std::mem::offset_of!(__tm, __tm_yday) - 28usize];
    ["Offset of field: __tm::__tm_isdst"][::std::mem::offset_of!(__tm, __tm_isdst) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut ::std::os::raw::c_void; 32usize],
    pub _dso_handle: [*mut ::std::os::raw::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _on_exit_args"][::std::mem::size_of::<_on_exit_args>() - 520usize];
    ["Alignment of _on_exit_args"][::std::mem::align_of::<_on_exit_args>() - 8usize];
    ["Offset of field: _on_exit_args::_fnargs"]
        [::std::mem::offset_of!(_on_exit_args, _fnargs) - 0usize];
    ["Offset of field: _on_exit_args::_dso_handle"]
        [::std::mem::offset_of!(_on_exit_args, _dso_handle) - 256usize];
    ["Offset of field: _on_exit_args::_fntypes"]
        [::std::mem::offset_of!(_on_exit_args, _fntypes) - 512usize];
    ["Offset of field: _on_exit_args::_is_cxa"]
        [::std::mem::offset_of!(_on_exit_args, _is_cxa) - 516usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: ::std::os::raw::c_int,
    pub _fns: [::std::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args_ptr: *mut _on_exit_args,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _atexit"][::std::mem::size_of::<_atexit>() - 280usize];
    ["Alignment of _atexit"][::std::mem::align_of::<_atexit>() - 8usize];
    ["Offset of field: _atexit::_next"][::std::mem::offset_of!(_atexit, _next) - 0usize];
    ["Offset of field: _atexit::_ind"][::std::mem::offset_of!(_atexit, _ind) - 8usize];
    ["Offset of field: _atexit::_fns"][::std::mem::offset_of!(_atexit, _fns) - 16usize];
    ["Offset of field: _atexit::_on_exit_args_ptr"]
        [::std::mem::offset_of!(_atexit, _on_exit_args_ptr) - 272usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _data: *mut _reent,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::std::os::raw::c_void,
            arg3: *mut ::std::os::raw::c_char,
            arg4: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::std::os::raw::c_void,
            arg3: *const ::std::os::raw::c_char,
            arg4: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::std::os::raw::c_void,
            arg3: _fpos_t,
            arg4: ::std::os::raw::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut ::std::os::raw::c_uchar,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: _off_t,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 184usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_data"][::std::mem::offset_of!(__sFILE, _data) - 48usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 72usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 80usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 88usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 96usize];
    ["Offset of field: __sFILE::_up"][::std::mem::offset_of!(__sFILE, _up) - 112usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 120usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 124usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 127usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 128usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 144usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 152usize];
    ["Offset of field: __sFILE::_lock"][::std::mem::offset_of!(__sFILE, _lock) - 160usize];
    ["Offset of field: __sFILE::_mbstate"][::std::mem::offset_of!(__sFILE, _mbstate) - 168usize];
    ["Offset of field: __sFILE::_flags2"][::std::mem::offset_of!(__sFILE, _flags2) - 176usize];
};
pub type __FILE = __sFILE;
unsafe extern "C" {
    pub static mut __sf: [__FILE; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: ::std::os::raw::c_int,
    pub _iobs: *mut __FILE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _glue"][::std::mem::size_of::<_glue>() - 24usize];
    ["Alignment of _glue"][::std::mem::align_of::<_glue>() - 8usize];
    ["Offset of field: _glue::_next"][::std::mem::offset_of!(_glue, _next) - 0usize];
    ["Offset of field: _glue::_niobs"][::std::mem::offset_of!(_glue, _niobs) - 8usize];
    ["Offset of field: _glue::_iobs"][::std::mem::offset_of!(_glue, _iobs) - 16usize];
};
unsafe extern "C" {
    pub static mut __sglue: _glue;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [::std::os::raw::c_ushort; 3usize],
    pub _mult: [::std::os::raw::c_ushort; 3usize],
    pub _add: ::std::os::raw::c_ushort,
    pub _rand_next: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _rand48"][::std::mem::size_of::<_rand48>() - 24usize];
    ["Alignment of _rand48"][::std::mem::align_of::<_rand48>() - 8usize];
    ["Offset of field: _rand48::_seed"][::std::mem::offset_of!(_rand48, _seed) - 0usize];
    ["Offset of field: _rand48::_mult"][::std::mem::offset_of!(_rand48, _mult) - 6usize];
    ["Offset of field: _rand48::_add"][::std::mem::offset_of!(_rand48, _add) - 12usize];
    ["Offset of field: _rand48::_rand_next"][::std::mem::offset_of!(_rand48, _rand_next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _mprec {
    pub _result: *mut _Bigint,
    pub _result_k: ::std::os::raw::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mprec"][::std::mem::size_of::<_mprec>() - 32usize];
    ["Alignment of _mprec"][::std::mem::align_of::<_mprec>() - 8usize];
    ["Offset of field: _mprec::_result"][::std::mem::offset_of!(_mprec, _result) - 0usize];
    ["Offset of field: _mprec::_result_k"][::std::mem::offset_of!(_mprec, _result_k) - 8usize];
    ["Offset of field: _mprec::_p5s"][::std::mem::offset_of!(_mprec, _p5s) - 16usize];
    ["Offset of field: _mprec::_freelist"][::std::mem::offset_of!(_mprec, _freelist) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _misc_reent {
    pub _strtok_last: *mut ::std::os::raw::c_char,
    pub _mblen_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _l64a_buf: [::std::os::raw::c_char; 8usize],
    pub _getdate_err: ::std::os::raw::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _misc_reent"][::std::mem::size_of::<_misc_reent>() - 88usize];
    ["Alignment of _misc_reent"][::std::mem::align_of::<_misc_reent>() - 8usize];
    ["Offset of field: _misc_reent::_strtok_last"]
        [::std::mem::offset_of!(_misc_reent, _strtok_last) - 0usize];
    ["Offset of field: _misc_reent::_mblen_state"]
        [::std::mem::offset_of!(_misc_reent, _mblen_state) - 8usize];
    ["Offset of field: _misc_reent::_wctomb_state"]
        [::std::mem::offset_of!(_misc_reent, _wctomb_state) - 16usize];
    ["Offset of field: _misc_reent::_mbtowc_state"]
        [::std::mem::offset_of!(_misc_reent, _mbtowc_state) - 24usize];
    ["Offset of field: _misc_reent::_l64a_buf"]
        [::std::mem::offset_of!(_misc_reent, _l64a_buf) - 32usize];
    ["Offset of field: _misc_reent::_getdate_err"]
        [::std::mem::offset_of!(_misc_reent, _getdate_err) - 40usize];
    ["Offset of field: _misc_reent::_mbrlen_state"]
        [::std::mem::offset_of!(_misc_reent, _mbrlen_state) - 44usize];
    ["Offset of field: _misc_reent::_mbrtowc_state"]
        [::std::mem::offset_of!(_misc_reent, _mbrtowc_state) - 52usize];
    ["Offset of field: _misc_reent::_mbsrtowcs_state"]
        [::std::mem::offset_of!(_misc_reent, _mbsrtowcs_state) - 60usize];
    ["Offset of field: _misc_reent::_wcrtomb_state"]
        [::std::mem::offset_of!(_misc_reent, _wcrtomb_state) - 68usize];
    ["Offset of field: _misc_reent::_wcsrtombs_state"]
        [::std::mem::offset_of!(_misc_reent, _wcsrtombs_state) - 76usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _reent {
    pub _errno: ::std::os::raw::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: ::std::os::raw::c_int,
    pub _emergency: *mut ::std::os::raw::c_char,
    pub _reserved_0: ::std::os::raw::c_int,
    pub _reserved_1: ::std::os::raw::c_int,
    pub _locale: *mut __locale_t,
    pub _mp: *mut _mprec,
    pub __cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _gamma_signgam: ::std::os::raw::c_int,
    pub _cvtlen: ::std::os::raw::c_int,
    pub _cvtbuf: *mut ::std::os::raw::c_char,
    pub _r48: *mut _rand48,
    pub _localtime_buf: *mut __tm,
    pub _asctime_buf: *mut ::std::os::raw::c_char,
    pub _sig_func: *mut ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub _reserved_6: *mut _atexit,
    pub _reserved_7: _atexit,
    pub _reserved_8: _glue,
    pub __sf: *mut __FILE,
    pub _misc: *mut _misc_reent,
    pub _signal_buf: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent"][::std::mem::size_of::<_reent>() - 464usize];
    ["Alignment of _reent"][::std::mem::align_of::<_reent>() - 8usize];
    ["Offset of field: _reent::_errno"][::std::mem::offset_of!(_reent, _errno) - 0usize];
    ["Offset of field: _reent::_stdin"][::std::mem::offset_of!(_reent, _stdin) - 8usize];
    ["Offset of field: _reent::_stdout"][::std::mem::offset_of!(_reent, _stdout) - 16usize];
    ["Offset of field: _reent::_stderr"][::std::mem::offset_of!(_reent, _stderr) - 24usize];
    ["Offset of field: _reent::_inc"][::std::mem::offset_of!(_reent, _inc) - 32usize];
    ["Offset of field: _reent::_emergency"][::std::mem::offset_of!(_reent, _emergency) - 40usize];
    ["Offset of field: _reent::_reserved_0"][::std::mem::offset_of!(_reent, _reserved_0) - 48usize];
    ["Offset of field: _reent::_reserved_1"][::std::mem::offset_of!(_reent, _reserved_1) - 52usize];
    ["Offset of field: _reent::_locale"][::std::mem::offset_of!(_reent, _locale) - 56usize];
    ["Offset of field: _reent::_mp"][::std::mem::offset_of!(_reent, _mp) - 64usize];
    ["Offset of field: _reent::__cleanup"][::std::mem::offset_of!(_reent, __cleanup) - 72usize];
    ["Offset of field: _reent::_gamma_signgam"]
        [::std::mem::offset_of!(_reent, _gamma_signgam) - 80usize];
    ["Offset of field: _reent::_cvtlen"][::std::mem::offset_of!(_reent, _cvtlen) - 84usize];
    ["Offset of field: _reent::_cvtbuf"][::std::mem::offset_of!(_reent, _cvtbuf) - 88usize];
    ["Offset of field: _reent::_r48"][::std::mem::offset_of!(_reent, _r48) - 96usize];
    ["Offset of field: _reent::_localtime_buf"]
        [::std::mem::offset_of!(_reent, _localtime_buf) - 104usize];
    ["Offset of field: _reent::_asctime_buf"]
        [::std::mem::offset_of!(_reent, _asctime_buf) - 112usize];
    ["Offset of field: _reent::_sig_func"][::std::mem::offset_of!(_reent, _sig_func) - 120usize];
    ["Offset of field: _reent::_reserved_6"]
        [::std::mem::offset_of!(_reent, _reserved_6) - 128usize];
    ["Offset of field: _reent::_reserved_7"]
        [::std::mem::offset_of!(_reent, _reserved_7) - 136usize];
    ["Offset of field: _reent::_reserved_8"]
        [::std::mem::offset_of!(_reent, _reserved_8) - 416usize];
    ["Offset of field: _reent::__sf"][::std::mem::offset_of!(_reent, __sf) - 440usize];
    ["Offset of field: _reent::_misc"][::std::mem::offset_of!(_reent, _misc) - 448usize];
    ["Offset of field: _reent::_signal_buf"]
        [::std::mem::offset_of!(_reent, _signal_buf) - 456usize];
};
unsafe extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
unsafe extern "C" {
    pub static mut _impure_data: _reent;
}
unsafe extern "C" {
    pub fn __getreent() -> *mut _reent;
}
unsafe extern "C" {
    pub static mut __atexit: *mut _atexit;
}
unsafe extern "C" {
    pub static mut __atexit0: _atexit;
}
unsafe extern "C" {
    pub static mut __stdio_exit_handler: ::std::option::Option<unsafe extern "C" fn()>;
}
unsafe extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
unsafe extern "C" {
    pub fn _fwalk_sglue(
        arg1: *mut _reent,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut __FILE) -> ::std::os::raw::c_int,
        >,
        arg3: *mut _glue,
    ) -> ::std::os::raw::c_int;
}
pub type locale_t = *mut __locale_t;
unsafe extern "C" {
    pub fn bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn explicit_bzero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn ffs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fls(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn index(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strerror(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlen(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strncat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strcoll_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strtok_r(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memccpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn stpcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strdup(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strdup_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strndup_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> usize;
}
unsafe extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strnstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlwr(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strupr(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__signo: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
pub type off_t = __off_t;
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        arg1: *mut ::std::os::raw::c_void,
        _size: ::std::os::raw::c_ulong,
        _n: ::std::os::raw::c_ulong,
        arg2: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        arg1: *const ::std::os::raw::c_void,
        _size: ::std::os::raw::c_ulong,
        _n: ::std::os::raw::c_ulong,
        arg2: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fopen(
        _name: *const ::std::os::raw::c_char,
        _type: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseeko(
        arg1: *mut FILE,
        arg2: off_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asiprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asniprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn diprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fiprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fiscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iprintf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn siprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn siscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sniprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasiprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasniprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn vasnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn vdiprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfiprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfiscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn viprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn viscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsiprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsiscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsniprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmemopen(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _asiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _asniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _asnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _asprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _diprintf_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _dprintf_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fclose_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fcloseall_r(arg1: *mut _reent) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fdopen_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _fflush_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fgetc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fgetc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fgets_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _fgets_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _fgetpos_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *mut fpos_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fsetpos_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const fpos_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fmemopen_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _fopen_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _freopen_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _fprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fpurge_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fputc_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fputc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fputs_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fputs_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fread_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fread_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fseek_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: ::std::os::raw::c_long,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fseeko_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: _off_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _ftell_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _ftello_r(arg1: *mut _reent, arg2: *mut FILE) -> _off_t;
}
unsafe extern "C" {
    pub fn _rewind_r(arg1: *mut _reent, arg2: *mut FILE);
}
unsafe extern "C" {
    pub fn _fwrite_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fwrite_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _getc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _getc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _getchar_r(arg1: *mut _reent) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _getchar_unlocked_r(arg1: *mut _reent) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _gets_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _iprintf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _open_memstream_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _perror_r(arg1: *mut _reent, arg2: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn _printf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putc_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putchar_unlocked_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putchar_r(arg1: *mut _reent, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _puts_r(arg1: *mut _reent, arg2: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _remove_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _rename_r(
        arg1: *mut _reent,
        _old: *const ::std::os::raw::c_char,
        _new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _scanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _siprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _siscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _sniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _snprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _sprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _sscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tempnam_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _tmpfile_r(arg1: *mut _reent) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _tmpnam_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _ungetc_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vasiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vasniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _vasnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _vasprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vdiprintf_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vdprintf_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vfiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vfiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vfprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vfscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _viprintf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _viscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vprintf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsiprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsiscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _vsscanf_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __getdelim(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn __getline(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        arg1: *mut ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        arg1: *const ::std::os::raw::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn __srget_r(arg1: *mut _reent, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __swbuf_r(
        arg1: *mut _reent,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        __cookie: *const ::std::os::raw::c_void,
        __readfn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __buf: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        __writefn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __buf: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        __seekfn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __off: fpos_t,
                __whence: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        __closefn: ::std::option::Option<
            unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _funopen_r(
        arg1: *mut _reent,
        __cookie: *const ::std::os::raw::c_void,
        __readfn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __buf: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        __writefn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __buf: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        __seekfn: ::std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::std::os::raw::c_void,
                __off: fpos_t,
                __whence: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        __closefn: ::std::option::Option<
            unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
pub type z_result_t = i8;
pub const _z_res_t__Z_RES_OK: _z_res_t = 0;
pub const _z_res_t_Z_OK: _z_res_t = 0;
pub const _z_res_t__Z_RES_CHANNEL_CLOSED: _z_res_t = 1;
pub const _z_res_t_Z_CHANNEL_DISCONNECTED: _z_res_t = 1;
pub const _z_res_t__Z_RES_CHANNEL_NODATA: _z_res_t = 2;
pub const _z_res_t_Z_CHANNEL_NODATA: _z_res_t = 2;
pub const _z_res_t__Z_NO_DATA_PROCESSED: _z_res_t = 3;
pub const _z_res_t_Z_NO_DATA_PROCESSED: _z_res_t = 3;
pub const _z_res_t__Z_ERR_MESSAGE_DESERIALIZATION_FAILED: _z_res_t = -119;
pub const _z_res_t__Z_ERR_MESSAGE_SERIALIZATION_FAILED: _z_res_t = -118;
pub const _z_res_t__Z_ERR_MESSAGE_UNEXPECTED: _z_res_t = -117;
pub const _z_res_t__Z_ERR_MESSAGE_FLAG_UNEXPECTED: _z_res_t = -116;
pub const _z_res_t__Z_ERR_MESSAGE_ZENOH_DECLARATION_UNKNOWN: _z_res_t = -115;
pub const _z_res_t__Z_ERR_MESSAGE_ZENOH_UNKNOWN: _z_res_t = -114;
pub const _z_res_t__Z_ERR_MESSAGE_TRANSPORT_UNKNOWN: _z_res_t = -113;
pub const _z_res_t__Z_ERR_MESSAGE_EXTENSION_MANDATORY_AND_UNKNOWN: _z_res_t = -112;
pub const _z_res_t__Z_ERR_ENTITY_DECLARATION_FAILED: _z_res_t = -111;
pub const _z_res_t__Z_ERR_ENTITY_UNKNOWN: _z_res_t = -110;
pub const _z_res_t__Z_ERR_KEYEXPR_UNKNOWN: _z_res_t = -109;
pub const _z_res_t__Z_ERR_KEYEXPR_NOT_MATCH: _z_res_t = -108;
pub const _z_res_t__Z_ERR_QUERY_NOT_MATCH: _z_res_t = -107;
pub const _z_res_t__Z_ERR_TRANSPORT_NOT_AVAILABLE: _z_res_t = -103;
pub const _z_res_t__Z_ERR_TRANSPORT_OPEN_FAILED: _z_res_t = -102;
pub const _z_res_t__Z_ERR_TRANSPORT_OPEN_SN_RESOLUTION: _z_res_t = -101;
pub const _z_res_t__Z_ERR_TRANSPORT_TX_FAILED: _z_res_t = -100;
pub const _z_res_t__Z_ERR_TRANSPORT_RX_FAILED: _z_res_t = -99;
pub const _z_res_t__Z_ERR_TRANSPORT_NO_SPACE: _z_res_t = -98;
pub const _z_res_t__Z_ERR_TRANSPORT_NOT_ENOUGH_BYTES: _z_res_t = -97;
pub const _z_res_t__Z_ERR_CONFIG_FAILED_INSERT: _z_res_t = -95;
pub const _z_res_t__Z_ERR_CONFIG_UNSUPPORTED_CLIENT_MULTICAST: _z_res_t = -94;
pub const _z_res_t__Z_ERR_CONFIG_UNSUPPORTED_PEER_UNICAST: _z_res_t = -93;
pub const _z_res_t__Z_ERR_CONFIG_LOCATOR_SCHEMA_UNKNOWN: _z_res_t = -92;
pub const _z_res_t__Z_ERR_CONFIG_LOCATOR_INVALID: _z_res_t = -91;
pub const _z_res_t__Z_ERR_CONFIG_INVALID_MODE: _z_res_t = -90;
pub const _z_res_t__Z_ERR_SCOUT_NO_RESULTS: _z_res_t = -87;
pub const _z_res_t__Z_ERR_SYSTEM_GENERIC: _z_res_t = -80;
pub const _z_res_t__Z_ERR_SYSTEM_TASK_FAILED: _z_res_t = -79;
pub const _z_res_t__Z_ERR_SYSTEM_OUT_OF_MEMORY: _z_res_t = -78;
pub const _z_res_t__Z_ERR_CONNECTION_CLOSED: _z_res_t = -77;
pub const _z_res_t__Z_ERR_DID_NOT_READ: _z_res_t = -76;
pub const _z_res_t__Z_ERR_INVALID: _z_res_t = -75;
pub const _z_res_t_Z_EINVAL: _z_res_t = -75;
pub const _z_res_t__Z_ERR_OVERFLOW: _z_res_t = -74;
pub const _z_res_t__Z_ERR_SESSION_CLOSED: _z_res_t = -73;
pub const _z_res_t_Z_EDESERIALIZE: _z_res_t = -72;
pub const _z_res_t_Z_ETIMEDOUT: _z_res_t = -71;
pub const _z_res_t__Z_ERR_GENERIC: _z_res_t = -128;
pub type _z_res_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn __locale_mb_cur_max() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_uniform(arg1: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoff(__nptr: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atoi_r(
        arg1: *mut _reent,
        __nptr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _atol_r(
        arg1: *mut _reent,
        __nptr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn getenv(__string: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _getenv_r(
        arg1: *mut _reent,
        __string: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _findenv(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _findenv_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut suboptarg: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn malloc(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mblen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mblen_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: *mut _mbstate_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mbtowc_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const ::std::os::raw::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wctomb_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: wchar_t,
        arg4: *mut _mbstate_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn _mbstowcs_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const ::std::os::raw::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn _wcstombs_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const wchar_t,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mkdtemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _mkdtemp_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _mkostemp_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mkostemps_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mkstemp_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mkstemps_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mktemp_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realloc(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn reallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn reallocf(arg1: *mut ::std::os::raw::c_void, arg2: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realpath(
        path: *const ::std::os::raw::c_char,
        resolved_path: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rpmatch(response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn strtod(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn _strtod_r(
        arg1: *mut _reent,
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtol(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _strtol_r(
        arg1: *mut _reent,
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _strtoul_r(
        arg1: *mut _reent,
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn system(__string: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a64l(__input: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn l64a(__input: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _l64a_r(
        arg1: *mut _reent,
        __input: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: *mut ::std::os::raw::c_void),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putenv_r(
        arg1: *mut _reent,
        __string: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _reallocf_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn setenv(
        __string: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _setenv_r(
        arg1: *mut _reent,
        __string: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __itoa(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __utoa(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn itoa(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn utoa(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn _drand48_r(arg1: *mut _reent) -> f64;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn _erand48_r(arg1: *mut _reent, arg2: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _jrand48_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn _lcong48_r(arg1: *mut _reent, arg2: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _lrand48_r(arg1: *mut _reent) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _mrand48_r(arg1: *mut _reent) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _nrand48_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn _seed48_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn _srand48_r(arg1: *mut _reent, arg2: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn setstate(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _atoll_r(
        arg1: *mut _reent,
        __nptr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn strtoll(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _strtoll_r(
        arg1: *mut _reent,
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strtoull_r(
        arg1: *mut _reent,
        __n: *const ::std::os::raw::c_char,
        __end_PTR: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn cfree(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn unsetenv(__string: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _unsetenv_r(
        arg1: *mut _reent,
        __string: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _dtoa_r(
        arg1: *mut _reent,
        arg2: f64,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _malloc_r(arg1: *mut _reent, arg2: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _calloc_r(arg1: *mut _reent, arg2: usize, arg3: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _free_r(arg1: *mut _reent, arg2: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _realloc_r(
        arg1: *mut _reent,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _mstats_r(arg1: *mut _reent, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn _system_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __eprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
        arg4: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}__bsd_qsort_r"]
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __thunk: *mut ::std::os::raw::c_void,
        _compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn _strtold_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn quick_exit(arg1: ::std::os::raw::c_int);
}
pub type esp_err_t = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " @brief Returns string for esp_err_t error codes\n\n This function finds the error code in a pre-generated lookup-table and\n returns its string representation.\n\n The function is generated by the Python script\n tools/gen_esp_err_to_name.py which should be run each time an esp_err_t\n error is modified, created or removed from the IDF project.\n\n @param code esp_err_t error code\n @return string error message"]
    pub fn esp_err_to_name(code: esp_err_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns string for esp_err_t and system error codes\n\n This function finds the error code in a pre-generated lookup-table of\n esp_err_t errors and returns its string representation. If the error code\n is not found then it is attempted to be found among system errors.\n\n The function is generated by the Python script\n tools/gen_esp_err_to_name.py which should be run each time an esp_err_t\n error is modified, created or removed from the IDF project.\n\n @param code esp_err_t error code\n @param[out] buf buffer where the error message should be written\n @param buflen Size of buffer buf. At most buflen bytes are written into the buf buffer (including the terminating null byte).\n @return buf containing the string error message"]
    pub fn esp_err_to_name_r(
        code: esp_err_t,
        buf: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @cond"]
    pub fn _esp_error_check_failed(
        rc: esp_err_t,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        function: *const ::std::os::raw::c_char,
        expression: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn _esp_error_check_failed_without_abort(
        rc: esp_err_t,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        function: *const ::std::os::raw::c_char,
        expression: *const ::std::os::raw::c_char,
    );
}
#[doc = " Function prototype for interrupt handler function"]
pub type intr_handler_t =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct intr_handle_data_t {
    _unused: [u8; 0],
}
#[doc = " Handle to an interrupt handler"]
pub type intr_handle_t = *mut intr_handle_data_t;
#[doc = "< Install the peripheral interrupt to ANY CPU core, decided by on which CPU the interrupt allocator is running"]
pub const esp_intr_cpu_affinity_t_ESP_INTR_CPU_AFFINITY_AUTO: esp_intr_cpu_affinity_t = 0;
#[doc = "< Install the peripheral interrupt to CPU core 0"]
pub const esp_intr_cpu_affinity_t_ESP_INTR_CPU_AFFINITY_0: esp_intr_cpu_affinity_t = 1;
#[doc = "< Install the peripheral interrupt to CPU core 1"]
pub const esp_intr_cpu_affinity_t_ESP_INTR_CPU_AFFINITY_1: esp_intr_cpu_affinity_t = 2;
#[doc = " @brief Interrupt CPU core affinity\n\n This type specify the CPU core that the peripheral interrupt is connected to."]
pub type esp_intr_cpu_affinity_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    #[doc = " @brief Mark an interrupt as a shared interrupt\n\n This will mark a certain interrupt on the specified CPU as\n an interrupt that can be used to hook shared interrupt handlers\n to.\n\n @param intno The number of the interrupt (0-31)\n @param cpu CPU on which the interrupt should be marked as shared (0 or 1)\n @param is_in_iram Shared interrupt is for handlers that reside in IRAM and\n                   the int can be left enabled while the flash cache is disabled.\n\n @return ESP_ERR_INVALID_ARG if cpu or intno is invalid\n         ESP_OK on success"]
    pub fn esp_intr_mark_shared(
        intno: ::std::os::raw::c_int,
        cpu: ::std::os::raw::c_int,
        is_in_iram: bool,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Reserve an interrupt to be used outside of this framework\n\n This will mark a certain interrupt on the specified CPU as\n reserved, not to be allocated for any reason.\n\n @param intno The number of the interrupt (0-31)\n @param cpu CPU on which the interrupt should be marked as shared (0 or 1)\n\n @return ESP_ERR_INVALID_ARG if cpu or intno is invalid\n         ESP_OK on success"]
    pub fn esp_intr_reserve(intno: ::std::os::raw::c_int, cpu: ::std::os::raw::c_int) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate an interrupt with the given parameters.\n\n This finds an interrupt that matches the restrictions as given in the flags\n parameter, maps the given interrupt source to it and hooks up the given\n interrupt handler (with optional argument) as well. If needed, it can return\n a handle for the interrupt as well.\n\n The interrupt will always be allocated on the core that runs this function.\n\n If ESP_INTR_FLAG_IRAM flag is used, and handler address is not in IRAM or\n RTC_FAST_MEM, then ESP_ERR_INVALID_ARG is returned.\n\n @param source The interrupt source. One of the ETS_*_INTR_SOURCE interrupt mux\n               sources, as defined in soc/soc.h, or one of the internal\n               ETS_INTERNAL_*_INTR_SOURCE sources as defined in this header.\n @param flags An ORred mask of the ESP_INTR_FLAG_* defines. These restrict the\n               choice of interrupts that this routine can choose from. If this value\n               is 0, it will default to allocating a non-shared interrupt of level\n               1, 2 or 3. If ESP_INTR_FLAG_SHARED mask is provided, a shared interrupt of\n               the given level will be allocated (or level 1 if not specified).\n               Setting ESP_INTR_FLAG_INTRDISABLED will return from this function with the\n               interrupt disabled.\n @param handler The interrupt handler. Must be NULL when an interrupt of level >3\n               is requested, because these types of interrupts aren't C-callable.\n @param arg    Optional argument for passed to the interrupt handler\n @param ret_handle Pointer to an intr_handle_t to store a handle that can later be\n               used to request details or free the interrupt. Can be NULL if no handle\n               is required.\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_ERR_NOT_FOUND No free interrupt found with the specified flags\n         ESP_OK on success"]
    pub fn esp_intr_alloc(
        source: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        handler: intr_handler_t,
        arg: *mut ::std::os::raw::c_void,
        ret_handle: *mut intr_handle_t,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate an interrupt with the given parameters, including an interrupt status register.\n\n\n This essentially does the same as esp_intr_alloc, but allows specifying a register and mask\n combo. For shared interrupts, the handler is only called if a read from the specified\n register, ANDed with the mask, returns non-zero. By passing an interrupt status register\n address and a fitting mask, this can be used to accelerate interrupt handling in the case\n a shared interrupt is triggered; by checking the interrupt statuses first, the code can\n decide which ISRs can be skipped\n\n @param source The interrupt source. One of the ETS_*_INTR_SOURCE interrupt mux\n               sources, as defined in soc/soc.h, or one of the internal\n               ETS_INTERNAL_*_INTR_SOURCE sources as defined in this header.\n @param flags An ORred mask of the ESP_INTR_FLAG_* defines. These restrict the\n               choice of interrupts that this routine can choose from. If this value\n               is 0, it will default to allocating a non-shared interrupt of level\n               1, 2 or 3. If ESP_INTR_FLAG_SHARED mask is provided, a shared interrupt of\n               the given level will be allocated (or level 1 if not specified).\n               Setting ESP_INTR_FLAG_INTRDISABLED will return from this function with the\n               interrupt disabled.\n @param intrstatusreg The address of an interrupt status register\n @param intrstatusmask A mask. If a read of address intrstatusreg has any of the bits\n               that are 1 in the mask set, the ISR will be called. If not, it will be\n               skipped.\n @param handler The interrupt handler. Must be NULL when an interrupt of level >3\n               is requested, because these types of interrupts aren't C-callable.\n @param arg    Optional argument for passed to the interrupt handler\n @param ret_handle Pointer to an intr_handle_t to store a handle that can later be\n               used to request details or free the interrupt. Can be NULL if no handle\n               is required.\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_ERR_NOT_FOUND No free interrupt found with the specified flags\n         ESP_OK on success"]
    pub fn esp_intr_alloc_intrstatus(
        source: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        intrstatusreg: u32,
        intrstatusmask: u32,
        handler: intr_handler_t,
        arg: *mut ::std::os::raw::c_void,
        ret_handle: *mut intr_handle_t,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate an interrupt with the given parameters that can be bound to an existing interrupt handler.\n\n\n This function does the same as esp_intr_alloc, but allows specifying a previously allocated handler as\n the interrupt to share with the given source. This can be very handy to treat two pre-determined interrupt\n sources in the same interrupt handler. The interrupt will be allocated on the same core as the given\n `shared_handle`. Moreover, make sure to specify the same interrupt level as the one being used by `shared_handle`\n to prevent any failure from this function.\n\n @param source The interrupt source. One of the ETS_*_INTR_SOURCE interrupt mux\n               sources, as defined in soc/soc.h, or one of the internal\n               ETS_INTERNAL_*_INTR_SOURCE sources as defined in this header.\n @param flags An ORred mask of the ESP_INTR_FLAG_* defines. These restrict the\n               choice of interrupts that this routine can choose from. If this value\n               is 0, it will default to allocating a non-shared interrupt of level\n               1, 2 or 3. If ESP_INTR_FLAG_SHARED mask is provided, a shared interrupt of\n               the given level will be allocated (or level 1 if not specified).\n               Setting ESP_INTR_FLAG_INTRDISABLED will return from this function with the\n               interrupt disabled.\n @param handler The interrupt handler. Must be NULL when an interrupt of level >3\n               is requested, because these types of interrupts aren't C-callable.\n @param arg    Optional argument for passed to the interrupt handler\n @param shared_handle Previously allocated interrupt to share the CPU interrupt line with. If NULL,\n               calling this function equivalent to esp_intr_alloc, else, ESP_INTR_FLAG_SHARED must\n               be provided in the flags parameter.\n @param ret_handle Pointer to an intr_handle_t to store a handle that can later be\n               used to request details or free the interrupt. Can be NULL if no handle\n               is required.\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_ERR_NOT_FOUND No free interrupt found with the specified flasg or the given level is different\n                           from the one assigned to the share_handle parameter.\n         ESP_OK on success"]
    pub fn esp_intr_alloc_bind(
        source: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        handler: intr_handler_t,
        arg: *mut ::std::os::raw::c_void,
        shared_handle: intr_handle_t,
        ret_handle: *mut intr_handle_t,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate an interrupt with the given parameters, including an interrupt status register, that can\n        be bound to an existing interrupt handler\n\n\n This function does the same as esp_intr_alloc_intrstatus, but allows specifying a previously allocated handler as\n the interrupt to share with the given source. This can be very handy to treat two pre-determined interrupt\n sources in the same interrupt handler. The interrupt will be allocated on the same core as the given\n `shared_handle`. Moreover, make sure to specify the same interrupt level as the one being used by `shared_handle`\n to prevent any failure from this function.\n\n @param source The interrupt source. One of the ETS_*_INTR_SOURCE interrupt mux\n               sources, as defined in soc/soc.h, or one of the internal\n               ETS_INTERNAL_*_INTR_SOURCE sources as defined in this header.\n @param flags An ORred mask of the ESP_INTR_FLAG_* defines. These restrict the\n               choice of interrupts that this routine can choose from. If this value\n               is 0, it will default to allocating a non-shared interrupt of level\n               1, 2 or 3. If ESP_INTR_FLAG_SHARED mask is provided, a shared interrupt of\n               the given level will be allocated (or level 1 if not specified).\n               Setting ESP_INTR_FLAG_INTRDISABLED will return from this function with the\n               interrupt disabled.\n @param intrstatusreg The address of an interrupt status register\n @param intrstatusmask A mask. If a read of address intrstatusreg has any of the bits\n               that are 1 in the mask set, the ISR will be called. If not, it will be\n               skipped.\n @param handler The interrupt handler. Must be NULL when an interrupt of level >3\n               is requested, because these types of interrupts aren't C-callable.\n @param arg    Optional argument for passed to the interrupt handler\n @param shared_handle Previously allocated interrupt to share the CPU interrupt line with. If NULL,\n               calling this function equivalent to esp_intr_alloc, else, ESP_INTR_FLAG_SHARED must\n               be provided in the flags parameter.\n @param ret_handle Pointer to an intr_handle_t to store a handle that can later be\n               used to request details or free the interrupt. Can be NULL if no handle\n               is required.\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_ERR_NOT_FOUND No free interrupt found with the specified flasg or the given level is different\n                           from the one assigned to the share_handle parameter.\n         ESP_OK on success"]
    pub fn esp_intr_alloc_intrstatus_bind(
        source: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        intrstatusreg: u32,
        intrstatusmask: u32,
        handler: intr_handler_t,
        arg: *mut ::std::os::raw::c_void,
        shared_handle: intr_handle_t,
        ret_handle: *mut intr_handle_t,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Disable and free an interrupt.\n\n Use an interrupt handle to disable the interrupt and release the resources associated with it.\n If the current core is not the core that registered this interrupt, this routine will be assigned to\n the core that allocated this interrupt, blocking and waiting until the resource is successfully released.\n\n @note\n When the handler shares its source with other handlers, the interrupt status\n bits it's responsible for should be managed properly before freeing it. see\n ``esp_intr_disable`` for more details. Please do not call this function in ``esp_ipc_call_blocking``.\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n\n @return ESP_ERR_INVALID_ARG the handle is NULL\n         ESP_FAIL failed to release this handle\n         ESP_OK on success"]
    pub fn esp_intr_free(handle: intr_handle_t) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Get CPU number an interrupt is tied to\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n\n @return The core number where the interrupt is allocated"]
    pub fn esp_intr_get_cpu(handle: intr_handle_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Get the allocated interrupt for a certain handle\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n\n @return The interrupt number"]
    pub fn esp_intr_get_intno(handle: intr_handle_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Disable the interrupt associated with the handle\n\n @note\n 1. For local interrupts (ESP_INTERNAL_* sources), this function has to be called on the\n CPU the interrupt is allocated on. Other interrupts have no such restriction.\n 2. When several handlers sharing a same interrupt source, interrupt status bits, which are\n handled in the handler to be disabled, should be masked before the disabling, or handled\n in other enabled interrupts properly. Miss of interrupt status handling will cause infinite\n interrupt calls and finally system crash.\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_OK on success"]
    pub fn esp_intr_disable(handle: intr_handle_t) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Enable the interrupt associated with the handle\n\n @note For local interrupts (ESP_INTERNAL_* sources), this function has to be called on the\n       CPU the interrupt is allocated on. Other interrupts have no such restriction.\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_OK on success"]
    pub fn esp_intr_enable(handle: intr_handle_t) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the \"in IRAM\" status of the handler.\n\n @note Does not work on shared interrupts.\n\n @param handle The handle, as obtained by esp_intr_alloc or esp_intr_alloc_intrstatus\n @param is_in_iram Whether the handler associated with this handle resides in IRAM.\n                   Handlers residing in IRAM can be called when cache is disabled.\n\n @return ESP_ERR_INVALID_ARG if the combination of arguments is invalid.\n         ESP_OK on success"]
    pub fn esp_intr_set_in_iram(handle: intr_handle_t, is_in_iram: bool) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Disable interrupts that aren't specifically marked as running from IRAM"]
    pub fn esp_intr_noniram_disable();
}
unsafe extern "C" {
    #[doc = " @brief Re-enable interrupts disabled by esp_intr_noniram_disable"]
    pub fn esp_intr_noniram_enable();
}
unsafe extern "C" {
    #[doc = " @brief enable the interrupt source based on its number\n @param inum interrupt number from 0 to 31"]
    pub fn esp_intr_enable_source(inum: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief disable the interrupt source based on its number\n @param inum interrupt number from 0 to 31"]
    pub fn esp_intr_disable_source(inum: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Dump the status of allocated interrupts\n @param stream  The stream to dump to, if NULL then stdout is used\n @return ESP_OK on success"]
    pub fn esp_intr_dump(stream: *mut FILE) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Check if the given pointer is in the safe ISR area.\n In other words, make sure that the pointer's content is accessible at\n any time, regardless of the cache status\n\n @param ptr Pointer to check\n\n @return true if `ptr` points to ISR area, false else"]
    pub fn esp_intr_ptr_in_isr_region(ptr: *mut ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    pub static Xthal_rev_no: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_save_extra(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_extra(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cpregs(base: *mut ::std::os::raw::c_void, arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn xthal_restore_cpregs(base: *mut ::std::os::raw::c_void, arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn xthal_save_cp0(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp1(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp2(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp3(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp4(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp5(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp6(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_save_cp7(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp0(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp1(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp2(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp3(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp4(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp5(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp6(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_restore_cp7(base: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub static mut Xthal_cpregs_save_fn: [*mut ::std::os::raw::c_void; 8usize];
}
unsafe extern "C" {
    pub static mut Xthal_cpregs_restore_fn: [*mut ::std::os::raw::c_void; 8usize];
}
unsafe extern "C" {
    pub static mut Xthal_cpregs_save_nw_fn: [*mut ::std::os::raw::c_void; 8usize];
}
unsafe extern "C" {
    pub static mut Xthal_cpregs_restore_nw_fn: [*mut ::std::os::raw::c_void; 8usize];
}
unsafe extern "C" {
    pub static Xthal_extra_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_extra_align: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cpregs_size: [::std::os::raw::c_uint; 8usize];
}
unsafe extern "C" {
    pub static Xthal_cpregs_align: [::std::os::raw::c_uint; 8usize];
}
unsafe extern "C" {
    pub static Xthal_all_extra_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_all_extra_align: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_names: [*const ::std::os::raw::c_char; 8usize];
}
unsafe extern "C" {
    pub fn xthal_init_mem_extra(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_init_mem_cp(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub static Xthal_num_coprocessors: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_num: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_max: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_num_aregs: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_num_aregs_log2: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_icache_linewidth: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dcache_linewidth: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_icache_linesize: ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub static Xthal_dcache_linesize: ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub static Xthal_icache_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_dcache_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_dcache_is_writeback: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn xthal_icache_region_invalidate(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_region_invalidate(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_region_writeback(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_region_writeback_inv(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_icache_line_invalidate(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_dcache_line_invalidate(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_dcache_line_writeback(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_dcache_line_writeback_inv(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_icache_sync();
}
unsafe extern "C" {
    pub fn xthal_dcache_sync();
}
unsafe extern "C" {
    pub fn xthal_icache_get_ways() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_icache_set_ways(ways: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_dcache_get_ways() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_dcache_set_ways(ways: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_cache_coherence_on();
}
unsafe extern "C" {
    pub fn xthal_cache_coherence_off();
}
unsafe extern "C" {
    pub fn xthal_cache_coherence_optin();
}
unsafe extern "C" {
    pub fn xthal_cache_coherence_optout();
}
unsafe extern "C" {
    pub fn xthal_get_cache_prefetch() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_cache_prefetch(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_cache_prefetch_long(
        arg1: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static Xthal_debug_configured: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_soft_break(addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_remove_soft_break(addr: *mut ::std::os::raw::c_void, arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_disassemble(
        instr_buf: *mut ::std::os::raw::c_uchar,
        tgt_addr: *mut ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_char,
        buflen: ::std::os::raw::c_uint,
        options: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_disassemble_size(instr_buf: *mut ::std::os::raw::c_uchar)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_memcpy(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn xthal_bcopy(
        src: *const ::std::os::raw::c_void,
        dst: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn xthal_compare_and_set(
        addr: *mut ::std::os::raw::c_int,
        test_val: ::std::os::raw::c_int,
        compare_val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static Xthal_release_major: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_release_minor: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_release_name: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static Xthal_release_internal: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static Xthal_memory_order: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_windowed: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_density: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_booleans: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_loops: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_nsa: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_minmax: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_sext: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_clamps: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_mac16: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_mul16: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_fp: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_speculation: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_threadptr: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_pif: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_writebuffer_entries: ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub static Xthal_build_unique_id: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_hw_configid0: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_hw_configid1: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_hw_release_major: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_hw_release_minor: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_hw_release_name: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static Xthal_hw_release_internal: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn xthal_clear_regcached_code();
}
unsafe extern "C" {
    pub fn xthal_window_spill();
}
unsafe extern "C" {
    pub fn xthal_validate_cp(arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn xthal_invalidate_cp(arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn xthal_set_cpenable(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_get_cpenable() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_num_intlevels: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_interrupts: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_excm_level: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_intlevel_mask: [::std::os::raw::c_uint; 16usize];
}
unsafe extern "C" {
    pub static Xthal_intlevel_andbelow_mask: [::std::os::raw::c_uint; 16usize];
}
unsafe extern "C" {
    pub static Xthal_intlevel: [::std::os::raw::c_uchar; 32usize];
}
unsafe extern "C" {
    pub static Xthal_inttype: [::std::os::raw::c_uchar; 32usize];
}
unsafe extern "C" {
    pub static Xthal_inttype_mask: [::std::os::raw::c_uint; 11usize];
}
unsafe extern "C" {
    pub static Xthal_timer_interrupt: [::std::os::raw::c_int; 4usize];
}
unsafe extern "C" {
    pub fn xthal_get_intenable() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_intenable(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_get_interrupt() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_intset(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_set_intclear(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub static Xthal_num_ibreak: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static Xthal_num_dbreak: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static Xthal_have_ccount: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_ccompare: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn xthal_get_ccount() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_ccompare(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_get_ccompare(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_have_prid: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_exceptions: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_xea_version: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_interrupts: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_highlevel_interrupts: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_nmi: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn xthal_get_prid() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_vpri_to_intlevel(vpri: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_intlevel_to_vpri(intlevel: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_int_enable(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_int_disable(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_int_vpri(
        intnum: ::std::os::raw::c_int,
        vpri: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_get_int_vpri(intnum: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_vpri_locklevel(intlevel: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_get_vpri_locklevel() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_vpri(vpri: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_get_vpri() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_vpri_intlevel(intlevel: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_vpri_lock() -> ::std::os::raw::c_uint;
}
pub type XtHalVoidFunc = ::std::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    pub static mut Xthal_tram_pending: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static mut Xthal_tram_enabled: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static mut Xthal_tram_sync: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_tram_pending_to_service() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_tram_done(serviced_mask: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_tram_set_sync(
        intnum: ::std::os::raw::c_int,
        sync: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_tram_trigger_func(trigger_fn: XtHalVoidFunc) -> XtHalVoidFunc;
}
unsafe extern "C" {
    pub static Xthal_num_instrom: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_instram: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_datarom: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_dataram: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_num_xlmi: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_instrom_vaddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_instrom_paddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_instrom_size: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_instram_vaddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_instram_paddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_instram_size: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_datarom_vaddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_datarom_paddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_datarom_size: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_dataram_vaddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_dataram_paddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_dataram_size: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_xlmi_vaddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_xlmi_paddr: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_xlmi_size: [::std::os::raw::c_uint; 0usize];
}
unsafe extern "C" {
    pub static Xthal_icache_setwidth: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dcache_setwidth: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_icache_ways: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_dcache_ways: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_icache_line_lockable: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dcache_line_lockable: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn xthal_get_cacheattr() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_get_icacheattr() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_get_dcacheattr() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn xthal_set_cacheattr(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_set_icacheattr(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_set_dcacheattr(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xthal_set_region_attribute(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
        cattr: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_icache_enable();
}
unsafe extern "C" {
    pub fn xthal_dcache_enable();
}
unsafe extern "C" {
    pub fn xthal_icache_disable();
}
unsafe extern "C" {
    pub fn xthal_dcache_disable();
}
unsafe extern "C" {
    pub fn xthal_icache_all_invalidate();
}
unsafe extern "C" {
    pub fn xthal_dcache_all_invalidate();
}
unsafe extern "C" {
    pub fn xthal_dcache_all_writeback();
}
unsafe extern "C" {
    pub fn xthal_dcache_all_writeback_inv();
}
unsafe extern "C" {
    pub fn xthal_icache_all_unlock();
}
unsafe extern "C" {
    pub fn xthal_dcache_all_unlock();
}
unsafe extern "C" {
    pub fn xthal_icache_region_lock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_region_lock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_icache_region_unlock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_region_unlock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_icache_hugerange_invalidate(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_icache_hugerange_unlock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_hugerange_invalidate(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_hugerange_unlock(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_hugerange_writeback(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_dcache_hugerange_writeback_inv(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn xthal_icache_line_lock(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_dcache_line_lock(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_icache_line_unlock(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_dcache_line_unlock(addr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn xthal_memep_inject_error(
        addr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub static Xthal_have_spanning_way: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_identity_map: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_mimic_cacheattr: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_xlt_cacheattr: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_cacheattr: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_have_tlbs: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_asid_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_asid_kernel: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_rings: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_ring_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_sr_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_ca_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_mmu_max_pte_page_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_mmu_min_pte_page_size: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_itlb_way_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_itlb_ways: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_itlb_arf_ways: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dtlb_way_bits: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dtlb_ways: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_dtlb_arf_ways: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn xthal_static_v2p(
        vaddr: ::std::os::raw::c_uint,
        paddrp: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_static_p2v(
        paddr: ::std::os::raw::c_uint,
        vaddrp: *mut ::std::os::raw::c_uint,
        cached: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_region_translation(
        vaddr: *mut ::std::os::raw::c_void,
        paddr: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
        cache_atr: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_v2p(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_uint,
        arg4: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_invalidate_region(addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_set_region_translation_raw(
        vaddr: *mut ::std::os::raw::c_void,
        paddr: *mut ::std::os::raw::c_void,
        cattr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xthal_MPU_entry {
    pub as_: u32,
    pub at: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xthal_MPU_entry"][::std::mem::size_of::<xthal_MPU_entry>() - 8usize];
    ["Alignment of xthal_MPU_entry"][::std::mem::align_of::<xthal_MPU_entry>() - 4usize];
    ["Offset of field: xthal_MPU_entry::as_"]
        [::std::mem::offset_of!(xthal_MPU_entry, as_) - 0usize];
    ["Offset of field: xthal_MPU_entry::at"][::std::mem::offset_of!(xthal_MPU_entry, at) - 4usize];
};
unsafe extern "C" {
    pub static Xthal_mpu_bgmap: [xthal_MPU_entry; 0usize];
}
unsafe extern "C" {
    pub fn xthal_is_kernel_readable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_kernel_writeable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_kernel_executable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_user_readable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_user_writeable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_user_executable(accessRights: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_encode_memory_type(x: u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_is_cacheable(memoryType: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_writeback(memoryType: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_is_device(memoryType: u32) -> i32;
}
unsafe extern "C" {
    pub fn xthal_read_map(entries: *mut xthal_MPU_entry) -> i32;
}
unsafe extern "C" {
    pub fn xthal_write_map(entries: *const xthal_MPU_entry, n: u32);
}
unsafe extern "C" {
    pub fn xthal_check_map(entries: *const xthal_MPU_entry, n: u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_get_entry_for_address(
        vaddr: *mut ::std::os::raw::c_void,
        infgmap: *mut i32,
    ) -> xthal_MPU_entry;
}
unsafe extern "C" {
    pub fn xthal_calc_cacheadrdis(e: *const xthal_MPU_entry, n: u32) -> u32;
}
unsafe extern "C" {
    pub fn xthal_mpu_set_region_attribute(
        vaddr: *mut ::std::os::raw::c_void,
        size: usize,
        accessRights: i32,
        memoryType: i32,
        flags: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn xthal_read_background_map(entries: *mut xthal_MPU_entry) -> i32;
}
unsafe extern "C" {
    pub static Xthal_cp_id_FPU: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_FPU: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP1_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP1_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP2_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP2_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP3_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP3_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP4_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP4_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP5_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP5_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP6_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP6_IDENT: ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub static Xthal_cp_id_XCHAL_CP7_IDENT: ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP7_IDENT: ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct KernelFrame {
    pub pc: ::std::os::raw::c_long,
    pub ps: ::std::os::raw::c_long,
    pub areg: [::std::os::raw::c_long; 4usize],
    pub sar: ::std::os::raw::c_long,
    pub lcount: ::std::os::raw::c_long,
    pub lbeg: ::std::os::raw::c_long,
    pub lend: ::std::os::raw::c_long,
    pub acclo: ::std::os::raw::c_long,
    pub acchi: ::std::os::raw::c_long,
    pub mr: [::std::os::raw::c_long; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KernelFrame"][::std::mem::size_of::<KernelFrame>() - 128usize];
    ["Alignment of KernelFrame"][::std::mem::align_of::<KernelFrame>() - 8usize];
    ["Offset of field: KernelFrame::pc"][::std::mem::offset_of!(KernelFrame, pc) - 0usize];
    ["Offset of field: KernelFrame::ps"][::std::mem::offset_of!(KernelFrame, ps) - 8usize];
    ["Offset of field: KernelFrame::areg"][::std::mem::offset_of!(KernelFrame, areg) - 16usize];
    ["Offset of field: KernelFrame::sar"][::std::mem::offset_of!(KernelFrame, sar) - 48usize];
    ["Offset of field: KernelFrame::lcount"][::std::mem::offset_of!(KernelFrame, lcount) - 56usize];
    ["Offset of field: KernelFrame::lbeg"][::std::mem::offset_of!(KernelFrame, lbeg) - 64usize];
    ["Offset of field: KernelFrame::lend"][::std::mem::offset_of!(KernelFrame, lend) - 72usize];
    ["Offset of field: KernelFrame::acclo"][::std::mem::offset_of!(KernelFrame, acclo) - 80usize];
    ["Offset of field: KernelFrame::acchi"][::std::mem::offset_of!(KernelFrame, acchi) - 88usize];
    ["Offset of field: KernelFrame::mr"][::std::mem::offset_of!(KernelFrame, mr) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserFrame {
    pub pc: ::std::os::raw::c_long,
    pub ps: ::std::os::raw::c_long,
    pub sar: ::std::os::raw::c_long,
    pub vpri: ::std::os::raw::c_long,
    pub a2: ::std::os::raw::c_long,
    pub a3: ::std::os::raw::c_long,
    pub a4: ::std::os::raw::c_long,
    pub a5: ::std::os::raw::c_long,
    pub exccause: ::std::os::raw::c_long,
    pub lcount: ::std::os::raw::c_long,
    pub lbeg: ::std::os::raw::c_long,
    pub lend: ::std::os::raw::c_long,
    pub acclo: ::std::os::raw::c_long,
    pub acchi: ::std::os::raw::c_long,
    pub mr: [::std::os::raw::c_long; 4usize],
    pub pad: [::std::os::raw::c_long; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UserFrame"][::std::mem::size_of::<UserFrame>() - 160usize];
    ["Alignment of UserFrame"][::std::mem::align_of::<UserFrame>() - 8usize];
    ["Offset of field: UserFrame::pc"][::std::mem::offset_of!(UserFrame, pc) - 0usize];
    ["Offset of field: UserFrame::ps"][::std::mem::offset_of!(UserFrame, ps) - 8usize];
    ["Offset of field: UserFrame::sar"][::std::mem::offset_of!(UserFrame, sar) - 16usize];
    ["Offset of field: UserFrame::vpri"][::std::mem::offset_of!(UserFrame, vpri) - 24usize];
    ["Offset of field: UserFrame::a2"][::std::mem::offset_of!(UserFrame, a2) - 32usize];
    ["Offset of field: UserFrame::a3"][::std::mem::offset_of!(UserFrame, a3) - 40usize];
    ["Offset of field: UserFrame::a4"][::std::mem::offset_of!(UserFrame, a4) - 48usize];
    ["Offset of field: UserFrame::a5"][::std::mem::offset_of!(UserFrame, a5) - 56usize];
    ["Offset of field: UserFrame::exccause"][::std::mem::offset_of!(UserFrame, exccause) - 64usize];
    ["Offset of field: UserFrame::lcount"][::std::mem::offset_of!(UserFrame, lcount) - 72usize];
    ["Offset of field: UserFrame::lbeg"][::std::mem::offset_of!(UserFrame, lbeg) - 80usize];
    ["Offset of field: UserFrame::lend"][::std::mem::offset_of!(UserFrame, lend) - 88usize];
    ["Offset of field: UserFrame::acclo"][::std::mem::offset_of!(UserFrame, acclo) - 96usize];
    ["Offset of field: UserFrame::acchi"][::std::mem::offset_of!(UserFrame, acchi) - 104usize];
    ["Offset of field: UserFrame::mr"][::std::mem::offset_of!(UserFrame, mr) - 112usize];
    ["Offset of field: UserFrame::pad"][::std::mem::offset_of!(UserFrame, pad) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XtExcFrame {
    pub exit: ::std::os::raw::c_long,
    pub pc: ::std::os::raw::c_long,
    pub ps: ::std::os::raw::c_long,
    pub a0: ::std::os::raw::c_long,
    pub a1: ::std::os::raw::c_long,
    pub a2: ::std::os::raw::c_long,
    pub a3: ::std::os::raw::c_long,
    pub a4: ::std::os::raw::c_long,
    pub a5: ::std::os::raw::c_long,
    pub a6: ::std::os::raw::c_long,
    pub a7: ::std::os::raw::c_long,
    pub a8: ::std::os::raw::c_long,
    pub a9: ::std::os::raw::c_long,
    pub a10: ::std::os::raw::c_long,
    pub a11: ::std::os::raw::c_long,
    pub a12: ::std::os::raw::c_long,
    pub a13: ::std::os::raw::c_long,
    pub a14: ::std::os::raw::c_long,
    pub a15: ::std::os::raw::c_long,
    pub sar: ::std::os::raw::c_long,
    pub exccause: ::std::os::raw::c_long,
    pub excvaddr: ::std::os::raw::c_long,
    pub lbeg: ::std::os::raw::c_long,
    pub lend: ::std::os::raw::c_long,
    pub lcount: ::std::os::raw::c_long,
    pub tmp0: ::std::os::raw::c_long,
    pub tmp1: ::std::os::raw::c_long,
    pub tmp2: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XtExcFrame"][::std::mem::size_of::<XtExcFrame>() - 224usize];
    ["Alignment of XtExcFrame"][::std::mem::align_of::<XtExcFrame>() - 8usize];
    ["Offset of field: XtExcFrame::exit"][::std::mem::offset_of!(XtExcFrame, exit) - 0usize];
    ["Offset of field: XtExcFrame::pc"][::std::mem::offset_of!(XtExcFrame, pc) - 8usize];
    ["Offset of field: XtExcFrame::ps"][::std::mem::offset_of!(XtExcFrame, ps) - 16usize];
    ["Offset of field: XtExcFrame::a0"][::std::mem::offset_of!(XtExcFrame, a0) - 24usize];
    ["Offset of field: XtExcFrame::a1"][::std::mem::offset_of!(XtExcFrame, a1) - 32usize];
    ["Offset of field: XtExcFrame::a2"][::std::mem::offset_of!(XtExcFrame, a2) - 40usize];
    ["Offset of field: XtExcFrame::a3"][::std::mem::offset_of!(XtExcFrame, a3) - 48usize];
    ["Offset of field: XtExcFrame::a4"][::std::mem::offset_of!(XtExcFrame, a4) - 56usize];
    ["Offset of field: XtExcFrame::a5"][::std::mem::offset_of!(XtExcFrame, a5) - 64usize];
    ["Offset of field: XtExcFrame::a6"][::std::mem::offset_of!(XtExcFrame, a6) - 72usize];
    ["Offset of field: XtExcFrame::a7"][::std::mem::offset_of!(XtExcFrame, a7) - 80usize];
    ["Offset of field: XtExcFrame::a8"][::std::mem::offset_of!(XtExcFrame, a8) - 88usize];
    ["Offset of field: XtExcFrame::a9"][::std::mem::offset_of!(XtExcFrame, a9) - 96usize];
    ["Offset of field: XtExcFrame::a10"][::std::mem::offset_of!(XtExcFrame, a10) - 104usize];
    ["Offset of field: XtExcFrame::a11"][::std::mem::offset_of!(XtExcFrame, a11) - 112usize];
    ["Offset of field: XtExcFrame::a12"][::std::mem::offset_of!(XtExcFrame, a12) - 120usize];
    ["Offset of field: XtExcFrame::a13"][::std::mem::offset_of!(XtExcFrame, a13) - 128usize];
    ["Offset of field: XtExcFrame::a14"][::std::mem::offset_of!(XtExcFrame, a14) - 136usize];
    ["Offset of field: XtExcFrame::a15"][::std::mem::offset_of!(XtExcFrame, a15) - 144usize];
    ["Offset of field: XtExcFrame::sar"][::std::mem::offset_of!(XtExcFrame, sar) - 152usize];
    ["Offset of field: XtExcFrame::exccause"]
        [::std::mem::offset_of!(XtExcFrame, exccause) - 160usize];
    ["Offset of field: XtExcFrame::excvaddr"]
        [::std::mem::offset_of!(XtExcFrame, excvaddr) - 168usize];
    ["Offset of field: XtExcFrame::lbeg"][::std::mem::offset_of!(XtExcFrame, lbeg) - 176usize];
    ["Offset of field: XtExcFrame::lend"][::std::mem::offset_of!(XtExcFrame, lend) - 184usize];
    ["Offset of field: XtExcFrame::lcount"][::std::mem::offset_of!(XtExcFrame, lcount) - 192usize];
    ["Offset of field: XtExcFrame::tmp0"][::std::mem::offset_of!(XtExcFrame, tmp0) - 200usize];
    ["Offset of field: XtExcFrame::tmp1"][::std::mem::offset_of!(XtExcFrame, tmp1) - 208usize];
    ["Offset of field: XtExcFrame::tmp2"][::std::mem::offset_of!(XtExcFrame, tmp2) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XtSolFrame {
    pub exit: ::std::os::raw::c_long,
    pub pc: ::std::os::raw::c_long,
    pub ps: ::std::os::raw::c_long,
    pub threadptr: ::std::os::raw::c_long,
    pub a0: ::std::os::raw::c_long,
    pub a1: ::std::os::raw::c_long,
    pub a2: ::std::os::raw::c_long,
    pub a3: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XtSolFrame"][::std::mem::size_of::<XtSolFrame>() - 64usize];
    ["Alignment of XtSolFrame"][::std::mem::align_of::<XtSolFrame>() - 8usize];
    ["Offset of field: XtSolFrame::exit"][::std::mem::offset_of!(XtSolFrame, exit) - 0usize];
    ["Offset of field: XtSolFrame::pc"][::std::mem::offset_of!(XtSolFrame, pc) - 8usize];
    ["Offset of field: XtSolFrame::ps"][::std::mem::offset_of!(XtSolFrame, ps) - 16usize];
    ["Offset of field: XtSolFrame::threadptr"]
        [::std::mem::offset_of!(XtSolFrame, threadptr) - 24usize];
    ["Offset of field: XtSolFrame::a0"][::std::mem::offset_of!(XtSolFrame, a0) - 32usize];
    ["Offset of field: XtSolFrame::a1"][::std::mem::offset_of!(XtSolFrame, a1) - 40usize];
    ["Offset of field: XtSolFrame::a2"][::std::mem::offset_of!(XtSolFrame, a2) - 48usize];
    ["Offset of field: XtSolFrame::a3"][::std::mem::offset_of!(XtSolFrame, a3) - 56usize];
};
pub type TaskFunction_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XtosCoreState {
    pub signature: ::std::os::raw::c_long,
    pub restore_label: ::std::os::raw::c_long,
    pub aftersave_label: ::std::os::raw::c_long,
    pub areg: [::std::os::raw::c_long; 64usize],
    pub caller_regs: [::std::os::raw::c_long; 16usize],
    pub caller_regs_saved: ::std::os::raw::c_long,
    pub windowbase: ::std::os::raw::c_long,
    pub windowstart: ::std::os::raw::c_long,
    pub sar: ::std::os::raw::c_long,
    pub epc1: ::std::os::raw::c_long,
    pub ps: ::std::os::raw::c_long,
    pub excsave1: ::std::os::raw::c_long,
    pub depc: ::std::os::raw::c_long,
    pub epc: [::std::os::raw::c_long; 6usize],
    pub eps: [::std::os::raw::c_long; 6usize],
    pub excsave: [::std::os::raw::c_long; 6usize],
    pub lcount: ::std::os::raw::c_long,
    pub lbeg: ::std::os::raw::c_long,
    pub lend: ::std::os::raw::c_long,
    pub vecbase: ::std::os::raw::c_long,
    pub atomctl: ::std::os::raw::c_long,
    pub memctl: ::std::os::raw::c_long,
    pub ccount: ::std::os::raw::c_long,
    pub ccompare: [::std::os::raw::c_long; 3usize],
    pub intenable: ::std::os::raw::c_long,
    pub interrupt: ::std::os::raw::c_long,
    pub icount: ::std::os::raw::c_long,
    pub icountlevel: ::std::os::raw::c_long,
    pub debugcause: ::std::os::raw::c_long,
    pub dbreakc: [::std::os::raw::c_long; 2usize],
    pub dbreaka: [::std::os::raw::c_long; 2usize],
    pub ibreaka: [::std::os::raw::c_long; 2usize],
    pub ibreakenable: ::std::os::raw::c_long,
    pub misc: [::std::os::raw::c_long; 4usize],
    pub cpenable: ::std::os::raw::c_long,
    pub tlbs: [::std::os::raw::c_long; 16usize],
    pub ncp: [::std::os::raw::c_char; 48usize],
    pub cp0: [::std::os::raw::c_char; 72usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XtosCoreState"][::std::mem::size_of::<XtosCoreState>() - 1336usize];
    ["Alignment of XtosCoreState"][::std::mem::align_of::<XtosCoreState>() - 8usize];
    ["Offset of field: XtosCoreState::signature"]
        [::std::mem::offset_of!(XtosCoreState, signature) - 0usize];
    ["Offset of field: XtosCoreState::restore_label"]
        [::std::mem::offset_of!(XtosCoreState, restore_label) - 8usize];
    ["Offset of field: XtosCoreState::aftersave_label"]
        [::std::mem::offset_of!(XtosCoreState, aftersave_label) - 16usize];
    ["Offset of field: XtosCoreState::areg"][::std::mem::offset_of!(XtosCoreState, areg) - 24usize];
    ["Offset of field: XtosCoreState::caller_regs"]
        [::std::mem::offset_of!(XtosCoreState, caller_regs) - 536usize];
    ["Offset of field: XtosCoreState::caller_regs_saved"]
        [::std::mem::offset_of!(XtosCoreState, caller_regs_saved) - 664usize];
    ["Offset of field: XtosCoreState::windowbase"]
        [::std::mem::offset_of!(XtosCoreState, windowbase) - 672usize];
    ["Offset of field: XtosCoreState::windowstart"]
        [::std::mem::offset_of!(XtosCoreState, windowstart) - 680usize];
    ["Offset of field: XtosCoreState::sar"][::std::mem::offset_of!(XtosCoreState, sar) - 688usize];
    ["Offset of field: XtosCoreState::epc1"]
        [::std::mem::offset_of!(XtosCoreState, epc1) - 696usize];
    ["Offset of field: XtosCoreState::ps"][::std::mem::offset_of!(XtosCoreState, ps) - 704usize];
    ["Offset of field: XtosCoreState::excsave1"]
        [::std::mem::offset_of!(XtosCoreState, excsave1) - 712usize];
    ["Offset of field: XtosCoreState::depc"]
        [::std::mem::offset_of!(XtosCoreState, depc) - 720usize];
    ["Offset of field: XtosCoreState::epc"][::std::mem::offset_of!(XtosCoreState, epc) - 728usize];
    ["Offset of field: XtosCoreState::eps"][::std::mem::offset_of!(XtosCoreState, eps) - 776usize];
    ["Offset of field: XtosCoreState::excsave"]
        [::std::mem::offset_of!(XtosCoreState, excsave) - 824usize];
    ["Offset of field: XtosCoreState::lcount"]
        [::std::mem::offset_of!(XtosCoreState, lcount) - 872usize];
    ["Offset of field: XtosCoreState::lbeg"]
        [::std::mem::offset_of!(XtosCoreState, lbeg) - 880usize];
    ["Offset of field: XtosCoreState::lend"]
        [::std::mem::offset_of!(XtosCoreState, lend) - 888usize];
    ["Offset of field: XtosCoreState::vecbase"]
        [::std::mem::offset_of!(XtosCoreState, vecbase) - 896usize];
    ["Offset of field: XtosCoreState::atomctl"]
        [::std::mem::offset_of!(XtosCoreState, atomctl) - 904usize];
    ["Offset of field: XtosCoreState::memctl"]
        [::std::mem::offset_of!(XtosCoreState, memctl) - 912usize];
    ["Offset of field: XtosCoreState::ccount"]
        [::std::mem::offset_of!(XtosCoreState, ccount) - 920usize];
    ["Offset of field: XtosCoreState::ccompare"]
        [::std::mem::offset_of!(XtosCoreState, ccompare) - 928usize];
    ["Offset of field: XtosCoreState::intenable"]
        [::std::mem::offset_of!(XtosCoreState, intenable) - 952usize];
    ["Offset of field: XtosCoreState::interrupt"]
        [::std::mem::offset_of!(XtosCoreState, interrupt) - 960usize];
    ["Offset of field: XtosCoreState::icount"]
        [::std::mem::offset_of!(XtosCoreState, icount) - 968usize];
    ["Offset of field: XtosCoreState::icountlevel"]
        [::std::mem::offset_of!(XtosCoreState, icountlevel) - 976usize];
    ["Offset of field: XtosCoreState::debugcause"]
        [::std::mem::offset_of!(XtosCoreState, debugcause) - 984usize];
    ["Offset of field: XtosCoreState::dbreakc"]
        [::std::mem::offset_of!(XtosCoreState, dbreakc) - 992usize];
    ["Offset of field: XtosCoreState::dbreaka"]
        [::std::mem::offset_of!(XtosCoreState, dbreaka) - 1008usize];
    ["Offset of field: XtosCoreState::ibreaka"]
        [::std::mem::offset_of!(XtosCoreState, ibreaka) - 1024usize];
    ["Offset of field: XtosCoreState::ibreakenable"]
        [::std::mem::offset_of!(XtosCoreState, ibreakenable) - 1040usize];
    ["Offset of field: XtosCoreState::misc"]
        [::std::mem::offset_of!(XtosCoreState, misc) - 1048usize];
    ["Offset of field: XtosCoreState::cpenable"]
        [::std::mem::offset_of!(XtosCoreState, cpenable) - 1080usize];
    ["Offset of field: XtosCoreState::tlbs"]
        [::std::mem::offset_of!(XtosCoreState, tlbs) - 1088usize];
    ["Offset of field: XtosCoreState::ncp"][::std::mem::offset_of!(XtosCoreState, ncp) - 1216usize];
    ["Offset of field: XtosCoreState::cp0"][::std::mem::offset_of!(XtosCoreState, cp0) - 1264usize];
};
pub type _xtos_handler_func = ::std::option::Option<unsafe extern "C" fn()>;
pub type _xtos_handler = _xtos_handler_func;
unsafe extern "C" {
    pub fn _xtos_ints_off(mask: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_ints_on(mask: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_set_intlevel(intlevel: ::std::os::raw::c_int) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_set_min_intlevel(intlevel: ::std::os::raw::c_int) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_restore_intlevel(restoreval: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_restore_just_intlevel(
        restoreval: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_set_interrupt_handler(n: ::std::os::raw::c_int, f: _xtos_handler)
        -> _xtos_handler;
}
unsafe extern "C" {
    pub fn _xtos_set_interrupt_handler_arg(
        n: ::std::os::raw::c_int,
        f: _xtos_handler,
        arg: *mut ::std::os::raw::c_void,
    ) -> _xtos_handler;
}
unsafe extern "C" {
    pub fn _xtos_set_exception_handler(n: ::std::os::raw::c_int, f: _xtos_handler)
        -> _xtos_handler;
}
unsafe extern "C" {
    pub fn _xtos_memep_initrams();
}
unsafe extern "C" {
    pub fn _xtos_memep_enable(flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level1_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level2_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level3_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level4_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level5_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_dispatch_level6_interrupts();
}
unsafe extern "C" {
    pub fn _xtos_read_ints() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _xtos_clear_ints(mask: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn _xtos_core_shutoff(flags: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _xtos_core_save(
        flags: ::std::os::raw::c_uint,
        savearea: *mut XtosCoreState,
        code: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _xtos_core_restore(retvalue: ::std::os::raw::c_uint, savearea: *mut XtosCoreState);
}
unsafe extern "C" {
    pub fn _xtos_timer_0_delta(cycles: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn _xtos_timer_1_delta(cycles: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn _xtos_timer_2_delta(cycles: ::std::os::raw::c_int);
}
pub type xt_handler =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type xt_exc_handler = ::std::option::Option<unsafe extern "C" fn(arg1: *mut XtExcFrame)>;
unsafe extern "C" {
    pub fn xt_set_exception_handler(n: ::std::os::raw::c_int, f: xt_exc_handler) -> xt_exc_handler;
}
unsafe extern "C" {
    pub fn xt_set_interrupt_handler(
        n: ::std::os::raw::c_int,
        f: xt_handler,
        arg: *mut ::std::os::raw::c_void,
    ) -> xt_handler;
}
unsafe extern "C" {
    pub fn xt_ints_on(mask: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xt_ints_off(mask: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn xt_get_interrupt_handler_arg(n: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn xt_int_has_handler(intr: ::std::os::raw::c_int, cpu: ::std::os::raw::c_int) -> bool;
}
#[doc = " @brief CPU cycle count type\n\n This data type represents the CPU's clock cycle count"]
pub type esp_cpu_cycle_count_t = u32;
pub const esp_cpu_intr_type_t_ESP_CPU_INTR_TYPE_LEVEL: esp_cpu_intr_type_t = 0;
pub const esp_cpu_intr_type_t_ESP_CPU_INTR_TYPE_EDGE: esp_cpu_intr_type_t = 1;
pub const esp_cpu_intr_type_t_ESP_CPU_INTR_TYPE_NA: esp_cpu_intr_type_t = 2;
#[doc = " @brief CPU interrupt type"]
pub type esp_cpu_intr_type_t = ::std::os::raw::c_uint;
#[doc = " @brief CPU interrupt descriptor\n\n Each particular CPU interrupt has an associated descriptor describing that\n particular interrupt's characteristics. Call esp_cpu_intr_get_desc() to get\n the descriptors of a particular interrupt."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct esp_cpu_intr_desc_t {
    #[doc = "< Priority of the interrupt if it has a fixed priority, (-1) if the priority is configurable."]
    pub priority: ::std::os::raw::c_int,
    #[doc = "< Whether the interrupt is an edge or level type interrupt, ESP_CPU_INTR_TYPE_NA if the type is configurable."]
    pub type_: esp_cpu_intr_type_t,
    #[doc = "< Flags indicating extra details."]
    pub flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of esp_cpu_intr_desc_t"][::std::mem::size_of::<esp_cpu_intr_desc_t>() - 12usize];
    ["Alignment of esp_cpu_intr_desc_t"][::std::mem::align_of::<esp_cpu_intr_desc_t>() - 4usize];
    ["Offset of field: esp_cpu_intr_desc_t::priority"]
        [::std::mem::offset_of!(esp_cpu_intr_desc_t, priority) - 0usize];
    ["Offset of field: esp_cpu_intr_desc_t::type_"]
        [::std::mem::offset_of!(esp_cpu_intr_desc_t, type_) - 4usize];
    ["Offset of field: esp_cpu_intr_desc_t::flags"]
        [::std::mem::offset_of!(esp_cpu_intr_desc_t, flags) - 8usize];
};
#[doc = " @brief CPU interrupt handler type"]
pub type esp_cpu_intr_handler_t =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
pub const esp_cpu_watchpoint_trigger_t_ESP_CPU_WATCHPOINT_LOAD: esp_cpu_watchpoint_trigger_t = 0;
pub const esp_cpu_watchpoint_trigger_t_ESP_CPU_WATCHPOINT_STORE: esp_cpu_watchpoint_trigger_t = 1;
pub const esp_cpu_watchpoint_trigger_t_ESP_CPU_WATCHPOINT_ACCESS: esp_cpu_watchpoint_trigger_t = 2;
#[doc = " @brief CPU watchpoint trigger type"]
pub type esp_cpu_watchpoint_trigger_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    #[doc = " @brief Stall a CPU core\n\n @param core_id  The core's ID"]
    pub fn esp_cpu_stall(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Resume a previously stalled CPU core\n\n @param core_id The core's ID"]
    pub fn esp_cpu_unstall(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Reset a CPU core\n\n @param core_id The core's ID"]
    pub fn esp_cpu_reset(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Wait for Interrupt\n\n This function causes the current CPU core to execute its Wait For Interrupt\n (WFI or equivalent) instruction. After executing this function, the CPU core\n will stop execution until an interrupt occurs."]
    pub fn esp_cpu_wait_for_intr();
}
unsafe extern "C" {
    #[doc = " @brief Get a CPU interrupt's descriptor\n\n Each CPU interrupt has a descriptor describing the interrupt's capabilities\n and restrictions. This function gets the descriptor of a particular interrupt\n on a particular CPU.\n\n @param[in] core_id The core's ID\n @param[in] intr_num Interrupt number\n @param[out] intr_desc_ret The interrupt's descriptor"]
    pub fn esp_cpu_intr_get_desc(
        core_id: ::std::os::raw::c_int,
        intr_num: ::std::os::raw::c_int,
        intr_desc_ret: *mut esp_cpu_intr_desc_t,
    );
}
unsafe extern "C" {
    #[doc = " @brief Configure the CPU to disable access to invalid memory regions"]
    pub fn esp_cpu_configure_region_protection();
}
unsafe extern "C" {
    #[doc = " @brief Set and enable a hardware breakpoint on the current CPU\n\n @note This function is meant to be called by the panic handler to set a\n breakpoint for an attached debugger during a panic.\n @note Overwrites previously set breakpoint with same breakpoint number.\n @param bp_num Hardware breakpoint number [0..SOC_CPU_BREAKPOINTS_NUM - 1]\n @param bp_addr Address to set a breakpoint on\n @return ESP_OK if breakpoint is set. Failure otherwise"]
    pub fn esp_cpu_set_breakpoint(
        bp_num: ::std::os::raw::c_int,
        bp_addr: *const ::std::os::raw::c_void,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Clear a hardware breakpoint on the current CPU\n\n @note Clears a breakpoint regardless of whether it was previously set\n @param bp_num Hardware breakpoint number [0..SOC_CPU_BREAKPOINTS_NUM - 1]\n @return ESP_OK if breakpoint is cleared. Failure otherwise"]
    pub fn esp_cpu_clear_breakpoint(bp_num: ::std::os::raw::c_int) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Set and enable a hardware watchpoint on the current CPU\n\n Set and enable a hardware watchpoint on the current CPU, specifying the\n memory range and trigger operation. Watchpoints will break/panic the CPU when\n the CPU accesses (according to the trigger type) on a certain memory range.\n\n @note Overwrites previously set watchpoint with same watchpoint number.\n       On RISC-V chips, this API uses method0(Exact matching) and method1(NAPOT matching) according to the\n       riscv-debug-spec-0.13 specification for address matching.\n       If the watch region size is 1byte, it uses exact matching (method 0).\n       If the watch region size is larger than 1byte, it uses NAPOT matching (method 1). This mode requires\n       the watching region start address to be aligned to the watching region size.\n\n @param wp_num Hardware watchpoint number [0..SOC_CPU_WATCHPOINTS_NUM - 1]\n @param wp_addr Watchpoint's base address, must be naturally aligned to the size of the region\n @param size Size of the region to watch. Must be one of 2^n and in the range of [1 ... SOC_CPU_WATCHPOINT_MAX_REGION_SIZE]\n @param trigger Trigger type\n @return ESP_ERR_INVALID_ARG on invalid arg, ESP_OK otherwise"]
    pub fn esp_cpu_set_watchpoint(
        wp_num: ::std::os::raw::c_int,
        wp_addr: *const ::std::os::raw::c_void,
        size: usize,
        trigger: esp_cpu_watchpoint_trigger_t,
    ) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Clear a hardware watchpoint on the current CPU\n\n @note Clears a watchpoint regardless of whether it was previously set\n @param wp_num Hardware watchpoint number [0..SOC_CPU_WATCHPOINTS_NUM - 1]\n @return ESP_OK if watchpoint was cleared. Failure otherwise."]
    pub fn esp_cpu_clear_watchpoint(wp_num: ::std::os::raw::c_int) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Atomic compare-and-set operation\n\n @param addr Address of atomic variable\n @param compare_value Value to compare the atomic variable to\n @param new_value New value to set the atomic variable to\n @return Whether the atomic variable was set or not"]
    pub fn esp_cpu_compare_and_set(addr: *mut u32, compare_value: u32, new_value: u32) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spinlock_t {
    pub owner: u32,
    pub count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of spinlock_t"][::std::mem::size_of::<spinlock_t>() - 8usize];
    ["Alignment of spinlock_t"][::std::mem::align_of::<spinlock_t>() - 4usize];
    ["Offset of field: spinlock_t::owner"][::std::mem::offset_of!(spinlock_t, owner) - 0usize];
    ["Offset of field: spinlock_t::count"][::std::mem::offset_of!(spinlock_t, count) - 4usize];
};
unsafe extern "C" {
    #[doc = " Initialize the crosscore interrupt system for this CPU.\n This needs to be called once on every CPU that is used\n by FreeRTOS.\n\n If multicore FreeRTOS support is enabled, this will be\n called automatically by the startup code and should not\n be called manually."]
    pub fn esp_crosscore_int_init();
}
unsafe extern "C" {
    #[doc = " Send an interrupt to a CPU indicating it should yield its\n currently running task in favour of a higher-priority task\n that presumably just woke up.\n\n This is used internally by FreeRTOS in multicore mode\n and should not be called by the user.\n\n @param core_id Core that should do the yielding"]
    pub fn esp_crosscore_int_send_yield(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Send an interrupt to a CPU indicating it should update its\n CCOMPARE1 value due to a frequency switch.\n\n This is used internally when dynamic frequency switching is\n enabled, and should not be called from application code.\n\n @param core_id Core that should update its CCOMPARE1 value"]
    pub fn esp_crosscore_int_send_freq_switch(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn esp_crosscore_int_send_gdb_call(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Send an interrupt to a CPU indicating it should print its current backtrace\n\n This is used internally by the Task Watchdog to dump the backtrace of the\n opposite core and should not be called from application code.\n\n @param core_id Core that should print its backtrace"]
    pub fn esp_crosscore_int_send_print_backtrace(core_id: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Send an interrupt to a CPU indicating it call `task_wdt_timeout_abort_xtensa`.\n This will make the CPU abort, using the interrupted task frame.\n\n This is used internally by the Task Watchdog when it should abort after a task,\n running on the other core than the one running the TWDT ISR, failed to reset\n its timer.\n\n @param core_id Core that should abort"]
    pub fn esp_crosscore_int_send_twdt_abort(core_id: ::std::os::raw::c_int);
}
#[doc = "< interrupt of WiFi MAC, level"]
pub const periph_interrupt_t_ETS_WIFI_MAC_INTR_SOURCE: periph_interrupt_t = 0;
#[doc = "< interrupt of WiFi MAC, NMI, use if MAC have bug to fix in NMI"]
pub const periph_interrupt_t_ETS_WIFI_MAC_NMI_SOURCE: periph_interrupt_t = 1;
#[doc = "< interrupt of WiFi BB, level, we can do some calibartion"]
pub const periph_interrupt_t_ETS_WIFI_BB_INTR_SOURCE: periph_interrupt_t = 2;
#[doc = "< will be cancelled"]
pub const periph_interrupt_t_ETS_BT_MAC_INTR_SOURCE: periph_interrupt_t = 3;
#[doc = "< interrupt of BT BB, level"]
pub const periph_interrupt_t_ETS_BT_BB_INTR_SOURCE: periph_interrupt_t = 4;
#[doc = "< interrupt of BT BB, NMI, use if BB have bug to fix in NMI"]
pub const periph_interrupt_t_ETS_BT_BB_NMI_SOURCE: periph_interrupt_t = 5;
#[doc = "< interrupt of RWBT, level"]
pub const periph_interrupt_t_ETS_RWBT_INTR_SOURCE: periph_interrupt_t = 6;
#[doc = "< interrupt of RWBLE, level"]
pub const periph_interrupt_t_ETS_RWBLE_INTR_SOURCE: periph_interrupt_t = 7;
#[doc = "< interrupt of RWBT, NMI, use if RWBT have bug to fix in NMI"]
pub const periph_interrupt_t_ETS_RWBT_NMI_SOURCE: periph_interrupt_t = 8;
#[doc = "< interrupt of RWBLE, NMI, use if RWBT have bug to fix in NMI"]
pub const periph_interrupt_t_ETS_RWBLE_NMI_SOURCE: periph_interrupt_t = 9;
#[doc = "< interrupt of SLC0, level"]
pub const periph_interrupt_t_ETS_SLC0_INTR_SOURCE: periph_interrupt_t = 10;
#[doc = "< interrupt of SLC1, level"]
pub const periph_interrupt_t_ETS_SLC1_INTR_SOURCE: periph_interrupt_t = 11;
#[doc = "< interrupt of UHCI0, level"]
pub const periph_interrupt_t_ETS_UHCI0_INTR_SOURCE: periph_interrupt_t = 12;
#[doc = "< interrupt of UHCI1, level"]
pub const periph_interrupt_t_ETS_UHCI1_INTR_SOURCE: periph_interrupt_t = 13;
#[doc = "< interrupt of TIMER_GROUP0, TIMER0, level, we would like use EDGE for timer if permission"]
pub const periph_interrupt_t_ETS_TG0_T0_LEVEL_INTR_SOURCE: periph_interrupt_t = 14;
#[doc = "< interrupt of TIMER_GROUP0, TIMER1, level, we would like use EDGE for timer if permission"]
pub const periph_interrupt_t_ETS_TG0_T1_LEVEL_INTR_SOURCE: periph_interrupt_t = 15;
#[doc = "< interrupt of TIMER_GROUP0, WATCHDOG, level"]
pub const periph_interrupt_t_ETS_TG0_WDT_LEVEL_INTR_SOURCE: periph_interrupt_t = 16;
#[doc = "< interrupt of TIMER_GROUP0, LACT, level"]
pub const periph_interrupt_t_ETS_TG0_LACT_LEVEL_INTR_SOURCE: periph_interrupt_t = 17;
#[doc = "< interrupt of TIMER_GROUP1, TIMER0, level, we would like use EDGE for timer if permission"]
pub const periph_interrupt_t_ETS_TG1_T0_LEVEL_INTR_SOURCE: periph_interrupt_t = 18;
#[doc = "< interrupt of TIMER_GROUP1, TIMER1, level, we would like use EDGE for timer if permission"]
pub const periph_interrupt_t_ETS_TG1_T1_LEVEL_INTR_SOURCE: periph_interrupt_t = 19;
#[doc = "< interrupt of TIMER_GROUP1, WATCHDOG, level"]
pub const periph_interrupt_t_ETS_TG1_WDT_LEVEL_INTR_SOURCE: periph_interrupt_t = 20;
#[doc = "< interrupt of TIMER_GROUP1, LACT, level"]
pub const periph_interrupt_t_ETS_TG1_LACT_LEVEL_INTR_SOURCE: periph_interrupt_t = 21;
#[doc = "< interrupt of GPIO, level"]
pub const periph_interrupt_t_ETS_GPIO_INTR_SOURCE: periph_interrupt_t = 22;
#[doc = "< interrupt of GPIO, NMI"]
pub const periph_interrupt_t_ETS_GPIO_NMI_SOURCE: periph_interrupt_t = 23;
#[doc = "< interrupt0 generated from a CPU, level"]
pub const periph_interrupt_t_ETS_FROM_CPU_INTR0_SOURCE: periph_interrupt_t = 24;
#[doc = "< interrupt1 generated from a CPU, level"]
pub const periph_interrupt_t_ETS_FROM_CPU_INTR1_SOURCE: periph_interrupt_t = 25;
#[doc = "< interrupt2 generated from a CPU, level"]
pub const periph_interrupt_t_ETS_FROM_CPU_INTR2_SOURCE: periph_interrupt_t = 26;
#[doc = "< interrupt3 generated from a CPU, level"]
pub const periph_interrupt_t_ETS_FROM_CPU_INTR3_SOURCE: periph_interrupt_t = 27;
#[doc = "< interrupt of SPI0, level, SPI0 is for Cache Access, do not use this"]
pub const periph_interrupt_t_ETS_SPI0_INTR_SOURCE: periph_interrupt_t = 28;
#[doc = "< interrupt of SPI1, level, SPI1 is for flash read/write, do not use this"]
pub const periph_interrupt_t_ETS_SPI1_INTR_SOURCE: periph_interrupt_t = 29;
#[doc = "< interrupt of SPI2, level"]
pub const periph_interrupt_t_ETS_SPI2_INTR_SOURCE: periph_interrupt_t = 30;
#[doc = "< interrupt of SPI3, level"]
pub const periph_interrupt_t_ETS_SPI3_INTR_SOURCE: periph_interrupt_t = 31;
#[doc = "< interrupt of I2S0, level"]
pub const periph_interrupt_t_ETS_I2S0_INTR_SOURCE: periph_interrupt_t = 32;
#[doc = "< interrupt of I2S1, level"]
pub const periph_interrupt_t_ETS_I2S1_INTR_SOURCE: periph_interrupt_t = 33;
#[doc = "< interrupt of UART0, level"]
pub const periph_interrupt_t_ETS_UART0_INTR_SOURCE: periph_interrupt_t = 34;
#[doc = "< interrupt of UART1, level"]
pub const periph_interrupt_t_ETS_UART1_INTR_SOURCE: periph_interrupt_t = 35;
#[doc = "< interrupt of UART2, level"]
pub const periph_interrupt_t_ETS_UART2_INTR_SOURCE: periph_interrupt_t = 36;
#[doc = "< interrupt of SD/SDIO/MMC HOST, level"]
pub const periph_interrupt_t_ETS_SDIO_HOST_INTR_SOURCE: periph_interrupt_t = 37;
#[doc = "< interrupt of ethernet mac, level"]
pub const periph_interrupt_t_ETS_ETH_MAC_INTR_SOURCE: periph_interrupt_t = 38;
#[doc = "< interrupt of PWM0, level, Reserved"]
pub const periph_interrupt_t_ETS_PWM0_INTR_SOURCE: periph_interrupt_t = 39;
#[doc = "< interrupt of PWM1, level, Reserved"]
pub const periph_interrupt_t_ETS_PWM1_INTR_SOURCE: periph_interrupt_t = 40;
#[doc = "< interrupt of LED PWM, level"]
pub const periph_interrupt_t_ETS_LEDC_INTR_SOURCE: periph_interrupt_t = 43;
#[doc = "< interrupt of efuse, level, not likely to use"]
pub const periph_interrupt_t_ETS_EFUSE_INTR_SOURCE: periph_interrupt_t = 44;
#[doc = "< interrupt of twai, level"]
pub const periph_interrupt_t_ETS_TWAI_INTR_SOURCE: periph_interrupt_t = 45;
#[doc = "< interrupt of rtc core, level, include rtc watchdog"]
pub const periph_interrupt_t_ETS_RTC_CORE_INTR_SOURCE: periph_interrupt_t = 46;
#[doc = "< interrupt of remote controller, level"]
pub const periph_interrupt_t_ETS_RMT_INTR_SOURCE: periph_interrupt_t = 47;
#[doc = "< interrupt of pulse count, level"]
pub const periph_interrupt_t_ETS_PCNT_INTR_SOURCE: periph_interrupt_t = 48;
#[doc = "< interrupt of I2C controller1, level"]
pub const periph_interrupt_t_ETS_I2C_EXT0_INTR_SOURCE: periph_interrupt_t = 49;
#[doc = "< interrupt of I2C controller0, level"]
pub const periph_interrupt_t_ETS_I2C_EXT1_INTR_SOURCE: periph_interrupt_t = 50;
#[doc = "< interrupt of RSA accelerator, level"]
pub const periph_interrupt_t_ETS_RSA_INTR_SOURCE: periph_interrupt_t = 51;
#[doc = "< interrupt of SPI1 DMA, SPI1 is for flash read/write, do not use this"]
pub const periph_interrupt_t_ETS_SPI1_DMA_INTR_SOURCE: periph_interrupt_t = 52;
#[doc = "< interrupt of SPI2 DMA, level"]
pub const periph_interrupt_t_ETS_SPI2_DMA_INTR_SOURCE: periph_interrupt_t = 53;
#[doc = "< interrupt of SPI3 DMA, level"]
pub const periph_interrupt_t_ETS_SPI3_DMA_INTR_SOURCE: periph_interrupt_t = 54;
#[doc = "< will be cancelled"]
pub const periph_interrupt_t_ETS_WDT_INTR_SOURCE: periph_interrupt_t = 55;
#[doc = "< will be cancelled"]
pub const periph_interrupt_t_ETS_TIMER1_INTR_SOURCE: periph_interrupt_t = 56;
#[doc = "< will be cancelled"]
pub const periph_interrupt_t_ETS_TIMER2_INTR_SOURCE: periph_interrupt_t = 57;
#[doc = "< interrupt of TIMER_GROUP0, TIMER0, EDGE"]
pub const periph_interrupt_t_ETS_TG0_T0_EDGE_INTR_SOURCE: periph_interrupt_t = 58;
#[doc = "< interrupt of TIMER_GROUP0, TIMER1, EDGE"]
pub const periph_interrupt_t_ETS_TG0_T1_EDGE_INTR_SOURCE: periph_interrupt_t = 59;
#[doc = "< interrupt of TIMER_GROUP0, WATCH DOG, EDGE"]
pub const periph_interrupt_t_ETS_TG0_WDT_EDGE_INTR_SOURCE: periph_interrupt_t = 60;
#[doc = "< interrupt of TIMER_GROUP0, LACT, EDGE"]
pub const periph_interrupt_t_ETS_TG0_LACT_EDGE_INTR_SOURCE: periph_interrupt_t = 61;
#[doc = "< interrupt of TIMER_GROUP1, TIMER0, EDGE"]
pub const periph_interrupt_t_ETS_TG1_T0_EDGE_INTR_SOURCE: periph_interrupt_t = 62;
#[doc = "< interrupt of TIMER_GROUP1, TIMER1, EDGE"]
pub const periph_interrupt_t_ETS_TG1_T1_EDGE_INTR_SOURCE: periph_interrupt_t = 63;
#[doc = "< interrupt of TIMER_GROUP1, WATCHDOG, EDGE"]
pub const periph_interrupt_t_ETS_TG1_WDT_EDGE_INTR_SOURCE: periph_interrupt_t = 64;
#[doc = "< interrupt of TIMER_GROUP0, LACT, EDGE"]
pub const periph_interrupt_t_ETS_TG1_LACT_EDGE_INTR_SOURCE: periph_interrupt_t = 65;
#[doc = "< interrupt of MMU Invalid Access, LEVEL"]
pub const periph_interrupt_t_ETS_MMU_IA_INTR_SOURCE: periph_interrupt_t = 66;
#[doc = "< interrupt of MPU Invalid Access, LEVEL"]
pub const periph_interrupt_t_ETS_MPU_IA_INTR_SOURCE: periph_interrupt_t = 67;
#[doc = "< interrupt of Cache Invalid Access, LEVEL"]
pub const periph_interrupt_t_ETS_CACHE_IA_INTR_SOURCE: periph_interrupt_t = 68;
#[doc = "< total number of interrupt sources"]
pub const periph_interrupt_t_ETS_MAX_INTR_SOURCE: periph_interrupt_t = 69;
pub type periph_interrupt_t = ::std::os::raw::c_uint;
pub use self::periph_interrupt_t as periph_interrput_t;
unsafe extern "C" {
    pub static esp_isr_names: [*const ::std::os::raw::c_char; 69usize];
}
unsafe extern "C" {
    #[doc = " @brief Check if the pointer is in external ram dma capable region\n\n @param p pointer\n\n @return true: capable; false: not capable"]
    pub fn esp_ptr_dma_ext_capable(p: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Check if the pointer is executable\n\n @param p pointer\n\n @return true: is executable; false: not executable"]
    pub fn esp_ptr_executable(p: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Check if the pointer is byte accessible\n\n @param p pointer\n\n @return true: is byte accessible; false: not byte accessible"]
    pub fn esp_ptr_byte_accessible(p: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Check if the pointer is in external ram\n\n @param p pointer\n\n @return true: is in external ram; false: not in external ram"]
    pub fn esp_ptr_external_ram(p: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " Function which sets up newlib in ROM for use with ESP-IDF\n\n Includes defining the syscall table, setting up any common locks, etc.\n\n Called from the startup code, not intended to be called from application\n code."]
    pub fn esp_libc_init();
}
unsafe extern "C" {
    pub fn esp_setup_syscall_table();
}
unsafe extern "C" {
    pub fn esp_libc_init_global_stdio(stdio_dev: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn esp_libc_time_init();
}
unsafe extern "C" {
    #[doc = " Clean up some of lazily allocated buffers in REENT structures."]
    pub fn esp_reent_cleanup();
}
unsafe extern "C" {
    #[doc = " Update current microsecond time from RTC"]
    pub fn esp_set_time_from_rtc();
}
unsafe extern "C" {
    pub fn esp_sync_timekeeping_timers();
}
unsafe extern "C" {
    #[doc = " Initialize libc static locks"]
    pub fn esp_libc_locks_init();
}
unsafe extern "C" {
    pub fn esp_newlib_time_init();
}
unsafe extern "C" {
    pub fn esp_newlib_init();
}
unsafe extern "C" {
    pub fn esp_newlib_locks_init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct multi_heap_info {
    _unused: [u8; 0],
}
#[doc = " @brief Opaque handle to a registered heap"]
pub type multi_heap_handle_t = *mut multi_heap_info;
unsafe extern "C" {
    #[doc = " @brief allocate a chunk of memory with specific alignment\n\n @param heap  Handle to a registered heap.\n @param size  size in bytes of memory chunk\n @param alignment  how the memory must be aligned\n\n @return pointer to the memory allocated, NULL on failure"]
    pub fn multi_heap_aligned_alloc(
        heap: multi_heap_handle_t,
        size: usize,
        alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief malloc() a buffer in a given heap\n\n Semantics are the same as standard malloc(), only the returned buffer will be allocated in the specified heap.\n\n @param heap Handle to a registered heap.\n @param size Size of desired buffer.\n\n @return Pointer to new memory, or NULL if allocation fails."]
    pub fn multi_heap_malloc(heap: multi_heap_handle_t, size: usize)
        -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief free() a buffer aligned in a given heap.\n\n @param heap Handle to a registered heap.\n @param p NULL, or a pointer previously returned from multi_heap_aligned_alloc() for the same heap.\n @note This function is deprecated, consider using multi_heap_free() instead"]
    pub fn multi_heap_aligned_free(heap: multi_heap_handle_t, p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief free() a buffer in a given heap.\n\n Semantics are the same as standard free(), only the argument 'p' must be NULL or have been allocated in the specified heap.\n\n @param heap Handle to a registered heap.\n @param p NULL, or a pointer previously returned from multi_heap_malloc() or multi_heap_realloc() for the same heap."]
    pub fn multi_heap_free(heap: multi_heap_handle_t, p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief realloc() a buffer in a given heap.\n\n Semantics are the same as standard realloc(), only the argument 'p' must be NULL or have been allocated in the specified heap.\n\n @param heap Handle to a registered heap.\n @param p NULL, or a pointer previously returned from multi_heap_malloc() or multi_heap_realloc() for the same heap.\n @param size Desired new size for buffer.\n\n @return New buffer of 'size' containing contents of 'p', or NULL if reallocation failed."]
    pub fn multi_heap_realloc(
        heap: multi_heap_handle_t,
        p: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Return the size that a particular pointer was allocated with.\n\n @param heap Handle to a registered heap.\n @param p Pointer, must have been previously returned from multi_heap_malloc() or multi_heap_realloc() for the same heap.\n\n @return Size of the memory allocated at this block. May be more than the original size argument, due\n to padding and minimum block sizes."]
    pub fn multi_heap_get_allocated_size(
        heap: multi_heap_handle_t,
        p: *mut ::std::os::raw::c_void,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Register a new heap for use\n\n This function initialises a heap at the specified address, and returns a handle for future heap operations.\n\n There is no equivalent function for deregistering a heap - if all blocks in the heap are free, you can immediately start using the memory for other purposes.\n\n @param start Start address of the memory to use for a new heap.\n @param size Size (in bytes) of the new heap.\n\n @return Handle of a new heap ready for use, or NULL if the heap region was too small to be initialised."]
    pub fn multi_heap_register(
        start: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> multi_heap_handle_t;
}
unsafe extern "C" {
    #[doc = " @brief Associate a private lock pointer with a heap\n\n The lock argument is supplied to the MULTI_HEAP_LOCK() and MULTI_HEAP_UNLOCK() macros, defined in multi_heap_platform.h.\n\n The lock in question must be recursive.\n\n When the heap is first registered, the associated lock is NULL.\n\n @param heap Handle to a registered heap.\n @param lock Optional pointer to a locking structure to associate with this heap."]
    pub fn multi_heap_set_lock(heap: multi_heap_handle_t, lock: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Dump heap information to stdout\n\n For debugging purposes, this function dumps information about every block in the heap to stdout.\n\n @param heap Handle to a registered heap."]
    pub fn multi_heap_dump(heap: multi_heap_handle_t);
}
unsafe extern "C" {
    #[doc = " @brief Check heap integrity\n\n Walks the heap and checks all heap data structures are valid. If any errors are detected, an error-specific message\n can be optionally printed to stderr. Print behaviour can be overridden at compile time by defining\n MULTI_CHECK_FAIL_PRINTF in multi_heap_platform.h.\n\n @note This function is not thread-safe as it sets a global variable with the value of print_errors.\n\n @param heap Handle to a registered heap.\n @param print_errors If true, errors will be printed to stderr.\n @return true if heap is valid, false otherwise."]
    pub fn multi_heap_check(heap: multi_heap_handle_t, print_errors: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Return free heap size\n\n Returns the number of bytes available in the heap.\n\n Equivalent to the total_free_bytes member returned by multi_heap_get_heap_info().\n\n Note that the heap may be fragmented, so the actual maximum size for a single malloc() may be lower. To know this\n size, see the largest_free_block member returned by multi_heap_get_heap_info().\n\n @param heap Handle to a registered heap.\n @return Number of free bytes."]
    pub fn multi_heap_free_size(heap: multi_heap_handle_t) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Return the lifetime minimum free heap size\n\n Equivalent to the minimum_free_bytes member returned by multi_heap_get_info().\n\n Returns the lifetime \"low watermark\" of possible values returned from multi_free_heap_size(), for the specified\n heap.\n\n @param heap Handle to a registered heap.\n @return Number of free bytes."]
    pub fn multi_heap_minimum_free_size(heap: multi_heap_handle_t) -> usize;
}
#[doc = " @brief Structure to access heap metadata via multi_heap_get_info"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct multi_heap_info_t {
    #[doc = "<  Total free bytes in the heap. Equivalent to multi_free_heap_size()."]
    pub total_free_bytes: usize,
    #[doc = "<  Total bytes allocated to data in the heap."]
    pub total_allocated_bytes: usize,
    #[doc = "<  Size of the largest free block in the heap. This is the largest malloc-able size."]
    pub largest_free_block: usize,
    #[doc = "<  Lifetime minimum free heap size. Equivalent to multi_minimum_free_heap_size()."]
    pub minimum_free_bytes: usize,
    #[doc = "<  Number of (variable size) blocks allocated in the heap."]
    pub allocated_blocks: usize,
    #[doc = "<  Number of (variable size) free blocks in the heap."]
    pub free_blocks: usize,
    #[doc = "<  Total number of (variable size) blocks in the heap."]
    pub total_blocks: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of multi_heap_info_t"][::std::mem::size_of::<multi_heap_info_t>() - 56usize];
    ["Alignment of multi_heap_info_t"][::std::mem::align_of::<multi_heap_info_t>() - 8usize];
    ["Offset of field: multi_heap_info_t::total_free_bytes"]
        [::std::mem::offset_of!(multi_heap_info_t, total_free_bytes) - 0usize];
    ["Offset of field: multi_heap_info_t::total_allocated_bytes"]
        [::std::mem::offset_of!(multi_heap_info_t, total_allocated_bytes) - 8usize];
    ["Offset of field: multi_heap_info_t::largest_free_block"]
        [::std::mem::offset_of!(multi_heap_info_t, largest_free_block) - 16usize];
    ["Offset of field: multi_heap_info_t::minimum_free_bytes"]
        [::std::mem::offset_of!(multi_heap_info_t, minimum_free_bytes) - 24usize];
    ["Offset of field: multi_heap_info_t::allocated_blocks"]
        [::std::mem::offset_of!(multi_heap_info_t, allocated_blocks) - 32usize];
    ["Offset of field: multi_heap_info_t::free_blocks"]
        [::std::mem::offset_of!(multi_heap_info_t, free_blocks) - 40usize];
    ["Offset of field: multi_heap_info_t::total_blocks"]
        [::std::mem::offset_of!(multi_heap_info_t, total_blocks) - 48usize];
};
unsafe extern "C" {
    #[doc = " @brief Return metadata about a given heap\n\n Fills a multi_heap_info_t structure with information about the specified heap.\n\n @param heap Handle to a registered heap.\n @param info Pointer to a structure to fill with heap metadata."]
    pub fn multi_heap_get_info(heap: multi_heap_handle_t, info: *mut multi_heap_info_t);
}
unsafe extern "C" {
    #[doc = " @brief Perform an aligned allocation from the provided offset\n\n @param heap The heap in which to perform the allocation\n @param size The size of the allocation\n @param alignment How the memory must be aligned\n @param offset The offset at which the alignment should start\n @return void* The ptr to the allocated memory"]
    pub fn multi_heap_aligned_alloc_offs(
        heap: multi_heap_handle_t,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Reset the minimum_free_bytes value (setting it to free_bytes) and return the former value\n\n @param heap The heap in which the reset is taking place\n @return size_t the value of minimum_free_bytes before it is reset"]
    pub fn multi_heap_reset_minimum_free_bytes(heap: multi_heap_handle_t) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Set the value of minimum_free_bytes to new_minimum_free_bytes_value or keep\n the current value of minimum_free_bytes if it is smaller than new_minimum_free_bytes_value\n\n @param heap The heap in which the restore is taking place\n @param new_minimum_free_bytes_value The value to restore the minimum_free_bytes to"]
    pub fn multi_heap_restore_minimum_free_bytes(
        heap: multi_heap_handle_t,
        new_minimum_free_bytes_value: usize,
    );
}
#[doc = " @brief Callback called when walking the given heap blocks of memory\n\n @param block_ptr Pointer to the block data\n @param block_size The size of the block\n @param block_used Block status. 0: free, 1: allocated\n @param user_data Opaque pointer to user defined data\n\n @return True if the walker is expected to continue the heap traversal\n         False if the walker is expected to stop the traversal of the heap"]
pub type multi_heap_walker_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        block_ptr: *mut ::std::os::raw::c_void,
        block_size: usize,
        block_used: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
unsafe extern "C" {
    #[doc = " @brief Call the tlsf_walk_pool function of the heap given as parameter with\n the walker function passed as parameter\n\n @param heap The heap to traverse\n @param walker_func The walker to trigger on each block of the heap\n @param user_data Opaque pointer to user defined data"]
    pub fn multi_heap_walk(
        heap: multi_heap_handle_t,
        walker_func: multi_heap_walker_cb_t,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn multi_heap_get_full_block_size(
        heap: multi_heap_handle_t,
        p: *mut ::std::os::raw::c_void,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Function walking through a given heap and returning the pointer to the\n allocated block containing the pointer passed as parameter.\n\n @note The heap parameter must be valid and the pointer parameter must\n belong to a block of allocated memory. The app will crash with an\n assertion failure if at least one of the parameter is invalid.\n\n @param heap The heap to walk through\n @param ptr The pointer to find the allocated block of\n @return Pointer to the allocated block containing the pointer ptr"]
    pub fn multi_heap_find_containing_block(
        heap: multi_heap_handle_t,
        ptr: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " @brief callback called when an allocation operation fails, if registered\n @param size in bytes of failed allocation\n @param caps capabilities requested of failed allocation\n @param function_name function which generated the failure"]
pub type esp_alloc_failed_hook_t = ::std::option::Option<
    unsafe extern "C" fn(size: usize, caps: u32, function_name: *const ::std::os::raw::c_char),
>;
unsafe extern "C" {
    #[doc = " @brief registers a callback function to be invoked if a memory allocation operation fails\n @param callback caller defined callback to be invoked\n @return ESP_OK if callback was registered."]
    pub fn heap_caps_register_failed_alloc_callback(callback: esp_alloc_failed_hook_t)
        -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate a chunk of memory which has the given capabilities\n\n Equivalent semantics to libc malloc(), for capability-aware memory.\n\n @param size Size, in bytes, of the amount of memory to allocate\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory to be returned\n\n @return A pointer to the memory allocated on success, NULL on failure"]
    pub fn heap_caps_malloc(size: usize, caps: u32) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Free memory previously allocated via heap_caps_malloc() or heap_caps_realloc().\n\n Equivalent semantics to libc free(), for capability-aware memory.\n\n  In IDF, ``free(p)`` is equivalent to ``heap_caps_free(p)``.\n\n @param ptr Pointer to memory previously returned from heap_caps_malloc() or heap_caps_realloc(). Can be NULL."]
    pub fn heap_caps_free(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Reallocate memory previously allocated via heap_caps_malloc() or heap_caps_realloc().\n\n Equivalent semantics to libc realloc(), for capability-aware memory.\n\n In IDF, ``realloc(p, s)`` is equivalent to ``heap_caps_realloc(p, s, MALLOC_CAP_8BIT)``.\n\n 'caps' parameter can be different to the capabilities that any original 'ptr' was allocated with. In this way,\n realloc can be used to \"move\" a buffer if necessary to ensure it meets a new set of capabilities.\n\n @param ptr Pointer to previously allocated memory, or NULL for a new allocation.\n @param size Size of the new buffer requested, or 0 to free the buffer.\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory desired for the new allocation.\n\n @return Pointer to a new buffer of size 'size' with capabilities 'caps', or NULL if allocation failed."]
    pub fn heap_caps_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        caps: u32,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Allocate an aligned chunk of memory which has the given capabilities\n\n Equivalent semantics to libc aligned_alloc(), for capability-aware memory.\n @param alignment  How the pointer received needs to be aligned\n                   must be a power of two\n @param size Size, in bytes, of the amount of memory to allocate\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory to be returned\n\n @return A pointer to the memory allocated on success, NULL on failure\n\n"]
    pub fn heap_caps_aligned_alloc(
        alignment: usize,
        size: usize,
        caps: u32,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Used to deallocate memory previously allocated with heap_caps_aligned_alloc\n\n @param ptr Pointer to the memory allocated\n @note This function is deprecated, please consider using heap_caps_free() instead"]
    pub fn heap_caps_aligned_free(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Allocate an aligned chunk of memory which has the given capabilities. The initialized value in the memory is set to zero.\n\n @param alignment  How the pointer received needs to be aligned\n                   must be a power of two\n @param n    Number of continuing chunks of memory to allocate\n @param size Size, in bytes, of a chunk of memory to allocate\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory to be returned\n\n @return A pointer to the memory allocated on success, NULL on failure\n"]
    pub fn heap_caps_aligned_calloc(
        alignment: usize,
        n: usize,
        size: usize,
        caps: u32,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Allocate a chunk of memory which has the given capabilities. The initialized value in the memory is set to zero.\n\n Equivalent semantics to libc calloc(), for capability-aware memory.\n\n In IDF, ``calloc(p)`` is equivalent to ``heap_caps_calloc(p, MALLOC_CAP_8BIT)``.\n\n @param n    Number of continuing chunks of memory to allocate\n @param size Size, in bytes, of a chunk of memory to allocate\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory to be returned\n\n @return A pointer to the memory allocated on success, NULL on failure"]
    pub fn heap_caps_calloc(n: usize, size: usize, caps: u32) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Get the total size of all the regions that have the given capabilities\n\n This function takes all regions capable of having the given capabilities allocated in them\n and adds up the total space they have.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n\n @return total size in bytes"]
    pub fn heap_caps_get_total_size(caps: u32) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Get the total free size of all the regions that have the given capabilities\n\n This function takes all regions capable of having the given capabilities allocated in them\n and adds up the free space they have.\n\n @note Note that because of heap fragmentation it is probably not possible to allocate a single block of memory\n of this size. Use heap_caps_get_largest_free_block() for this purpose.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n\n @return Amount of free bytes in the regions"]
    pub fn heap_caps_get_free_size(caps: u32) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Get the total minimum free memory of all regions with the given capabilities\n\n This adds all the low watermarks of the regions capable of delivering the memory\n with the given capabilities.\n\n @note Note the result may be less than the global all-time minimum available heap of this kind, as \"low watermarks\" are\n tracked per-region. Individual regions' heaps may have reached their \"low watermarks\" at different points in time. However,\n this result still gives a \"worst case\" indication for all-time minimum free heap.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n\n @return Amount of free bytes in the regions"]
    pub fn heap_caps_get_minimum_free_size(caps: u32) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Get the largest free block of memory able to be allocated with the given capabilities.\n\n Returns the largest value of ``s`` for which ``heap_caps_malloc(s, caps)`` will succeed.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n\n @return Size of the largest free block in bytes."]
    pub fn heap_caps_get_largest_free_block(caps: u32) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Start monitoring the value of minimum_free_bytes from the moment this\n function is called instead of from startup.\n\n @note This allows to detect local lows of the minimum_free_bytes value\n that wouldn't be detected otherwise.\n\n @return esp_err_t ESP_OK if the function executed properly\n                   ESP_FAIL if called when monitoring already active"]
    pub fn heap_caps_monitor_local_minimum_free_size_start() -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Stop monitoring the value of minimum_free_bytes. After this call\n the minimum_free_bytes value calculated from startup will be returned in\n heap_caps_get_info and heap_caps_get_minimum_free_size.\n\n @return esp_err_t ESP_OK if the function executed properly\n                   ESP_FAIL if called when monitoring not active"]
    pub fn heap_caps_monitor_local_minimum_free_size_stop() -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Get heap info for all regions with the given capabilities.\n\n Calls multi_heap_info() on all heaps which share the given capabilities. The information returned is an aggregate\n across all matching heaps. The meanings of fields are the same as defined for multi_heap_info_t, except that\n ``minimum_free_bytes`` has the same caveats described in heap_caps_get_minimum_free_size().\n\n @param info        Pointer to a structure which will be filled with relevant\n                    heap metadata.\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n"]
    pub fn heap_caps_get_info(info: *mut multi_heap_info_t, caps: u32);
}
unsafe extern "C" {
    #[doc = " @brief Print a summary of all memory with the given capabilities.\n\n Calls multi_heap_info on all heaps which share the given capabilities, and\n prints a two-line summary for each, then a total summary.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n"]
    pub fn heap_caps_print_heap_info(caps: u32);
}
unsafe extern "C" {
    #[doc = " @brief Check integrity of all heap memory in the system.\n\n Calls multi_heap_check on all heaps. Optionally print errors if heaps are corrupt.\n\n Calling this function is equivalent to calling heap_caps_check_integrity\n with the caps argument set to MALLOC_CAP_INVALID.\n\n @param print_errors Print specific errors if heap corruption is found.\n\n @note Please increase the value of `CONFIG_ESP_INT_WDT_TIMEOUT_MS` when using this API\n with PSRAM enabled.\n\n @return True if all heaps are valid, False if at least one heap is corrupt."]
    pub fn heap_caps_check_integrity_all(print_errors: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Check integrity of all heaps with the given capabilities.\n\n Calls multi_heap_check on all heaps which share the given capabilities. Optionally\n print errors if the heaps are corrupt.\n\n See also heap_caps_check_integrity_all to check all heap memory\n in the system and heap_caps_check_integrity_addr to check memory\n around a single address.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory\n @param print_errors Print specific errors if heap corruption is found.\n\n @note Please increase the value of `CONFIG_ESP_INT_WDT_TIMEOUT_MS` when using this API\n with PSRAM capability flag.\n\n @return True if all heaps are valid, False if at least one heap is corrupt."]
    pub fn heap_caps_check_integrity(caps: u32, print_errors: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Check integrity of heap memory around a given address.\n\n This function can be used to check the integrity of a single region of heap memory,\n which contains the given address.\n\n This can be useful if debugging heap integrity for corruption at a known address,\n as it has a lower overhead than checking all heap regions. Note that if the corrupt\n address moves around between runs (due to timing or other factors) then this approach\n won't work, and you should call heap_caps_check_integrity or\n heap_caps_check_integrity_all instead.\n\n @note The entire heap region around the address is checked, not only the adjacent\n heap blocks.\n\n @param addr Address in memory. Check for corruption in region containing this address.\n @param print_errors Print specific errors if heap corruption is found.\n\n @return True if the heap containing the specified address is valid,\n False if at least one heap is corrupt or the address doesn't belong to a heap region."]
    pub fn heap_caps_check_integrity_addr(addr: isize, print_errors: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Enable malloc() in external memory and set limit below which\n        malloc() attempts are placed in internal memory.\n\n When external memory is in use, the allocation strategy is to initially try to\n satisfy smaller allocation requests with internal memory and larger requests\n with external memory. This sets the limit between the two, as well as generally\n enabling allocation in external memory.\n\n @param limit       Limit, in bytes."]
    pub fn heap_caps_malloc_extmem_enable(limit: usize);
}
unsafe extern "C" {
    #[doc = " @brief Allocate a chunk of memory as preference in decreasing order.\n\n @attention The variable parameters are bitwise OR of MALLOC_CAP_* flags indicating the type of memory.\n            This API prefers to allocate memory with the first parameter. If failed, allocate memory with\n            the next parameter. It will try in this order until allocating a chunk of memory successfully\n            or fail to allocate memories with any of the parameters.\n\n @param size Size, in bytes, of the amount of memory to allocate\n @param num Number of variable parameters\n\n @return A pointer to the memory allocated on success, NULL on failure"]
    pub fn heap_caps_malloc_prefer(size: usize, num: usize, ...) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Reallocate a chunk of memory as preference in decreasing order.\n\n @param ptr Pointer to previously allocated memory, or NULL for a new allocation.\n @param size Size of the new buffer requested, or 0 to free the buffer.\n @param num Number of variable parameters\n\n @return Pointer to a new buffer of size 'size', or NULL if allocation failed."]
    pub fn heap_caps_realloc_prefer(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        num: usize,
        ...
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Allocate a chunk of memory as preference in decreasing order.\n\n @param n    Number of continuing chunks of memory to allocate\n @param size Size, in bytes, of a chunk of memory to allocate\n @param num  Number of variable parameters\n\n @return A pointer to the memory allocated on success, NULL on failure"]
    pub fn heap_caps_calloc_prefer(
        n: usize,
        size: usize,
        num: usize,
        ...
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Dump the full structure of all heaps with matching capabilities.\n\n Prints a large amount of output to serial (because of locking limitations,\n the output bypasses stdout/stderr). For each (variable sized) block\n in each matching heap, the following output is printed on a single line:\n\n - Block address (the data buffer returned by malloc is 4 bytes after this\n   if heap debugging is set to Basic, or 8 bytes otherwise).\n - Data size (the data size may be larger than the size requested by malloc,\n   either due to heap fragmentation or because of heap debugging level).\n - Address of next block in the heap.\n - If the block is free, the address of the next free block is also printed.\n\n @param caps        Bitwise OR of MALLOC_CAP_* flags indicating the type\n                    of memory"]
    pub fn heap_caps_dump(caps: u32);
}
unsafe extern "C" {
    #[doc = " @brief Dump the full structure of all heaps.\n\n Covers all registered heaps. Prints a large amount of output to serial.\n\n Output is the same as for heap_caps_dump.\n"]
    pub fn heap_caps_dump_all();
}
unsafe extern "C" {
    #[doc = " @brief Return the size that a particular pointer was allocated with.\n\n @param ptr Pointer to currently allocated heap memory. Must be a pointer value previously\n returned by heap_caps_malloc, malloc, calloc, etc. and not yet freed.\n\n @note The app will crash with an assertion failure if the pointer is not valid.\n\n @return Size of the memory allocated at this block.\n"]
    pub fn heap_caps_get_allocated_size(ptr: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Return the size of the block containing the pointer passed as parameter.\n\n @param ptr Pointer to currently allocated heap memory. The pointer value\n must be within the allocated memory and the memory must not be freed.\n\n @note The app will crash with an assertion failure if the pointer is invalid.\n\n @return Size of the containing block allocated.\n"]
    pub fn heap_caps_get_containing_block_size(ptr: *mut ::std::os::raw::c_void) -> usize;
}
#[doc = " @brief Structure used to store heap related data passed to\n the walker callback function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct walker_heap_info {
    #[doc = "< Start address of the heap in which the block is located"]
    pub start: isize,
    #[doc = "< End address of the heap in which the block is located"]
    pub end: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of walker_heap_info"][::std::mem::size_of::<walker_heap_info>() - 16usize];
    ["Alignment of walker_heap_info"][::std::mem::align_of::<walker_heap_info>() - 8usize];
    ["Offset of field: walker_heap_info::start"]
        [::std::mem::offset_of!(walker_heap_info, start) - 0usize];
    ["Offset of field: walker_heap_info::end"]
        [::std::mem::offset_of!(walker_heap_info, end) - 8usize];
};
#[doc = " @brief Structure used to store heap related data passed to\n the walker callback function"]
pub type walker_heap_into_t = walker_heap_info;
#[doc = " @brief Structure used to store block related data passed to\n the walker callback function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct walker_block_info {
    #[doc = "< Pointer to the block data"]
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = "< The size of the block"]
    pub size: usize,
    #[doc = "< Block status. True: used, False: free"]
    pub used: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of walker_block_info"][::std::mem::size_of::<walker_block_info>() - 24usize];
    ["Alignment of walker_block_info"][::std::mem::align_of::<walker_block_info>() - 8usize];
    ["Offset of field: walker_block_info::ptr"]
        [::std::mem::offset_of!(walker_block_info, ptr) - 0usize];
    ["Offset of field: walker_block_info::size"]
        [::std::mem::offset_of!(walker_block_info, size) - 8usize];
    ["Offset of field: walker_block_info::used"]
        [::std::mem::offset_of!(walker_block_info, used) - 16usize];
};
#[doc = " @brief Structure used to store block related data passed to\n the walker callback function"]
pub type walker_block_info_t = walker_block_info;
#[doc = " @brief Function callback used to get information of memory block\n during calls to heap_caps_walk or heap_caps_walk_all\n\n @param heap_info See walker_heap_into_t\n @param block_info See walker_block_info_t\n @param user_data Opaque pointer to user defined data\n\n @return True to proceed with the heap traversal\n         False to stop the traversal of the current heap and continue\n         with the traversal of the next heap (if any)"]
pub type heap_caps_walker_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        heap_info: walker_heap_into_t,
        block_info: walker_block_info_t,
        user_data: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
unsafe extern "C" {
    #[doc = " @brief Function called to walk through the heaps with the given set of capabilities\n\n @param caps The set of capabilities assigned to the heaps to walk through\n @param walker_func Callback called for each block of the heaps being traversed\n @param user_data Opaque pointer to user defined data"]
    pub fn heap_caps_walk(
        caps: u32,
        walker_func: heap_caps_walker_cb_t,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " @brief Function called to walk through all heaps defined by the heap component\n\n @param walker_func Callback called for each block of the heaps being traversed\n @param user_data Opaque pointer to user defined data"]
    pub fn heap_caps_walk_all(
        walker_func: heap_caps_walker_cb_t,
        user_data: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denomer: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn _strtoimax_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn _strtoumax_r(
        arg1: *mut _reent,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn _wcstoimax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn _wcstoumax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn strtoimax_l(
        arg1: *const ::std::os::raw::c_char,
        _restrict: *mut *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax_l(
        arg1: *const ::std::os::raw::c_char,
        _restrict: *mut *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: ::std::os::raw::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: ::std::os::raw::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
pub const soc_reset_reason_t_RESET_REASON_CHIP_POWER_ON: soc_reset_reason_t = 1;
pub const soc_reset_reason_t_RESET_REASON_CORE_SW: soc_reset_reason_t = 3;
pub const soc_reset_reason_t_RESET_REASON_CORE_DEEP_SLEEP: soc_reset_reason_t = 5;
pub const soc_reset_reason_t_RESET_REASON_CORE_SDIO: soc_reset_reason_t = 6;
pub const soc_reset_reason_t_RESET_REASON_CORE_MWDT0: soc_reset_reason_t = 7;
pub const soc_reset_reason_t_RESET_REASON_CORE_MWDT1: soc_reset_reason_t = 8;
pub const soc_reset_reason_t_RESET_REASON_CORE_RTC_WDT: soc_reset_reason_t = 9;
pub const soc_reset_reason_t_RESET_REASON_CPU0_MWDT0: soc_reset_reason_t = 11;
pub const soc_reset_reason_t_RESET_REASON_CPU1_MWDT1: soc_reset_reason_t = 11;
pub const soc_reset_reason_t_RESET_REASON_CPU0_SW: soc_reset_reason_t = 12;
pub const soc_reset_reason_t_RESET_REASON_CPU1_SW: soc_reset_reason_t = 12;
pub const soc_reset_reason_t_RESET_REASON_CPU0_RTC_WDT: soc_reset_reason_t = 13;
pub const soc_reset_reason_t_RESET_REASON_CPU1_RTC_WDT: soc_reset_reason_t = 13;
pub const soc_reset_reason_t_RESET_REASON_CPU1_CPU0: soc_reset_reason_t = 14;
pub const soc_reset_reason_t_RESET_REASON_SYS_BROWN_OUT: soc_reset_reason_t = 15;
pub const soc_reset_reason_t_RESET_REASON_SYS_RTC_WDT: soc_reset_reason_t = 16;
#[doc = " @brief Naming conventions: RESET_REASON_{reset level}_{reset reason}\n @note refer to TRM: <Reset and Clock> chapter"]
pub type soc_reset_reason_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    #[doc = " @brief Software Reset digital core include RTC.\n\n It is not recommended to use this function in esp-idf, use\n esp_restart() instead."]
    pub fn esp_rom_software_reset_system();
}
unsafe extern "C" {
    #[doc = " @brief Software Reset cpu core.\n\n It is not recommended to use this function in esp-idf, use\n esp_restart() instead.\n\n @param  cpu_no : The CPU to reset, 0 for PRO CPU, 1 for APP CPU."]
    pub fn esp_rom_software_reset_cpu(cpu_no: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Print formatted string to console device\n @note float and long long data are not supported!\n\n @param fmt Format string\n @param ... Additional arguments, depending on the format string\n @return int: Total number of characters written on success; A negative number on failure."]
    pub fn esp_rom_printf(fmt: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Print formatted string to console device\n @note float and long long data are not supported!\n\n @param fmt Format string\n @param ap List of arguments.\n @return int: Total number of characters written on success; A negative number on failure."]
    pub fn esp_rom_vprintf(
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Convert an unsigned integer value to a string representation in the specified radix.\n\n This function converts the given unsigned integer value to a string representation in the specified radix.\n The resulting string is stored in the provided character buffer `buf`.\n\n @param[in] val    The unsigned integer value to be converted.\n @param[in] radix  The base of the numeral system to be used for the conversion.\n                   It determines the number of unique digits in the numeral system\n                   (e.g., 2 for binary, 10 for decimal, 16 for hexadecimal).\n @param[in] pad    The optional padding width (0 - unused) for the resulting string. It adds zero-padding.\n                   (val=123, pad=6 -> result=000123).\n @param[in] digits Pointer to a character array representing the digits of the\n                   numeral system. The array must contain characters in the order of increasing\n                   values, corresponding to the digits of the radix. For example, \"0123456789ABCDEF\"\n                   or hexadecimal.\n @param[out] buf   Pointer to the character buffer where the resulting string will\n                   be stored. The buffer must have enough space to accommodate the entire converted\n                   string, including the null-terminator.\n\n @return The length of the resulting string (excluding the null-terminator).\n\n @note The buffer `buf` must have sufficient space to hold the entire converted string, including the null-terminator.\n       The caller is responsible for ensuring the buffer's size is large enough to prevent buffer overflow.\n @note The provided `digits` array must have enough elements to cover the entire radix used for conversion. Otherwise, undefined behavior may occur."]
    pub fn esp_rom_cvt(
        val: ::std::os::raw::c_ulonglong,
        radix: ::std::os::raw::c_long,
        pad: ::std::os::raw::c_int,
        digits: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Pauses execution for us microseconds\n\n @param us Number of microseconds to pause"]
    pub fn esp_rom_delay_us(us: u32);
}
unsafe extern "C" {
    #[doc = " @brief esp_rom_printf can print message to different channels simultaneously.\n        This function can help install the low level putc function for esp_rom_printf.\n\n @param channel Channel number (starting from 1)\n @param putc Function pointer to the putc implementation. Set NULL can disconnect esp_rom_printf with putc."]
    pub fn esp_rom_install_channel_putc(
        channel: ::std::os::raw::c_int,
        putc: ::std::option::Option<unsafe extern "C" fn(c: ::std::os::raw::c_char)>,
    );
}
unsafe extern "C" {
    #[doc = " @brief It outputs a character to different channels simultaneously.\n        This function is used by esp_rom_printf/esp_rom_vprintf.\n\n @param c Char to output."]
    pub fn esp_rom_output_to_channels(c: ::std::os::raw::c_char);
}
unsafe extern "C" {
    #[doc = " @brief Install UART1 as the default console channel, equivalent to `esp_rom_install_channel_putc(1, esp_rom_output_putc)`"]
    pub fn esp_rom_install_uart_printf();
}
unsafe extern "C" {
    #[doc = " @brief Get reset reason of CPU\n\n @param cpu_no CPU number\n @return Reset reason code (see in soc/reset_reasons.h)"]
    pub fn esp_rom_get_reset_reason(cpu_no: ::std::os::raw::c_int) -> soc_reset_reason_t;
}
unsafe extern "C" {
    #[doc = " @brief Route peripheral interrupt sources to CPU's interrupt port by matrix\n\n Usually there're 4 steps to use an interrupt:\n 1. Route peripheral interrupt source to CPU. e.g.  esp_rom_route_intr_matrix(0, ETS_WIFI_MAC_INTR_SOURCE, ETS_WMAC_INUM)\n 2. Set interrupt handler for CPU\n 3. Enable CPU interrupt\n 4. Enable peripheral interrupt\n\n @param cpu_core The CPU number, which the peripheral interrupt will inform to\n @param periph_intr_id The peripheral interrupt source number\n @param cpu_intr_num The CPU (external) interrupt number. On targets that use CLIC as their interrupt controller,\n                     this number represents the external interrupt number. For example, passing `cpu_intr_num = i`\n                     to this function would in fact bind peripheral source to CPU interrupt `CLIC_EXT_INTR_NUM_OFFSET + i`."]
    pub fn esp_rom_route_intr_matrix(
        cpu_core: ::std::os::raw::c_int,
        periph_intr_id: u32,
        cpu_intr_num: u32,
    );
}
unsafe extern "C" {
    #[doc = " @brief Get the real CPU ticks per us\n\n @return CPU ticks per us"]
    pub fn esp_rom_get_cpu_ticks_per_us() -> u32;
}
unsafe extern "C" {
    #[doc = " @brief Set the real CPU tick rate\n\n @note Call this function when CPU frequency is changed, otherwise the `esp_rom_delay_us` can be inaccurate.\n\n @param ticks_per_us CPU ticks per us"]
    pub fn esp_rom_set_cpu_ticks_per_us(ticks_per_us: u32);
}
unsafe extern "C" {
    #[doc = " Return full IDF version string, same as 'git describe' output.\n\n @note If you are printing the ESP-IDF version in a log file or other information,\n this function provides more information than using the numerical version macros.\n For example, numerical version macros don't differentiate between development,\n pre-release and release versions, but the output of this function does.\n\n @return constant string from IDF_VER"]
    pub fn esp_get_idf_version() -> *const ::std::os::raw::c_char;
}
#[doc = "!< Reset reason can not be determined"]
pub const esp_reset_reason_t_ESP_RST_UNKNOWN: esp_reset_reason_t = 0;
#[doc = "!< Reset due to power-on event"]
pub const esp_reset_reason_t_ESP_RST_POWERON: esp_reset_reason_t = 1;
#[doc = "!< Reset by external pin (not applicable for ESP32)"]
pub const esp_reset_reason_t_ESP_RST_EXT: esp_reset_reason_t = 2;
#[doc = "!< Software reset via esp_restart"]
pub const esp_reset_reason_t_ESP_RST_SW: esp_reset_reason_t = 3;
#[doc = "!< Software reset due to exception/panic"]
pub const esp_reset_reason_t_ESP_RST_PANIC: esp_reset_reason_t = 4;
#[doc = "!< Reset (software or hardware) due to interrupt watchdog"]
pub const esp_reset_reason_t_ESP_RST_INT_WDT: esp_reset_reason_t = 5;
#[doc = "!< Reset due to task watchdog"]
pub const esp_reset_reason_t_ESP_RST_TASK_WDT: esp_reset_reason_t = 6;
#[doc = "!< Reset due to other watchdogs"]
pub const esp_reset_reason_t_ESP_RST_WDT: esp_reset_reason_t = 7;
#[doc = "!< Reset after exiting deep sleep mode"]
pub const esp_reset_reason_t_ESP_RST_DEEPSLEEP: esp_reset_reason_t = 8;
#[doc = "!< Brownout reset (software or hardware)"]
pub const esp_reset_reason_t_ESP_RST_BROWNOUT: esp_reset_reason_t = 9;
#[doc = "!< Reset over SDIO"]
pub const esp_reset_reason_t_ESP_RST_SDIO: esp_reset_reason_t = 10;
#[doc = "!< Reset by USB peripheral"]
pub const esp_reset_reason_t_ESP_RST_USB: esp_reset_reason_t = 11;
#[doc = "!< Reset by JTAG"]
pub const esp_reset_reason_t_ESP_RST_JTAG: esp_reset_reason_t = 12;
#[doc = "!< Reset due to efuse error"]
pub const esp_reset_reason_t_ESP_RST_EFUSE: esp_reset_reason_t = 13;
#[doc = "!< Reset due to power glitch detected"]
pub const esp_reset_reason_t_ESP_RST_PWR_GLITCH: esp_reset_reason_t = 14;
#[doc = "!< Reset due to CPU lock up (double exception)"]
pub const esp_reset_reason_t_ESP_RST_CPU_LOCKUP: esp_reset_reason_t = 15;
#[doc = " @brief Reset reasons"]
pub type esp_reset_reason_t = ::std::os::raw::c_uint;
#[doc = " Shutdown handler type"]
pub type shutdown_handler_t = ::std::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    #[doc = " @brief  Register shutdown handler\n\n This function allows you to register a handler that gets invoked before\n the application is restarted using esp_restart function.\n @param handle function to execute on restart\n @return\n   - ESP_OK on success\n   - ESP_ERR_INVALID_STATE if the handler has already been registered\n   - ESP_ERR_NO_MEM if no more shutdown handler slots are available"]
    pub fn esp_register_shutdown_handler(handle: shutdown_handler_t) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief  Unregister shutdown handler\n\n This function allows you to unregister a handler which was previously\n registered using esp_register_shutdown_handler function.\n   - ESP_OK on success\n   - ESP_ERR_INVALID_STATE if the given handler hasn't been registered before"]
    pub fn esp_unregister_shutdown_handler(handle: shutdown_handler_t) -> esp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief  Restart PRO and APP CPUs.\n\n This function can be called both from PRO and APP CPUs.\n After successful restart, CPU reset reason will be SW_CPU_RESET.\n Peripherals (except for Wi-Fi, BT, UART0, SPI1, and legacy timers) are not reset.\n This function does not return."]
    pub fn esp_restart() -> !;
}
unsafe extern "C" {
    #[doc = " @brief  Get reason of last reset\n @return See description of esp_reset_reason_t for explanation of each value."]
    pub fn esp_reset_reason() -> esp_reset_reason_t;
}
unsafe extern "C" {
    #[doc = " @brief  Get the size of available heap.\n\n @note Note that the returned value may be larger than the maximum contiguous block\n which can be allocated.\n\n @return Available heap size, in bytes."]
    pub fn esp_get_free_heap_size() -> u32;
}
unsafe extern "C" {
    #[doc = " @brief  Get the size of available internal heap.\n\n @note Note that the returned value may be larger than the maximum contiguous block\n which can be allocated.\n\n @return Available internal heap size, in bytes."]
    pub fn esp_get_free_internal_heap_size() -> u32;
}
unsafe extern "C" {
    #[doc = " @brief Get the minimum heap that has ever been available\n\n @return Minimum free heap ever available"]
    pub fn esp_get_minimum_free_heap_size() -> u32;
}
unsafe extern "C" {
    #[doc = " @brief Trigger a software abort\n\n @param details Details that will be displayed during panic handling."]
    pub fn esp_system_abort(details: *const ::std::os::raw::c_char) -> !;
}
pub type StackType_t = u8;
pub type BaseType_t = ::std::os::raw::c_int;
pub type UBaseType_t = ::std::os::raw::c_uint;
pub type TickType_t = u32;
unsafe extern "C" {
    #[doc = " @brief Checks if the current core is in an ISR context\n\n - ISR context consist of Low/Mid priority ISR, or time tick ISR\n - High priority ISRs aren't detected here, but they normally cannot call C code, so that should not be an issue anyway.\n\n @note [refactor-todo] Check if this should be inlined\n @return\n  - pdTRUE if in ISR\n  - pdFALSE otherwise"]
    pub fn xPortInIsrContext() -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " @brief Assert if in ISR context\n\n - Asserts on xPortInIsrContext() internally"]
    pub fn vPortAssertIfInISR();
}
unsafe extern "C" {
    #[doc = " @brief Check if in ISR context from High priority ISRs\n\n - Called from High priority ISR\n - Checks if the previous context (before high priority interrupt) was in ISR context (meaning low/med priority)\n\n @note [refactor-todo] Check if this should be inlined\n @return\n  - pdTRUE if in previous in ISR context\n  - pdFALSE otherwise"]
    pub fn xPortInterruptedFromISRContext() -> BaseType_t;
}
pub type portMUX_TYPE = spinlock_t;
unsafe extern "C" {
    #[doc = " @brief Enter a SMP critical section with a timeout\n\n This function enters an SMP critical section by disabling interrupts then\n taking a spinlock with a specified timeout.\n\n This function can be called in a nested manner.\n\n @note This function is made non-inline on purpose to reduce code size\n @param mux Spinlock\n @param timeout Timeout to wait for spinlock in number of CPU cycles.\n                Use portMUX_NO_TIMEOUT to wait indefinitely\n                Use portMUX_TRY_LOCK to only getting the spinlock a single time\n @retval pdPASS Critical section entered (spinlock taken)\n @retval pdFAIL If timed out waiting for spinlock (will not occur if using portMUX_NO_TIMEOUT)"]
    pub fn xPortEnterCriticalTimeout(mux: *mut portMUX_TYPE, timeout: BaseType_t) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " @brief Exit a SMP critical section\n\n This function can be called in a nested manner. On the outer most level of nesting, this function will:\n\n - Release the spinlock\n - Restore the previous interrupt level before the critical section was entered\n\n If still nesting, this function simply decrements a critical nesting count\n\n @note This function is made non-inline on purpose to reduce code size\n @param[in] mux Spinlock"]
    pub fn vPortExitCritical(mux: *mut portMUX_TYPE);
}
unsafe extern "C" {
    #[doc = " @brief FreeRTOS Compliant version of xPortEnterCriticalTimeout()\n\n Compliant version of xPortEnterCriticalTimeout() will ensure that this is\n called from a task context only. An abort is called otherwise.\n\n @note This function is made non-inline on purpose to reduce code size\n\n @param mux Spinlock\n @param timeout Timeout\n @return BaseType_t"]
    pub fn xPortEnterCriticalTimeoutCompliance(
        mux: *mut portMUX_TYPE,
        timeout: BaseType_t,
    ) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " @brief FreeRTOS compliant version of vPortExitCritical()\n\n Compliant version of vPortExitCritical() will ensure that this is\n called from a task context only. An abort is called otherwise.\n\n @note This function is made non-inline on purpose to reduce code size\n @param[in] mux Spinlock"]
    pub fn vPortExitCriticalCompliance(mux: *mut portMUX_TYPE);
}
unsafe extern "C" {
    #[doc = " @brief Perform a solicited context switch\n\n - Defined in portasm.S\n\n @note [refactor-todo] The rest of ESP-IDF should call taskYield() instead"]
    pub fn vPortYield();
}
unsafe extern "C" {
    #[doc = " @brief Yields the other core\n\n - Send an interrupt to another core in order to make the task running on it yield for a higher-priority task.\n - Can be used to yield current core as well\n\n @note [refactor-todo] Put this into private macros as its only called from task.c and is not public API\n @param coreid ID of core to yield"]
    pub fn vPortYieldOtherCore(coreid: BaseType_t);
}
unsafe extern "C" {
    #[doc = " @brief Hook function called on entry to tickless idle\n\n - Implemented in pm_impl.c\n\n @param xExpectedIdleTime Expected idle time"]
    pub fn vApplicationSleep(xExpectedIdleTime: TickType_t);
}
unsafe extern "C" {
    #[doc = " @brief Get the tick rate per second\n\n @note [refactor-todo] make this inline\n @return uint32_t Tick rate in Hz"]
    pub fn xPortGetTickRateHz() -> u32;
}
unsafe extern "C" {
    #[doc = " @brief Set a watchpoint to watch the last 32 bytes of the stack\n\n Callback to set a watchpoint on the end of the stack. Called every context switch to change the stack watchpoint\n around.\n\n @param pxStackStart Pointer to the start of the stack"]
    pub fn vPortSetStackWatchpoint(pxStackStart: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief TCB cleanup hook\n\n The portCLEAN_UP_TCB() macro is called in prvDeleteTCB() right before a\n deleted task's memory is freed. We map that macro to this internal function\n so that IDF FreeRTOS ports can inject some task pre-deletion operations.\n\n @note We can't use vPortCleanUpTCB() due to API compatibility issues. See\n CONFIG_FREERTOS_ENABLE_STATIC_TASK_CLEAN_UP. Todo: IDF-8097"]
    pub fn vPortTCBPreDeleteHook(pxTCB: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _frxt_setup_switch();
}
unsafe extern "C" {
    #[doc = " @brief Checks if a given piece of memory can be used to store a FreeRTOS list\n\n - Defined in heap_idf.c\n\n @param ptr Pointer to memory\n @return true Memory can be used to store a List\n @return false Otherwise"]
    pub fn xPortCheckValidListMem(ptr: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Checks if a given piece of memory can be used to store a task's TCB\n\n - Defined in heap_idf.c\n\n @param ptr Pointer to memory\n @return true Memory can be used to store a TCB\n @return false Otherwise"]
    pub fn xPortCheckValidTCBMem(ptr: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Checks if a given piece of memory can be used to store a task's stack\n\n - Defined in heap_idf.c\n\n @param ptr Pointer to memory\n @return true Memory can be used to store a task stack\n @return false Otherwise"]
    pub fn xPortcheckValidStackMem(ptr: *const ::std::os::raw::c_void) -> bool;
}
unsafe extern "C" {
    pub fn pxPortInitialiseStack(
        pxTopOfStack: *mut StackType_t,
        pxCode: TaskFunction_t,
        pvParameters: *mut ::std::os::raw::c_void,
    ) -> *mut StackType_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HeapRegion {
    pub pucStartAddress: *mut u8,
    pub xSizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HeapRegion"][::std::mem::size_of::<HeapRegion>() - 16usize];
    ["Alignment of HeapRegion"][::std::mem::align_of::<HeapRegion>() - 8usize];
    ["Offset of field: HeapRegion::pucStartAddress"]
        [::std::mem::offset_of!(HeapRegion, pucStartAddress) - 0usize];
    ["Offset of field: HeapRegion::xSizeInBytes"]
        [::std::mem::offset_of!(HeapRegion, xSizeInBytes) - 8usize];
};
pub type HeapRegion_t = HeapRegion;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xHeapStats {
    pub xAvailableHeapSpaceInBytes: usize,
    pub xSizeOfLargestFreeBlockInBytes: usize,
    pub xSizeOfSmallestFreeBlockInBytes: usize,
    pub xNumberOfFreeBlocks: usize,
    pub xMinimumEverFreeBytesRemaining: usize,
    pub xNumberOfSuccessfulAllocations: usize,
    pub xNumberOfSuccessfulFrees: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xHeapStats"][::std::mem::size_of::<xHeapStats>() - 56usize];
    ["Alignment of xHeapStats"][::std::mem::align_of::<xHeapStats>() - 8usize];
    ["Offset of field: xHeapStats::xAvailableHeapSpaceInBytes"]
        [::std::mem::offset_of!(xHeapStats, xAvailableHeapSpaceInBytes) - 0usize];
    ["Offset of field: xHeapStats::xSizeOfLargestFreeBlockInBytes"]
        [::std::mem::offset_of!(xHeapStats, xSizeOfLargestFreeBlockInBytes) - 8usize];
    ["Offset of field: xHeapStats::xSizeOfSmallestFreeBlockInBytes"]
        [::std::mem::offset_of!(xHeapStats, xSizeOfSmallestFreeBlockInBytes) - 16usize];
    ["Offset of field: xHeapStats::xNumberOfFreeBlocks"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfFreeBlocks) - 24usize];
    ["Offset of field: xHeapStats::xMinimumEverFreeBytesRemaining"]
        [::std::mem::offset_of!(xHeapStats, xMinimumEverFreeBytesRemaining) - 32usize];
    ["Offset of field: xHeapStats::xNumberOfSuccessfulAllocations"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfSuccessfulAllocations) - 40usize];
    ["Offset of field: xHeapStats::xNumberOfSuccessfulFrees"]
        [::std::mem::offset_of!(xHeapStats, xNumberOfSuccessfulFrees) - 48usize];
};
pub type HeapStats_t = xHeapStats;
unsafe extern "C" {
    pub fn vPortDefineHeapRegions(pxHeapRegions: *const HeapRegion_t);
}
unsafe extern "C" {
    pub fn vPortGetHeapStats(pxHeapStats: *mut HeapStats_t);
}
unsafe extern "C" {
    pub fn pvPortMalloc(xSize: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn pvPortCalloc(xNum: usize, xSize: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn vPortFree(pv: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn vPortInitialiseBlocks();
}
unsafe extern "C" {
    pub fn xPortGetFreeHeapSize() -> usize;
}
unsafe extern "C" {
    pub fn xPortGetMinimumEverFreeHeapSize() -> usize;
}
unsafe extern "C" {
    pub fn xPortStartScheduler() -> BaseType_t;
}
unsafe extern "C" {
    pub fn vPortEndScheduler();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_LIST_ITEM"][::std::mem::size_of::<xSTATIC_LIST_ITEM>() - 40usize];
    ["Alignment of xSTATIC_LIST_ITEM"][::std::mem::align_of::<xSTATIC_LIST_ITEM>() - 8usize];
    ["Offset of field: xSTATIC_LIST_ITEM::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_LIST_ITEM, xDummy2) - 0usize];
    ["Offset of field: xSTATIC_LIST_ITEM::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_LIST_ITEM, pvDummy3) - 8usize];
};
pub type StaticListItem_t = xSTATIC_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_MINI_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut ::std::os::raw::c_void; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_MINI_LIST_ITEM"][::std::mem::size_of::<xSTATIC_MINI_LIST_ITEM>() - 24usize];
    ["Alignment of xSTATIC_MINI_LIST_ITEM"]
        [::std::mem::align_of::<xSTATIC_MINI_LIST_ITEM>() - 8usize];
    ["Offset of field: xSTATIC_MINI_LIST_ITEM::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_MINI_LIST_ITEM, xDummy2) - 0usize];
    ["Offset of field: xSTATIC_MINI_LIST_ITEM::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_MINI_LIST_ITEM, pvDummy3) - 8usize];
};
pub type StaticMiniListItem_t = xSTATIC_MINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST {
    pub uxDummy2: UBaseType_t,
    pub pvDummy3: *mut ::std::os::raw::c_void,
    pub xDummy4: StaticMiniListItem_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_LIST"][::std::mem::size_of::<xSTATIC_LIST>() - 40usize];
    ["Alignment of xSTATIC_LIST"][::std::mem::align_of::<xSTATIC_LIST>() - 8usize];
    ["Offset of field: xSTATIC_LIST::uxDummy2"]
        [::std::mem::offset_of!(xSTATIC_LIST, uxDummy2) - 0usize];
    ["Offset of field: xSTATIC_LIST::pvDummy3"]
        [::std::mem::offset_of!(xSTATIC_LIST, pvDummy3) - 8usize];
    ["Offset of field: xSTATIC_LIST::xDummy4"]
        [::std::mem::offset_of!(xSTATIC_LIST, xDummy4) - 16usize];
};
pub type StaticList_t = xSTATIC_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TCB {
    pub pxDummy1: *mut ::std::os::raw::c_void,
    pub xDummy3: [StaticListItem_t; 2usize],
    pub uxDummy5: UBaseType_t,
    pub pxDummy6: *mut ::std::os::raw::c_void,
    pub ucDummy7: [u8; 16usize],
    pub xDummyCoreID: BaseType_t,
    pub pxDummy8: *mut ::std::os::raw::c_void,
    pub uxDummy12: [UBaseType_t; 2usize],
    pub pvDummy15: [*mut ::std::os::raw::c_void; 2usize],
    pub ulDummy18: [u32; 1usize],
    pub ucDummy19: [u8; 1usize],
    pub uxDummy20: u8,
    pub ucDummy21: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_TCB"][::std::mem::size_of::<xSTATIC_TCB>() - 168usize];
    ["Alignment of xSTATIC_TCB"][::std::mem::align_of::<xSTATIC_TCB>() - 8usize];
    ["Offset of field: xSTATIC_TCB::pxDummy1"]
        [::std::mem::offset_of!(xSTATIC_TCB, pxDummy1) - 0usize];
    ["Offset of field: xSTATIC_TCB::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_TCB, xDummy3) - 8usize];
    ["Offset of field: xSTATIC_TCB::uxDummy5"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy5) - 88usize];
    ["Offset of field: xSTATIC_TCB::pxDummy6"]
        [::std::mem::offset_of!(xSTATIC_TCB, pxDummy6) - 96usize];
    ["Offset of field: xSTATIC_TCB::ucDummy7"]
        [::std::mem::offset_of!(xSTATIC_TCB, ucDummy7) - 104usize];
    ["Offset of field: xSTATIC_TCB::xDummyCoreID"]
        [::std::mem::offset_of!(xSTATIC_TCB, xDummyCoreID) - 120usize];
    ["Offset of field: xSTATIC_TCB::pxDummy8"]
        [::std::mem::offset_of!(xSTATIC_TCB, pxDummy8) - 128usize];
    ["Offset of field: xSTATIC_TCB::uxDummy12"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy12) - 136usize];
    ["Offset of field: xSTATIC_TCB::pvDummy15"]
        [::std::mem::offset_of!(xSTATIC_TCB, pvDummy15) - 144usize];
    ["Offset of field: xSTATIC_TCB::ulDummy18"]
        [::std::mem::offset_of!(xSTATIC_TCB, ulDummy18) - 160usize];
    ["Offset of field: xSTATIC_TCB::ucDummy19"]
        [::std::mem::offset_of!(xSTATIC_TCB, ucDummy19) - 164usize];
    ["Offset of field: xSTATIC_TCB::uxDummy20"]
        [::std::mem::offset_of!(xSTATIC_TCB, uxDummy20) - 165usize];
    ["Offset of field: xSTATIC_TCB::ucDummy21"]
        [::std::mem::offset_of!(xSTATIC_TCB, ucDummy21) - 166usize];
};
pub type StaticTask_t = xSTATIC_TCB;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xSTATIC_QUEUE {
    pub pvDummy1: [*mut ::std::os::raw::c_void; 3usize],
    pub u: xSTATIC_QUEUE__bindgen_ty_1,
    pub xDummy3: [StaticList_t; 2usize],
    pub uxDummy4: [UBaseType_t; 3usize],
    pub ucDummy5: [u8; 2usize],
    pub ucDummy6: u8,
    pub pvDummy7: *mut ::std::os::raw::c_void,
    pub xDummyQueueLock: portMUX_TYPE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xSTATIC_QUEUE__bindgen_ty_1 {
    pub pvDummy2: *mut ::std::os::raw::c_void,
    pub uxDummy2: UBaseType_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_QUEUE__bindgen_ty_1"]
        [::std::mem::size_of::<xSTATIC_QUEUE__bindgen_ty_1>() - 8usize];
    ["Alignment of xSTATIC_QUEUE__bindgen_ty_1"]
        [::std::mem::align_of::<xSTATIC_QUEUE__bindgen_ty_1>() - 8usize];
    ["Offset of field: xSTATIC_QUEUE__bindgen_ty_1::pvDummy2"]
        [::std::mem::offset_of!(xSTATIC_QUEUE__bindgen_ty_1, pvDummy2) - 0usize];
    ["Offset of field: xSTATIC_QUEUE__bindgen_ty_1::uxDummy2"]
        [::std::mem::offset_of!(xSTATIC_QUEUE__bindgen_ty_1, uxDummy2) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_QUEUE"][::std::mem::size_of::<xSTATIC_QUEUE>() - 144usize];
    ["Alignment of xSTATIC_QUEUE"][::std::mem::align_of::<xSTATIC_QUEUE>() - 8usize];
    ["Offset of field: xSTATIC_QUEUE::pvDummy1"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, pvDummy1) - 0usize];
    ["Offset of field: xSTATIC_QUEUE::u"][::std::mem::offset_of!(xSTATIC_QUEUE, u) - 24usize];
    ["Offset of field: xSTATIC_QUEUE::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, xDummy3) - 32usize];
    ["Offset of field: xSTATIC_QUEUE::uxDummy4"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, uxDummy4) - 112usize];
    ["Offset of field: xSTATIC_QUEUE::ucDummy5"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, ucDummy5) - 124usize];
    ["Offset of field: xSTATIC_QUEUE::ucDummy6"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, ucDummy6) - 126usize];
    ["Offset of field: xSTATIC_QUEUE::pvDummy7"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, pvDummy7) - 128usize];
    ["Offset of field: xSTATIC_QUEUE::xDummyQueueLock"]
        [::std::mem::offset_of!(xSTATIC_QUEUE, xDummyQueueLock) - 136usize];
};
pub type StaticQueue_t = xSTATIC_QUEUE;
pub type StaticSemaphore_t = StaticQueue_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_EVENT_GROUP {
    pub xDummy1: TickType_t,
    pub xDummy2: StaticList_t,
    pub ucDummy4: u8,
    pub xDummyEventGroupLock: portMUX_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_EVENT_GROUP"][::std::mem::size_of::<xSTATIC_EVENT_GROUP>() - 64usize];
    ["Alignment of xSTATIC_EVENT_GROUP"][::std::mem::align_of::<xSTATIC_EVENT_GROUP>() - 8usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::xDummy1"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, xDummy1) - 0usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, xDummy2) - 8usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::ucDummy4"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, ucDummy4) - 48usize];
    ["Offset of field: xSTATIC_EVENT_GROUP::xDummyEventGroupLock"]
        [::std::mem::offset_of!(xSTATIC_EVENT_GROUP, xDummyEventGroupLock) - 52usize];
};
pub type StaticEventGroup_t = xSTATIC_EVENT_GROUP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TIMER {
    pub pvDummy1: *mut ::std::os::raw::c_void,
    pub xDummy2: StaticListItem_t,
    pub xDummy3: TickType_t,
    pub pvDummy5: *mut ::std::os::raw::c_void,
    pub pvDummy6: TaskFunction_t,
    pub ucDummy8: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_TIMER"][::std::mem::size_of::<xSTATIC_TIMER>() - 80usize];
    ["Alignment of xSTATIC_TIMER"][::std::mem::align_of::<xSTATIC_TIMER>() - 8usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy1"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy1) - 0usize];
    ["Offset of field: xSTATIC_TIMER::xDummy2"]
        [::std::mem::offset_of!(xSTATIC_TIMER, xDummy2) - 8usize];
    ["Offset of field: xSTATIC_TIMER::xDummy3"]
        [::std::mem::offset_of!(xSTATIC_TIMER, xDummy3) - 48usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy5"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy5) - 56usize];
    ["Offset of field: xSTATIC_TIMER::pvDummy6"]
        [::std::mem::offset_of!(xSTATIC_TIMER, pvDummy6) - 64usize];
    ["Offset of field: xSTATIC_TIMER::ucDummy8"]
        [::std::mem::offset_of!(xSTATIC_TIMER, ucDummy8) - 72usize];
};
pub type StaticTimer_t = xSTATIC_TIMER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_STREAM_BUFFER {
    pub uxDummy1: [usize; 4usize],
    pub pvDummy2: [*mut ::std::os::raw::c_void; 3usize],
    pub ucDummy3: u8,
    pub xDummyStreamBufferLock: portMUX_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xSTATIC_STREAM_BUFFER"][::std::mem::size_of::<xSTATIC_STREAM_BUFFER>() - 72usize];
    ["Alignment of xSTATIC_STREAM_BUFFER"]
        [::std::mem::align_of::<xSTATIC_STREAM_BUFFER>() - 8usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::uxDummy1"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, uxDummy1) - 0usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::pvDummy2"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, pvDummy2) - 32usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::ucDummy3"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, ucDummy3) - 56usize];
    ["Offset of field: xSTATIC_STREAM_BUFFER::xDummyStreamBufferLock"]
        [::std::mem::offset_of!(xSTATIC_STREAM_BUFFER, xDummyStreamBufferLock) - 60usize];
};
pub type StaticStreamBuffer_t = xSTATIC_STREAM_BUFFER;
pub type StaticMessageBuffer_t = StaticStreamBuffer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
    pub pvOwner: *mut ::std::os::raw::c_void,
    pub pxContainer: *mut xLIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xLIST_ITEM"][::std::mem::size_of::<xLIST_ITEM>() - 40usize];
    ["Alignment of xLIST_ITEM"][::std::mem::align_of::<xLIST_ITEM>() - 8usize];
    ["Offset of field: xLIST_ITEM::xItemValue"]
        [::std::mem::offset_of!(xLIST_ITEM, xItemValue) - 0usize];
    ["Offset of field: xLIST_ITEM::pxNext"][::std::mem::offset_of!(xLIST_ITEM, pxNext) - 8usize];
    ["Offset of field: xLIST_ITEM::pxPrevious"]
        [::std::mem::offset_of!(xLIST_ITEM, pxPrevious) - 16usize];
    ["Offset of field: xLIST_ITEM::pvOwner"][::std::mem::offset_of!(xLIST_ITEM, pvOwner) - 24usize];
    ["Offset of field: xLIST_ITEM::pxContainer"]
        [::std::mem::offset_of!(xLIST_ITEM, pxContainer) - 32usize];
};
pub type ListItem_t = xLIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMINI_LIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xMINI_LIST_ITEM"][::std::mem::size_of::<xMINI_LIST_ITEM>() - 24usize];
    ["Alignment of xMINI_LIST_ITEM"][::std::mem::align_of::<xMINI_LIST_ITEM>() - 8usize];
    ["Offset of field: xMINI_LIST_ITEM::xItemValue"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, xItemValue) - 0usize];
    ["Offset of field: xMINI_LIST_ITEM::pxNext"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, pxNext) - 8usize];
    ["Offset of field: xMINI_LIST_ITEM::pxPrevious"]
        [::std::mem::offset_of!(xMINI_LIST_ITEM, pxPrevious) - 16usize];
};
pub type MiniListItem_t = xMINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST {
    pub uxNumberOfItems: UBaseType_t,
    pub pxIndex: *mut ListItem_t,
    pub xListEnd: MiniListItem_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xLIST"][::std::mem::size_of::<xLIST>() - 40usize];
    ["Alignment of xLIST"][::std::mem::align_of::<xLIST>() - 8usize];
    ["Offset of field: xLIST::uxNumberOfItems"]
        [::std::mem::offset_of!(xLIST, uxNumberOfItems) - 0usize];
    ["Offset of field: xLIST::pxIndex"][::std::mem::offset_of!(xLIST, pxIndex) - 8usize];
    ["Offset of field: xLIST::xListEnd"][::std::mem::offset_of!(xLIST, xListEnd) - 16usize];
};
pub type List_t = xLIST;
unsafe extern "C" {
    pub fn vListInitialise(pxList: *mut List_t);
}
unsafe extern "C" {
    pub fn vListInitialiseItem(pxItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn vListInsert(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn vListInsertEnd(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
unsafe extern "C" {
    pub fn uxListRemove(pxItemToRemove: *mut ListItem_t) -> UBaseType_t;
}
#[doc = " Type by which tasks are referenced.  For example, a call to xTaskCreate\n returns (via a pointer parameter) an TaskHandle_t variable that can then\n be used as a parameter to vTaskDelete to delete the task.\n\n \\ingroup Tasks"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tskTaskControlBlock {
    _unused: [u8; 0],
}
pub type TaskHandle_t = *mut tskTaskControlBlock;
#[doc = " Defines the prototype to which the application task hook function must\n conform."]
pub type TaskHookFunction_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> BaseType_t>;
#[doc = "< A task is querying the state of itself, so must be running."]
pub const eTaskState_eRunning: eTaskState = 0;
#[doc = "< The task being queried is in a ready or pending ready list."]
pub const eTaskState_eReady: eTaskState = 1;
#[doc = "< The task being queried is in the Blocked state."]
pub const eTaskState_eBlocked: eTaskState = 2;
#[doc = "< The task being queried is in the Suspended state, or is in the Blocked state with an infinite time out."]
pub const eTaskState_eSuspended: eTaskState = 3;
#[doc = "< The task being queried has been deleted, but its TCB has not yet been freed."]
pub const eTaskState_eDeleted: eTaskState = 4;
#[doc = "< Used as an 'invalid state' value."]
pub const eTaskState_eInvalid: eTaskState = 5;
#[doc = " Task states returned by eTaskGetState."]
pub type eTaskState = ::std::os::raw::c_uint;
#[doc = "< Notify the task without updating its notify value."]
pub const eNotifyAction_eNoAction: eNotifyAction = 0;
#[doc = "< Set bits in the task's notification value."]
pub const eNotifyAction_eSetBits: eNotifyAction = 1;
#[doc = "< Increment the task's notification value."]
pub const eNotifyAction_eIncrement: eNotifyAction = 2;
#[doc = "< Set the task's notification value to a specific value even if the previous value has not yet been read by the task."]
pub const eNotifyAction_eSetValueWithOverwrite: eNotifyAction = 3;
#[doc = "< Set the task's notification value if the previous value has been read by the task."]
pub const eNotifyAction_eSetValueWithoutOverwrite: eNotifyAction = 4;
#[doc = " Actions that can be performed when vTaskNotify() is called."]
pub type eNotifyAction = ::std::os::raw::c_uint;
#[doc = " @cond !DOC_EXCLUDE_HEADER_SECTION"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTIME_OUT {
    pub xOverflowCount: BaseType_t,
    pub xTimeOnEntering: TickType_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTIME_OUT"][::std::mem::size_of::<xTIME_OUT>() - 8usize];
    ["Alignment of xTIME_OUT"][::std::mem::align_of::<xTIME_OUT>() - 4usize];
    ["Offset of field: xTIME_OUT::xOverflowCount"]
        [::std::mem::offset_of!(xTIME_OUT, xOverflowCount) - 0usize];
    ["Offset of field: xTIME_OUT::xTimeOnEntering"]
        [::std::mem::offset_of!(xTIME_OUT, xTimeOnEntering) - 4usize];
};
#[doc = " @cond !DOC_EXCLUDE_HEADER_SECTION"]
pub type TimeOut_t = xTIME_OUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMEMORY_REGION {
    pub pvBaseAddress: *mut ::std::os::raw::c_void,
    pub ulLengthInBytes: u32,
    pub ulParameters: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xMEMORY_REGION"][::std::mem::size_of::<xMEMORY_REGION>() - 16usize];
    ["Alignment of xMEMORY_REGION"][::std::mem::align_of::<xMEMORY_REGION>() - 8usize];
    ["Offset of field: xMEMORY_REGION::pvBaseAddress"]
        [::std::mem::offset_of!(xMEMORY_REGION, pvBaseAddress) - 0usize];
    ["Offset of field: xMEMORY_REGION::ulLengthInBytes"]
        [::std::mem::offset_of!(xMEMORY_REGION, ulLengthInBytes) - 8usize];
    ["Offset of field: xMEMORY_REGION::ulParameters"]
        [::std::mem::offset_of!(xMEMORY_REGION, ulParameters) - 12usize];
};
pub type MemoryRegion_t = xMEMORY_REGION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_PARAMETERS {
    pub pvTaskCode: TaskFunction_t,
    pub pcName: *const ::std::os::raw::c_char,
    pub usStackDepth: u32,
    pub pvParameters: *mut ::std::os::raw::c_void,
    pub uxPriority: UBaseType_t,
    pub puxStackBuffer: *mut StackType_t,
    pub xRegions: [MemoryRegion_t; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTASK_PARAMETERS"][::std::mem::size_of::<xTASK_PARAMETERS>() - 64usize];
    ["Alignment of xTASK_PARAMETERS"][::std::mem::align_of::<xTASK_PARAMETERS>() - 8usize];
    ["Offset of field: xTASK_PARAMETERS::pvTaskCode"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pvTaskCode) - 0usize];
    ["Offset of field: xTASK_PARAMETERS::pcName"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pcName) - 8usize];
    ["Offset of field: xTASK_PARAMETERS::usStackDepth"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, usStackDepth) - 16usize];
    ["Offset of field: xTASK_PARAMETERS::pvParameters"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, pvParameters) - 24usize];
    ["Offset of field: xTASK_PARAMETERS::uxPriority"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, uxPriority) - 32usize];
    ["Offset of field: xTASK_PARAMETERS::puxStackBuffer"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, puxStackBuffer) - 40usize];
    ["Offset of field: xTASK_PARAMETERS::xRegions"]
        [::std::mem::offset_of!(xTASK_PARAMETERS, xRegions) - 48usize];
};
pub type TaskParameters_t = xTASK_PARAMETERS;
#[doc = " Used with the uxTaskGetSystemState() function to return the state of each task\n in the system."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_STATUS {
    #[doc = "< The handle of the task to which the rest of the information in the structure relates."]
    pub xHandle: TaskHandle_t,
    #[doc = "< A pointer to the task's name.  This value will be invalid if the task was deleted since the structure was populated!"]
    pub pcTaskName: *const ::std::os::raw::c_char,
    #[doc = "< A number unique to the task."]
    pub xTaskNumber: UBaseType_t,
    #[doc = "< The state in which the task existed when the structure was populated."]
    pub eCurrentState: eTaskState,
    #[doc = "< The priority at which the task was running (may be inherited) when the structure was populated."]
    pub uxCurrentPriority: UBaseType_t,
    #[doc = "< The priority to which the task will return if the task's current priority has been inherited to avoid unbounded priority inversion when obtaining a mutex.  Only valid if configUSE_MUTEXES is defined as 1 in FreeRTOSConfig.h."]
    pub uxBasePriority: UBaseType_t,
    #[doc = "< The total run time allocated to the task so far, as defined by the run time stats clock.  See https://www.FreeRTOS.org/rtos-run-time-stats.html.  Only valid when configGENERATE_RUN_TIME_STATS is defined as 1 in FreeRTOSConfig.h."]
    pub ulRunTimeCounter: u32,
    #[doc = "< Points to the lowest address of the task's stack area."]
    pub pxStackBase: *mut StackType_t,
    #[doc = "< The minimum amount of stack space that has remained for the task since the task was created.  The closer this value is to zero the closer the task has come to overflowing its stack."]
    pub usStackHighWaterMark: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xTASK_STATUS"][::std::mem::size_of::<xTASK_STATUS>() - 56usize];
    ["Alignment of xTASK_STATUS"][::std::mem::align_of::<xTASK_STATUS>() - 8usize];
    ["Offset of field: xTASK_STATUS::xHandle"]
        [::std::mem::offset_of!(xTASK_STATUS, xHandle) - 0usize];
    ["Offset of field: xTASK_STATUS::pcTaskName"]
        [::std::mem::offset_of!(xTASK_STATUS, pcTaskName) - 8usize];
    ["Offset of field: xTASK_STATUS::xTaskNumber"]
        [::std::mem::offset_of!(xTASK_STATUS, xTaskNumber) - 16usize];
    ["Offset of field: xTASK_STATUS::eCurrentState"]
        [::std::mem::offset_of!(xTASK_STATUS, eCurrentState) - 20usize];
    ["Offset of field: xTASK_STATUS::uxCurrentPriority"]
        [::std::mem::offset_of!(xTASK_STATUS, uxCurrentPriority) - 24usize];
    ["Offset of field: xTASK_STATUS::uxBasePriority"]
        [::std::mem::offset_of!(xTASK_STATUS, uxBasePriority) - 28usize];
    ["Offset of field: xTASK_STATUS::ulRunTimeCounter"]
        [::std::mem::offset_of!(xTASK_STATUS, ulRunTimeCounter) - 32usize];
    ["Offset of field: xTASK_STATUS::pxStackBase"]
        [::std::mem::offset_of!(xTASK_STATUS, pxStackBase) - 40usize];
    ["Offset of field: xTASK_STATUS::usStackHighWaterMark"]
        [::std::mem::offset_of!(xTASK_STATUS, usStackHighWaterMark) - 48usize];
};
#[doc = " Used with the uxTaskGetSystemState() function to return the state of each task\n in the system."]
pub type TaskStatus_t = xTASK_STATUS;
#[doc = "< A task has been made ready or a context switch pended since portSUPPRESS_TICKS_AND_SLEEP() was called - abort entering a sleep mode."]
pub const eSleepModeStatus_eAbortSleep: eSleepModeStatus = 0;
#[doc = "< Enter a sleep mode that will not last any longer than the expected idle time."]
pub const eSleepModeStatus_eStandardSleep: eSleepModeStatus = 1;
#[doc = "< No tasks are waiting for a timeout so it is safe to enter a sleep mode that can only be exited by an external interrupt."]
pub const eSleepModeStatus_eNoTasksWaitingTimeout: eSleepModeStatus = 2;
#[doc = " Possible return values for eTaskConfirmSleepModeStatus()."]
pub type eSleepModeStatus = ::std::os::raw::c_uint;
unsafe extern "C" {
    #[doc = " Memory regions are assigned to a restricted task when the task is created by\n a call to xTaskCreateRestricted().  These regions can be redefined using\n vTaskAllocateMPURegions().\n\n @param xTask The handle of the task being updated.\n\n @param pxRegions A pointer to a MemoryRegion_t structure that contains the\n new memory region definitions.\n\n Example usage:\n @code{c}\n // Define an array of MemoryRegion_t structures that configures an MPU region\n // allowing read/write access for 1024 bytes starting at the beginning of the\n // ucOneKByte array.  The other two of the maximum 3 definable regions are\n // unused so set to zero.\n static const MemoryRegion_t xAltRegions[ portNUM_CONFIGURABLE_REGIONS ] =\n {\n  // Base address     Length      Parameters\n  { ucOneKByte,       1024,       portMPU_REGION_READ_WRITE },\n  { 0,                0,          0 },\n  { 0,                0,          0 }\n };\n\n void vATask( void *pvParameters )\n {\n  // This task was created such that it has access to certain regions of\n  // memory as defined by the MPU configuration.  At some point it is\n  // desired that these MPU regions are replaced with that defined in the\n  // xAltRegions const struct above.  Use a call to vTaskAllocateMPURegions()\n  // for this purpose.  NULL is used as the task handle to indicate that this\n  // function should modify the MPU regions of the calling task.\n  vTaskAllocateMPURegions( NULL, xAltRegions );\n\n  // Now the task can continue its function, but from this point on can only\n  // access its stack and the ucOneKByte array (unless any other statically\n  // defined or shared regions have been declared elsewhere).\n }\n @endcode\n \\ingroup Tasks"]
    pub fn vTaskAllocateMPURegions(xTask: TaskHandle_t, pxRegions: *const MemoryRegion_t);
}
unsafe extern "C" {
    #[doc = " INCLUDE_vTaskDelete must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Remove a task from the RTOS real time kernel's management.  The task being\n deleted will be removed from all ready, blocked, suspended and event lists.\n\n NOTE:  The idle task is responsible for freeing the kernel allocated\n memory from tasks that have been deleted.  It is therefore important that\n the idle task is not starved of microcontroller processing time if your\n application makes any calls to vTaskDelete ().  Memory allocated by the\n task code is not automatically freed, and should be freed before the task\n is deleted.\n\n See the demo application file death.c for sample code that utilises\n vTaskDelete ().\n\n @param xTaskToDelete The handle of the task to be deleted.  Passing NULL will\n cause the calling task to be deleted.\n\n Example usage:\n @code{c}\n void vOtherFunction( void )\n {\n TaskHandle_t xHandle;\n\n   // Create the task, storing the handle.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );\n\n   // Use the handle to delete the task.\n   vTaskDelete( xHandle );\n }\n @endcode\n \\ingroup Tasks"]
    pub fn vTaskDelete(xTaskToDelete: TaskHandle_t);
}
unsafe extern "C" {
    #[doc = " Delay a task for a given number of ticks.  The actual time that the\n task remains blocked depends on the tick rate.  The constant\n portTICK_PERIOD_MS can be used to calculate real time from the tick\n rate - with the resolution of one tick period.\n\n INCLUDE_vTaskDelay must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n\n vTaskDelay() specifies a time at which the task wishes to unblock relative to\n the time at which vTaskDelay() is called.  For example, specifying a block\n period of 100 ticks will cause the task to unblock 100 ticks after\n vTaskDelay() is called.  vTaskDelay() does not therefore provide a good method\n of controlling the frequency of a periodic task as the path taken through the\n code, as well as other task and interrupt activity, will affect the frequency\n at which vTaskDelay() gets called and therefore the time at which the task\n next executes.  See xTaskDelayUntil() for an alternative API function designed\n to facilitate fixed frequency execution.  It does this by specifying an\n absolute time (rather than a relative time) at which the calling task should\n unblock.\n\n @param xTicksToDelay The amount of time, in tick periods, that\n the calling task should block.\n\n Example usage:\n @code{c}\n void vTaskFunction( void * pvParameters )\n {\n // Block for 500ms.\n const TickType_t xDelay = 500 / portTICK_PERIOD_MS;\n\n   for( ;; )\n   {\n       // Simply toggle the LED every 500ms, blocking between each toggle.\n       vToggleLED();\n       vTaskDelay( xDelay );\n   }\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn vTaskDelay(xTicksToDelay: TickType_t);
}
unsafe extern "C" {
    #[doc = " INCLUDE_xTaskDelayUntil must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Delay a task until a specified time.  This function can be used by periodic\n tasks to ensure a constant execution frequency.\n\n This function differs from vTaskDelay () in one important aspect:  vTaskDelay () will\n cause a task to block for the specified number of ticks from the time vTaskDelay () is\n called.  It is therefore difficult to use vTaskDelay () by itself to generate a fixed\n execution frequency as the time between a task starting to execute and that task\n calling vTaskDelay () may not be fixed [the task may take a different path though the\n code between calls, or may get interrupted or preempted a different number of times\n each time it executes].\n\n Whereas vTaskDelay () specifies a wake time relative to the time at which the function\n is called, xTaskDelayUntil () specifies the absolute (exact) time at which it wishes to\n unblock.\n\n The macro pdMS_TO_TICKS() can be used to calculate the number of ticks from a\n time specified in milliseconds with a resolution of one tick period.\n\n @param pxPreviousWakeTime Pointer to a variable that holds the time at which the\n task was last unblocked.  The variable must be initialised with the current time\n prior to its first use (see the example below).  Following this the variable is\n automatically updated within xTaskDelayUntil ().\n\n @param xTimeIncrement The cycle time period.  The task will be unblocked at\n time *pxPreviousWakeTime + xTimeIncrement.  Calling xTaskDelayUntil with the\n same xTimeIncrement parameter value will cause the task to execute with\n a fixed interface period.\n\n @return Value which can be used to check whether the task was actually delayed.\n Will be pdTRUE if the task way delayed and pdFALSE otherwise.  A task will not\n be delayed if the next expected wake time is in the past.\n\n Example usage:\n @code{c}\n // Perform an action every 10 ticks.\n void vTaskFunction( void * pvParameters )\n {\n TickType_t xLastWakeTime;\n const TickType_t xFrequency = 10;\n BaseType_t xWasDelayed;\n\n     // Initialise the xLastWakeTime variable with the current time.\n     xLastWakeTime = xTaskGetTickCount ();\n     for( ;; )\n     {\n         // Wait for the next cycle.\n         xWasDelayed = xTaskDelayUntil( &xLastWakeTime, xFrequency );\n\n         // Perform action here. xWasDelayed value can be used to determine\n         // whether a deadline was missed if the code here took too long.\n     }\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn xTaskDelayUntil(
        pxPreviousWakeTime: *mut TickType_t,
        xTimeIncrement: TickType_t,
    ) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " INCLUDE_xTaskAbortDelay must be defined as 1 in FreeRTOSConfig.h for this\n function to be available.\n\n A task will enter the Blocked state when it is waiting for an event.  The\n event it is waiting for can be a temporal event (waiting for a time), such\n as when vTaskDelay() is called, or an event on an object, such as when\n xQueueReceive() or ulTaskNotifyTake() is called.  If the handle of a task\n that is in the Blocked state is used in a call to xTaskAbortDelay() then the\n task will leave the Blocked state, and return from whichever function call\n placed the task into the Blocked state.\n\n There is no 'FromISR' version of this function as an interrupt would need to\n know which object a task was blocked on in order to know which actions to\n take.  For example, if the task was blocked on a queue the interrupt handler\n would then need to know if the queue was locked.\n\n @param xTask The handle of the task to remove from the Blocked state.\n\n @return If the task referenced by xTask was not in the Blocked state then\n pdFAIL is returned.  Otherwise pdPASS is returned.\n\n \\ingroup TaskCtrl"]
    pub fn xTaskAbortDelay(xTask: TaskHandle_t) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " INCLUDE_uxTaskPriorityGet must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Obtain the priority of any task.\n\n @param xTask Handle of the task to be queried.  Passing a NULL\n handle results in the priority of the calling task being returned.\n\n @return The priority of xTask.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n TaskHandle_t xHandle;\n\n   // Create a task, storing the handle.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );\n\n   // ...\n\n   // Use the handle to obtain the priority of the created task.\n   // It was created with tskIDLE_PRIORITY, but may have changed\n   // it itself.\n   if( uxTaskPriorityGet( xHandle ) != tskIDLE_PRIORITY )\n   {\n       // The task has changed it's priority.\n   }\n\n   // ...\n\n   // Is our priority higher than the created task?\n   if( uxTaskPriorityGet( xHandle ) < uxTaskPriorityGet( NULL ) )\n   {\n       // Our priority (obtained using NULL handle) is higher.\n   }\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn uxTaskPriorityGet(xTask: TaskHandle_t) -> UBaseType_t;
}
unsafe extern "C" {
    #[doc = " A version of uxTaskPriorityGet() that can be used from an ISR."]
    pub fn uxTaskPriorityGetFromISR(xTask: TaskHandle_t) -> UBaseType_t;
}
unsafe extern "C" {
    #[doc = " INCLUDE_eTaskGetState must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Obtain the state of any task.  States are encoded by the eTaskState\n enumerated type.\n\n @param xTask Handle of the task to be queried.\n\n @return The state of xTask at the time the function was called.  Note the\n state of the task might change between the function being called, and the\n functions return value being tested by the calling task."]
    pub fn eTaskGetState(xTask: TaskHandle_t) -> eTaskState;
}
unsafe extern "C" {
    #[doc = " configUSE_TRACE_FACILITY must be defined as 1 for this function to be\n available.  See the configuration section for more information.\n\n Populates a TaskStatus_t structure with information about a task.\n\n @param xTask Handle of the task being queried.  If xTask is NULL then\n information will be returned about the calling task.\n\n @param pxTaskStatus A pointer to the TaskStatus_t structure that will be\n filled with information about the task referenced by the handle passed using\n the xTask parameter.\n\n @param xGetFreeStackSpace The TaskStatus_t structure contains a member to report\n the stack high water mark of the task being queried.  Calculating the stack\n high water mark takes a relatively long time, and can make the system\n temporarily unresponsive - so the xGetFreeStackSpace parameter is provided to\n allow the high water mark checking to be skipped.  The high watermark value\n will only be written to the TaskStatus_t structure if xGetFreeStackSpace is\n not set to pdFALSE;\n\n @param eState The TaskStatus_t structure contains a member to report the\n state of the task being queried.  Obtaining the task state is not as fast as\n a simple assignment - so the eState parameter is provided to allow the state\n information to be omitted from the TaskStatus_t structure.  To obtain state\n information then set eState to eInvalid - otherwise the value passed in\n eState will be reported as the task state in the TaskStatus_t structure.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n TaskHandle_t xHandle;\n TaskStatus_t xTaskDetails;\n\n  // Obtain the handle of a task from its name.\n  xHandle = xTaskGetHandle( \"Task_Name\" );\n\n  // Check the handle is not NULL.\n  configASSERT( xHandle );\n\n  // Use the handle to obtain further information about the task.\n  vTaskGetInfo( xHandle,\n                &xTaskDetails,\n                pdTRUE, // Include the high water mark in xTaskDetails.\n                eInvalid ); // Include the task state in xTaskDetails.\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn vTaskGetInfo(
        xTask: TaskHandle_t,
        pxTaskStatus: *mut TaskStatus_t,
        xGetFreeStackSpace: BaseType_t,
        eState: eTaskState,
    );
}
unsafe extern "C" {
    #[doc = " INCLUDE_vTaskPrioritySet must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Set the priority of any task.\n\n A context switch will occur before the function returns if the priority\n being set is higher than the currently executing task.\n\n @param xTask Handle to the task for which the priority is being set.\n Passing a NULL handle results in the priority of the calling task being set.\n\n @param uxNewPriority The priority to which the task will be set.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n TaskHandle_t xHandle;\n\n   // Create a task, storing the handle.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );\n\n   // ...\n\n   // Use the handle to raise the priority of the created task.\n   vTaskPrioritySet( xHandle, tskIDLE_PRIORITY + 1 );\n\n   // ...\n\n   // Use a NULL handle to raise our priority to the same value.\n   vTaskPrioritySet( NULL, tskIDLE_PRIORITY + 1 );\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn vTaskPrioritySet(xTask: TaskHandle_t, uxNewPriority: UBaseType_t);
}
unsafe extern "C" {
    #[doc = " INCLUDE_vTaskSuspend must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Suspend any task.  When suspended a task will never get any microcontroller\n processing time, no matter what its priority.\n\n Calls to vTaskSuspend are not accumulative -\n i.e. calling vTaskSuspend () twice on the same task still only requires one\n call to vTaskResume () to ready the suspended task.\n\n @param xTaskToSuspend Handle to the task being suspended.  Passing a NULL\n handle will cause the calling task to be suspended.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n TaskHandle_t xHandle;\n\n   // Create a task, storing the handle.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );\n\n   // ...\n\n   // Use the handle to suspend the created task.\n   vTaskSuspend( xHandle );\n\n   // ...\n\n   // The created task will not run during this period, unless\n   // another task calls vTaskResume( xHandle ).\n\n   //...\n\n\n   // Suspend ourselves.\n   vTaskSuspend( NULL );\n\n   // We cannot get here unless another task calls vTaskResume\n   // with our handle as the parameter.\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn vTaskSuspend(xTaskToSuspend: TaskHandle_t);
}
unsafe extern "C" {
    #[doc = " INCLUDE_vTaskSuspend must be defined as 1 for this function to be available.\n See the configuration section for more information.\n\n Resumes a suspended task.\n\n A task that has been suspended by one or more calls to vTaskSuspend ()\n will be made available for running again by a single call to\n vTaskResume ().\n\n @param xTaskToResume Handle to the task being readied.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n TaskHandle_t xHandle;\n\n   // Create a task, storing the handle.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );\n\n   // ...\n\n   // Use the handle to suspend the created task.\n   vTaskSuspend( xHandle );\n\n   // ...\n\n   // The created task will not run during this period, unless\n   // another task calls vTaskResume( xHandle ).\n\n   //...\n\n\n   // Resume the suspended task ourselves.\n   vTaskResume( xHandle );\n\n   // The created task will once again get microcontroller processing\n   // time in accordance with its priority within the system.\n }\n @endcode\n \\ingroup TaskCtrl"]
    pub fn vTaskResume(xTaskToResume: TaskHandle_t);
}
unsafe extern "C" {
    #[doc = " INCLUDE_xTaskResumeFromISR must be defined as 1 for this function to be\n available.  See the configuration section for more information.\n\n An implementation of vTaskResume() that can be called from within an ISR.\n\n A task that has been suspended by one or more calls to vTaskSuspend ()\n will be made available for running again by a single call to\n xTaskResumeFromISR ().\n\n xTaskResumeFromISR() should not be used to synchronise a task with an\n interrupt if there is a chance that the interrupt could arrive prior to the\n task being suspended - as this can lead to interrupts being missed. Use of a\n semaphore as a synchronisation mechanism would avoid this eventuality.\n\n @param xTaskToResume Handle to the task being readied.\n\n @return pdTRUE if resuming the task should result in a context switch,\n otherwise pdFALSE. This is used by the ISR to determine if a context switch\n may be required following the ISR.\n\n \\ingroup TaskCtrl"]
    pub fn xTaskResumeFromISR(xTaskToResume: TaskHandle_t) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " Starts the real time kernel tick processing.  After calling the kernel\n has control over which tasks are executed and when.\n\n See the demo application file main.c for an example of creating\n tasks and starting the kernel.\n\n Example usage:\n @code{c}\n void vAFunction( void )\n {\n   // Create at least one task before starting the kernel.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );\n\n   // Start the real time kernel with preemption.\n   vTaskStartScheduler ();\n\n   // Will not get here unless a task calls vTaskEndScheduler ()\n }\n @endcode\n\n \\ingroup SchedulerControl"]
    pub fn vTaskStartScheduler();
}
unsafe extern "C" {
    #[doc = " NOTE:  At the time of writing only the x86 real mode port, which runs on a PC\n in place of DOS, implements this function.\n\n Stops the real time kernel tick.  All created tasks will be automatically\n deleted and multitasking (either preemptive or cooperative) will\n stop.  Execution then resumes from the point where vTaskStartScheduler ()\n was called, as if vTaskStartScheduler () had just returned.\n\n See the demo application file main. c in the demo/PC directory for an\n example that uses vTaskEndScheduler ().\n\n vTaskEndScheduler () requires an exit function to be defined within the\n portable layer (see vPortEndScheduler () in port. c for the PC port).  This\n performs hardware specific operations such as stopping the kernel tick.\n\n vTaskEndScheduler () will cause all of the resources allocated by the\n kernel to be freed - but will not free resources allocated by application\n tasks.\n\n Example usage:\n @code{c}\n void vTaskCode( void * pvParameters )\n {\n   for( ;; )\n   {\n       // Task code goes here.\n\n       // At some point we want to end the real time kernel processing\n       // so call ...\n       vTaskEndScheduler ();\n   }\n }\n\n void vAFunction( void )\n {\n   // Create at least one task before starting the kernel.\n   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );\n\n   // Start the real time kernel with preemption.\n   vTaskStartScheduler ();\n\n   // Will only get here when the vTaskCode () task has called\n   // vTaskEndScheduler ().  When we get here we are back to single task\n   // execution.\n }\n @endcode\n\n \\ingroup SchedulerControl"]
    pub fn vTaskEndScheduler();
}
unsafe extern "C" {
    #[doc = " Suspends the scheduler without disabling interrupts.  Context switches will\n not occur while the scheduler is suspended.\n\n After calling vTaskSuspendAll () the calling task will continue to execute\n without risk of being swapped out until a call to xTaskResumeAll () has been\n made.\n\n API functions that have the potential to cause a context switch (for example,\n xTaskDelayUntil(), xQueueSend(), etc.) must not be called while the scheduler\n is suspended.\n\n Example usage:\n @code{c}\n void vTask1( void * pvParameters )\n {\n   for( ;; )\n   {\n       // Task code goes here.\n\n       // ...\n\n       // At some point the task wants to perform a long operation during\n       // which it does not want to get swapped out.  It cannot use\n       // taskENTER_CRITICAL ()/taskEXIT_CRITICAL () as the length of the\n       // operation may cause interrupts to be missed - including the\n       // ticks.\n\n       // Prevent the real time kernel swapping out the task.\n       vTaskSuspendAll ();\n\n       // Perform the operation here.  There is no need to use critical\n       // sections as we have all the microcontroller processing time.\n       // During this time interrupts will still operate and the kernel\n       // tick count will be maintained.\n\n       // ...\n\n       // The operation is complete.  Restart the kernel.\n       xTaskResumeAll ();\n   }\n }\n @endcode\n \\ingroup SchedulerControl"]
    pub fn vTaskSuspendAll();
}
unsafe extern "C" {
    #[doc = " Resumes scheduler activity after it was suspended by a call to\n vTaskSuspendAll().\n\n xTaskResumeAll() only resumes the scheduler.  It does not unsuspend tasks\n that were previously suspended by a call to vTaskSuspend().\n\n @return If resuming the scheduler caused a context switch then pdTRUE is\n         returned, otherwise pdFALSE is returned.\n\n Example usage:\n @code{c}\n void vTask1( void * pvParameters )\n {\n   for( ;; )\n   {\n       // Task code goes here.\n\n       // ...\n\n       // At some point the task wants to perform a long operation during\n       // which it does not want to get swapped out.  It cannot use\n       // taskENTER_CRITICAL ()/taskEXIT_CRITICAL () as the length of the\n       // operation may cause interrupts to be missed - including the\n       // ticks.\n\n       // Prevent the real time kernel swapping out the task.\n       vTaskSuspendAll ();\n\n       // Perform the operation here.  There is no need to use critical\n       // sections as we have all the microcontroller processing time.\n       // During this time interrupts will still operate and the real\n       // time kernel tick count will be maintained.\n\n       // ...\n\n       // The operation is complete.  Restart the kernel.  We want to force\n       // a context switch - but there is no point if resuming the scheduler\n       // caused a context switch already.\n       if( !xTaskResumeAll () )\n       {\n            taskYIELD ();\n       }\n   }\n }\n @endcode\n \\ingroup SchedulerControl"]
    pub fn xTaskResumeAll() -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " @return The count of ticks since vTaskStartScheduler was called.\n\n \\ingroup TaskUtils"]
    pub fn xTaskGetTickCount() -> TickType_t;
}
unsafe extern "C" {
    #[doc = " @return The count of ticks since vTaskStartScheduler was called.\n\n This is a version of xTaskGetTickCount() that is safe to be called from an\n ISR - provided that TickType_t is the natural word size of the\n microcontroller being used or interrupt nesting is either not supported or\n not being used.\n\n \\ingroup TaskUtils"]
    pub fn xTaskGetTickCountFromISR() -> TickType_t;
}
unsafe extern "C" {
    #[doc = " @return The number of tasks that the real time kernel is currently managing.\n This includes all ready, blocked and suspended tasks.  A task that\n has been deleted but not yet freed by the idle task will also be\n included in the count.\n\n \\ingroup TaskUtils"]
    pub fn uxTaskGetNumberOfTasks() -> UBaseType_t;
}
unsafe extern "C" {
    #[doc = " @return The text (human readable) name of the task referenced by the handle\n xTaskToQuery.  A task can query its own name by either passing in its own\n handle, or by setting xTaskToQuery to NULL.\n\n \\ingroup TaskUtils"]
    pub fn pcTaskGetName(xTaskToQuery: TaskHandle_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " NOTE:  This function takes a relatively long time to complete and should be\n used sparingly.\n\n @return The handle of the task that has the human readable name pcNameToQuery.\n NULL is returned if no matching name is found.  INCLUDE_xTaskGetHandle\n must be set to 1 in FreeRTOSConfig.h for pcTaskGetHandle() to be available.\n\n \\ingroup TaskUtils"]
    pub fn xTaskGetHandle(pcNameToQuery: *const ::std::os::raw::c_char) -> TaskHandle_t;
}
unsafe extern "C" {
    pub fn xTaskGetStaticBuffers(
        xTask: TaskHandle_t,
        ppuxStackBuffer: *mut *mut StackType_t,
        ppxTaskBuffer: *mut *mut StaticTask_t,
    ) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " INCLUDE_uxTaskGetStackHighWaterMark must be set to 1 in FreeRTOSConfig.h for\n this function to be available.\n\n Returns the high water mark of the stack associated with xTask.  That is,\n the minimum free stack space there has been (in words, so on a 32 bit machine\n a value of 1 means 4 bytes) since the task started.  The smaller the returned\n number the closer the task has come to overflowing its stack.\n\n uxTaskGetStackHighWaterMark() and uxTaskGetStackHighWaterMark2() are the\n same except for their return type.  Using configSTACK_DEPTH_TYPE allows the\n user to determine the return type.  It gets around the problem of the value\n overflowing on 8-bit types without breaking backward compatibility for\n applications that expect an 8-bit return type.\n\n @param xTask Handle of the task associated with the stack to be checked.\n Set xTask to NULL to check the stack of the calling task.\n\n @return The smallest amount of free stack space there has been (in words, so\n actual spaces on the stack rather than bytes) since the task referenced by\n xTask was created."]
    pub fn uxTaskGetStackHighWaterMark(xTask: TaskHandle_t) -> UBaseType_t;
}
unsafe extern "C" {
    #[doc = " INCLUDE_uxTaskGetStackHighWaterMark2 must be set to 1 in FreeRTOSConfig.h for\n this function to be available.\n\n Returns the high water mark of the stack associated with xTask.  That is,\n the minimum free stack space there has been (in words, so on a 32 bit machine\n a value of 1 means 4 bytes) since the task started.  The smaller the returned\n number the closer the task has come to overflowing its stack.\n\n uxTaskGetStackHighWaterMark() and uxTaskGetStackHighWaterMark2() are the\n same except for their return type.  Using configSTACK_DEPTH_TYPE allows the\n user to determine the return type.  It gets around the problem of the value\n overflowing on 8-bit types without breaking backward compatibility for\n applications that expect an 8-bit return type.\n\n @param xTask Handle of the task associated with the stack to be checked.\n Set xTask to NULL to check the stack of the calling task.\n\n @return The smallest amount of free stack space there has been (in words, so\n actual spaces on the stack rather than bytes) since the task referenced by\n xTask was created."]
    pub fn uxTaskGetStackHighWaterMark2(xTask: TaskHandle_t) -> u32;
}
unsafe extern "C" {
    #[doc = " Each task contains an array of pointers that is dimensioned by the\n configNUM_THREAD_LOCAL_STORAGE_POINTERS setting in FreeRTOSConfig.h.  The\n kernel does not use the pointers itself, so the application writer can use\n the pointers for any purpose they wish.  The following two functions are\n used to set and query a pointer respectively."]
    pub fn vTaskSetThreadLocalStoragePointer(
        xTaskToSet: TaskHandle_t,
        xIndex: BaseType_t,
        pvValue: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn pvTaskGetThreadLocalStoragePointer(
        xTaskToQuery: TaskHandle_t,
        xIndex: BaseType_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " The application stack overflow hook is called when a stack overflow is detected for a task.\n\n Details on stack overflow detection can be found here: https://www.FreeRTOS.org/Stacks-and-stack-overflow-checking.html\n\n @param xTask the task that just exceeded its stack boundaries.\n @param pcTaskName A character string containing the name of the offending task."]
    pub fn vApplicationStackOverflowHook(
        xTask: TaskHandle_t,
        pcTaskName: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    #[doc = " This function is used to provide a statically allocated block of memory to FreeRTOS to hold the Idle Task TCB.  This function is required when\n configSUPPORT_STATIC_ALLOCATION is set.  For more information see this URI: https://www.FreeRTOS.org/a00110.html#configSUPPORT_STATIC_ALLOCATION\n\n @param ppxIdleTaskTCBBuffer A handle to a statically allocated TCB buffer\n @param ppxIdleTaskStackBuffer A handle to a statically allocated Stack buffer for the idle task\n @param pulIdleTaskStackSize A pointer to the number of elements that will fit in the allocated stack buffer"]
    pub fn vApplicationGetIdleTaskMemory(
        ppxIdleTaskTCBBuffer: *mut *mut StaticTask_t,
        ppxIdleTaskStackBuffer: *mut *mut StackType_t,
        pulIdleTaskStackSize: *mut u32,
    );
}
unsafe extern "C" {
    #[doc = " Calls the hook function associated with xTask.  Passing xTask as NULL has\n the effect of calling the Running tasks (the calling task) hook function.\n\n pvParameter is passed to the hook function for the task to interpret as it\n wants.  The return value is the value returned by the task hook function\n registered by the user."]
    pub fn xTaskCallApplicationTaskHook(
        xTask: TaskHandle_t,
        pvParameter: *mut ::std::os::raw::c_void,
    ) -> BaseType_t;
}
unsafe extern "C" {
    #[doc = " xTaskGetIdleTaskHandle() is only available if\n INCLUDE_xTaskGetIdleTaskHandle is set to 1 in FreeRTOSConfig.h.\n\n Simply returns the handle of the idle task of the current core.  It is not\n valid to call xTaskGetIdleTaskHandle() before the scheduler has been started."]
    pub fn xTaskGetIdleTaskHandle() -> TaskHandle_t;
}
unsafe extern "C" {
    #[doc = " configUSE_TRACE_FACILITY must be defined as 1 in FreeRTOSConfig.h for\n uxTaskGetSystemState() to be available.\n\n uxTaskGetSystemState() populates an TaskStatus_t structure for each task in\n the system.  TaskStatus_t structures contain, among other things, members\n for the task handle, task name, task priority, task state, and total amount\n of run time consumed by the task.  See the TaskStatus_t structure\n definition in this file for the full member list.\n\n NOTE:  This function is intended for debugging use only as its use results in\n the scheduler remaining suspended for an extended period.\n\n @param pxTaskStatusArray A pointer to an array of TaskStatus_t structures.\n The array must contain at least one TaskStatus_t structure for each task\n that is under the control of the RTOS.  The number of tasks under the control\n of the RTOS can be determined using the uxTaskGetNumberOfTasks() API function.\n\n @param uxArraySize The size of the array pointed to by the pxTaskStatusArray\n parameter.  The size is specified as the number of indexes in the array, or\n the number of TaskStatus_t structures contained in the array, not by the\n number of bytes in the array.\n\n @param pulTotalRunTime If configGENERATE_RUN_TIME_STATS is set to 1 in\n FreeRTOSConfig.h then *pulTotalRunTime is set by uxTaskGetSystemState() to the\n total run time (as defined by the run time stats clock, see\n https://www.FreeRTOS.org/rtos-run-time-stats.html) since the target booted.\n pulTotalRunTime can be set to NULL to omit the total run time information.\n\n @return The number of TaskStatus_t structures that were populated by\n uxTaskGetSystemState().  This should equal the number returned by the\n uxTaskGetNumberOfTasks() API function, but will be zero if the value passed\n in the uxArraySize parameter was too small.\n\n Example usage:\n @code{c}\n  // This example demonstrates how a human readable table of run time stats\n  // information is generated from raw data provided by uxTaskGetSystemState().\n  // The human readable table is written to pcWriteBuffer\n  void vTaskGetRunTimeStats( char *pcWriteBuffer )\n  {\n  TaskStatus_t *pxTaskStatusArray;\n  volatile UBaseType_t uxArraySize, x;\n  configRUN_TIME_COUNTER_TYPE ulTotalRunTime, ulStatsAsPercentage;\n\n      // Make sure the write buffer does not contain a string.\n pcWriteBuffer = 0x00;\n\n      // Take a snapshot of the number of tasks in case it changes while this\n      // function is executing.\n      uxArraySize = uxTaskGetNumberOfTasks();\n\n      // Allocate a TaskStatus_t structure for each task.  An array could be\n      // allocated statically at compile time.\n      pxTaskStatusArray = pvPortMalloc( uxArraySize * sizeof( TaskStatus_t ) );\n\n      if( pxTaskStatusArray != NULL )\n      {\n          // Generate raw status information about each task.\n          uxArraySize = uxTaskGetSystemState( pxTaskStatusArray, uxArraySize, &ulTotalRunTime );\n\n          // For percentage calculations.\n          ulTotalRunTime /= 100UL;\n\n          // Avoid divide by zero errors.\n          if( ulTotalRunTime > 0 )\n          {\n              // For each populated position in the pxTaskStatusArray array,\n              // format the raw data as human readable ASCII data\n              for( x = 0; x < uxArraySize; x++ )\n              {\n                  // What percentage of the total run time has the task used?\n                  // This will always be rounded down to the nearest integer.\n                  // ulTotalRunTimeDiv100 has already been divided by 100.\n                  ulStatsAsPercentage = pxTaskStatusArray[ x ].ulRunTimeCounter / ulTotalRunTime;\n\n                  if( ulStatsAsPercentage > 0UL )\n                  {\n                      sprintf( pcWriteBuffer, \"%s\\t\\t%lu\\t\\t%lu%%\\r\\n\", pxTaskStatusArray[ x ].pcTaskName, pxTaskStatusArray[ x ].ulRunTimeCounter, ulStatsAsPercentage );\n                  }\n                  else\n                  {\n                      // If the percentage is zero here then the task has\n                      // consumed less than 1% of the total run time.\n                      sprintf( pcWriteBuffer, \"%s\\t\\t%lu\\t\\t<1%%\\r\\n\", pxTaskStatusArray[ x ].pcTaskName, pxTaskStatusArray[ x ].ulRunTimeCounter );\n                  }\n\n                  pcWriteBuffer += strlen( ( char * ) pcWriteBuffer );\n              }\n          }\n\n          // The array is no longer needed, free the memory it consumes.\n          vPortFree( pxTaskStatusArray );\n      }\n  }\n  @endcode"]
    pub fn uxTaskGetSystemState(
        pxTaskStatusArray: *mut TaskStatus_t,
        uxArraySize: UBaseType_t,
        pulTotalRunTime: *mut u32,
    ) -> UBaseType_t;
}
unsafe extern "C" {
    #[doc = " configUSE_TRACE_FACILITY and configUSE_STATS_FORMATTING_FUNCTIONS must\n both be defined as 1 for this function to be available.  See the\n configuration section of the FreeRTOS.org website for more information.\n\n NOTE 1: This function will disable interrupts for its duration.  It is\n not intended for normal application runtime use but as a debug aid.\n\n Lists all the current tasks, along with their current state and stack\n usage high water mark.\n\n Tasks are reported as blocked ('B'), ready ('R'), deleted ('D') or\n suspended ('S').\n\n PLEASE NOTE:\n\n This function is provided for convenience only, and is used by many of the\n demo applications.  Do not consider it to be part of the scheduler.\n\n vTaskList() calls uxTaskGetSystemState(), then formats part of the\n uxTaskGetSystemState() output into a human readable table that displays task:\n names, states, priority, stack usage and task number.\n Stack usage specified as the number of unused StackType_t words stack can hold\n on top of stack - not the number of bytes.\n\n vTaskList() has a dependency on the sprintf() C library function that might\n bloat the code size, use a lot of stack, and provide different results on\n different platforms.  An alternative, tiny, third party, and limited\n functionality implementation of sprintf() is provided in many of the\n FreeRTOS/Demo sub-directories in a file called printf-stdarg.c (note\n printf-stdarg.c does not provide a full snprintf() implementation!).\n\n It is recommended that production systems call uxTaskGetSystemState()\n directly to get access to raw stats data, rather than indirectly through a\n call to vTaskList().\n\n @param pcWriteBuffer A buffer into which the above mentioned details\n will be written, in ASCII form.  This buffer is assumed to be large\n enough to contain the generated report.  Approximately 40 bytes per\n task should be sufficient.\n\n \\ingroup TaskUtils"]
    pub fn vTaskList(pcWriteBuffer: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
